#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Motorbike_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Motorbike_03.ABP_Motorbike_03_C
// 0x0E40 (0x16C0 - 0x0880)
class UABP_Motorbike_03_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5D86681C4346496728439B93FCEF7D5C; // 0x0888(0x0048)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_17060527498171F87C24DDA3134FA8A4; // 0x08D0(0x0088)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F69F66004EC74A345B849392062DD01F; // 0x0958(0x0098)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_7695BD8C434CD73EE3F5D1AC8AC2E0EF; // 0x09F0(0x00D8)()
	uint8                                         Pad_AC8[0x8];                                      // 0x0AC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_DB60E5D0417258BF407281A4EFA0B418; // 0x0AD0(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_46BF958E43308BD407150AB73FDA67E8; // 0x0C20(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_DA3721A846C986446C88B1B820A50FCD; // 0x0C68(0x0038)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3E144B7846C5F2F47950DDA9A5B5DB83; // 0x0CA0(0x0048)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_C22BFA20450151D0CB093A811A6D1D18; // 0x0CE8(0x0098)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_57BB85B14C7E7648814926AA5F0F7575; // 0x0D80(0x0098)()
	uint8                                         Pad_E18[0x8];                                      // 0x0E18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2336E6F44EBF81F4E38174932AED6EFD; // 0x0E20(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7A94A8CB4DA54D0FBA8C97B981FB1CBC; // 0x0F70(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_94CBF9574C5D1CE97EB906922046226D; // 0x10C0(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_F4F528524B0379E35E59EFA1A0773037; // 0x1210(0x0150)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_79E6A0D24EED59EEE71332B0CBAFEDBB; // 0x1360(0x00B0)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_D34588D443DA1A3A519FF3B1DE69C56B; // 0x1410(0x0268)()
	class ABP_Motorbike_03_C*                     BikeRef;                                           // 0x1678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SteerRoll;                                         // 0x1680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               BodyRot;                                           // 0x1684(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AD_Alpha;                                          // 0x1690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                LastVelocity;                                      // 0x1694(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                EF;                                                // 0x16A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16AC[0x4];                                     // 0x16AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslMotorbikeVehicle*                   BikeRef4;                                          // 0x16B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Motorbike_03(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Motorbike_03_AnimGraphNode_ModifyBone_79E6A0D24EED59EEE71332B0CBAFEDBB();
	void TickBikePose();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Motorbike_03_C">();
	}
	static class UABP_Motorbike_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Motorbike_03_C>();
	}
};
static_assert(alignof(UABP_Motorbike_03_C) == 0x000010, "Wrong alignment on UABP_Motorbike_03_C");
static_assert(sizeof(UABP_Motorbike_03_C) == 0x0016C0, "Wrong size on UABP_Motorbike_03_C");
static_assert(offsetof(UABP_Motorbike_03_C, UberGraphFrame) == 0x000880, "Member 'UABP_Motorbike_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_ComponentToLocalSpace_5D86681C4346496728439B93FCEF7D5C) == 0x000888, "Member 'UABP_Motorbike_03_C::AnimGraphNode_ComponentToLocalSpace_5D86681C4346496728439B93FCEF7D5C' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_WheelHandler_17060527498171F87C24DDA3134FA8A4) == 0x0008D0, "Member 'UABP_Motorbike_03_C::AnimGraphNode_WheelHandler_17060527498171F87C24DDA3134FA8A4' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_CopyBone_F69F66004EC74A345B849392062DD01F) == 0x000958, "Member 'UABP_Motorbike_03_C::AnimGraphNode_CopyBone_F69F66004EC74A345B849392062DD01F' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_BoneDrivenController_7695BD8C434CD73EE3F5D1AC8AC2E0EF) == 0x0009F0, "Member 'UABP_Motorbike_03_C::AnimGraphNode_BoneDrivenController_7695BD8C434CD73EE3F5D1AC8AC2E0EF' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LookAt_DB60E5D0417258BF407281A4EFA0B418) == 0x000AD0, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LookAt_DB60E5D0417258BF407281A4EFA0B418' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LocalToComponentSpace_46BF958E43308BD407150AB73FDA67E8) == 0x000C20, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LocalToComponentSpace_46BF958E43308BD407150AB73FDA67E8' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LocalRefPose_DA3721A846C986446C88B1B820A50FCD) == 0x000C68, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LocalRefPose_DA3721A846C986446C88B1B820A50FCD' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_Root_3E144B7846C5F2F47950DDA9A5B5DB83) == 0x000CA0, "Member 'UABP_Motorbike_03_C::AnimGraphNode_Root_3E144B7846C5F2F47950DDA9A5B5DB83' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_RotationMultiplier_C22BFA20450151D0CB093A811A6D1D18) == 0x000CE8, "Member 'UABP_Motorbike_03_C::AnimGraphNode_RotationMultiplier_C22BFA20450151D0CB093A811A6D1D18' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_RotationMultiplier_57BB85B14C7E7648814926AA5F0F7575) == 0x000D80, "Member 'UABP_Motorbike_03_C::AnimGraphNode_RotationMultiplier_57BB85B14C7E7648814926AA5F0F7575' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LookAt_2336E6F44EBF81F4E38174932AED6EFD) == 0x000E20, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LookAt_2336E6F44EBF81F4E38174932AED6EFD' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LookAt_7A94A8CB4DA54D0FBA8C97B981FB1CBC) == 0x000F70, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LookAt_7A94A8CB4DA54D0FBA8C97B981FB1CBC' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LookAt_94CBF9574C5D1CE97EB906922046226D) == 0x0010C0, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LookAt_94CBF9574C5D1CE97EB906922046226D' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_LookAt_F4F528524B0379E35E59EFA1A0773037) == 0x001210, "Member 'UABP_Motorbike_03_C::AnimGraphNode_LookAt_F4F528524B0379E35E59EFA1A0773037' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_ModifyBone_79E6A0D24EED59EEE71332B0CBAFEDBB) == 0x001360, "Member 'UABP_Motorbike_03_C::AnimGraphNode_ModifyBone_79E6A0D24EED59EEE71332B0CBAFEDBB' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AnimGraphNode_AnimDynamics_D34588D443DA1A3A519FF3B1DE69C56B) == 0x001410, "Member 'UABP_Motorbike_03_C::AnimGraphNode_AnimDynamics_D34588D443DA1A3A519FF3B1DE69C56B' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, BikeRef) == 0x001678, "Member 'UABP_Motorbike_03_C::BikeRef' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, SteerRoll) == 0x001680, "Member 'UABP_Motorbike_03_C::SteerRoll' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, BodyRot) == 0x001684, "Member 'UABP_Motorbike_03_C::BodyRot' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, AD_Alpha) == 0x001690, "Member 'UABP_Motorbike_03_C::AD_Alpha' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, LastVelocity) == 0x001694, "Member 'UABP_Motorbike_03_C::LastVelocity' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, EF) == 0x0016A0, "Member 'UABP_Motorbike_03_C::EF' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_03_C, BikeRef4) == 0x0016B0, "Member 'UABP_Motorbike_03_C::BikeRef4' has a wrong offset!");

}

