#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Motorbike_04

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.ExecuteUbergraph_ABP_Motorbike_04
// 0x0020 (0x0020 - 0x0000)
struct ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04) == 0x000004, "Wrong alignment on ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04");
static_assert(sizeof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04) == 0x000020, "Wrong size on ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04");
static_assert(offsetof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04, EntryPoint) == 0x000000, "Member 'ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'ABP_Motorbike_04_C_ExecuteUbergraph_ABP_Motorbike_04::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Motorbike_04_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Motorbike_04_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Motorbike_04_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Motorbike_04_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Motorbike_04_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Motorbike_04_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.TickBikePose
// 0x01A0 (0x01A0 - 0x0000)
struct ABP_Motorbike_04_C_TickBikePose final
{
public:
	class UTslWheeledVehicleMovement*             CallFunc_GetTslVehicleMovement_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWheelSuspensionMaxRaise_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWheelSuspensionMaxDrop_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_VehicleHasDriver_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue2;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_InverseTransformDirection_ReturnValue;    // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue2;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue3;             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetPhysicsAngularVelocity_ReturnValue;    // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue4;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKickstandActive_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X2;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCOMSteerOffset_ReturnValue;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslMotorbikeVehicle*                   K2Node_DynamicCast_AsTsl_Motorbike_Vehicle;        // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue2;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue5;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue3;        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue4;        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue3;                 // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue2;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_TickBikePose) == 0x000010, "Wrong alignment on ABP_Motorbike_04_C_TickBikePose");
static_assert(sizeof(ABP_Motorbike_04_C_TickBikePose) == 0x0001A0, "Wrong size on ABP_Motorbike_04_C_TickBikePose");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetTslVehicleMovement_ReturnValue) == 0x000000, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetTslVehicleMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWheelSuspensionMaxRaise_ReturnValue) == 0x000008, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWheelSuspensionMaxRaise_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWheelSuspensionMaxDrop_ReturnValue) == 0x00000C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWheelSuspensionMaxDrop_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000010, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_VehicleHasDriver_ReturnValue) == 0x000014, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_VehicleHasDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetComponentVelocity_ReturnValue) == 0x000018, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000024, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MakeRotator_ReturnValue) == 0x000070, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetComponentVelocity_ReturnValue2) == 0x00007C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetComponentVelocity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_VSize_ReturnValue) == 0x000088, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_InverseTransformDirection_ReturnValue) == 0x00008C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_InverseTransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_X) == 0x00009C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_Y) == 0x0000A0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_Z) == 0x0000A4, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000A8, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000AC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_SelectFloat_ReturnValue) == 0x0000B0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MapRangeClamped_ReturnValue) == 0x0000B4, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MapRangeClamped_ReturnValue2) == 0x0000B8, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MapRangeClamped_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MapRangeClamped_ReturnValue3) == 0x0000BC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MapRangeClamped_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetUpVector_ReturnValue) == 0x0000C0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000CC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetPhysicsAngularVelocity_ReturnValue) == 0x0000D0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetPhysicsAngularVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MapRangeClamped_ReturnValue4) == 0x0000DC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MapRangeClamped_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000E0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_IsKickstandActive_ReturnValue) == 0x0000EC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_IsKickstandActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_X2) == 0x0000F0, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_Y2) == 0x0000F4, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BreakVector_Z2) == 0x0000F8, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000100, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_SelectFloat_ReturnValue2) == 0x000104, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000108, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_FInterpTo_Constant_ReturnValue) == 0x00010C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_FClamp_ReturnValue) == 0x000110, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000118, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetCOMSteerOffset_ReturnValue) == 0x000120, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetCOMSteerOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, K2Node_DynamicCast_AsTsl_Motorbike_Vehicle) == 0x000128, "Member 'ABP_Motorbike_04_C_TickBikePose::K2Node_DynamicCast_AsTsl_Motorbike_Vehicle' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, K2Node_DynamicCast_bSuccess) == 0x000130, "Member 'ABP_Motorbike_04_C_TickBikePose::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000134, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWorldDeltaSeconds_ReturnValue2) == 0x000138, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWorldDeltaSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetVelocity_ReturnValue) == 0x00013C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_VSize_ReturnValue2) == 0x000148, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00014C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MapRangeClamped_ReturnValue5) == 0x000158, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MapRangeClamped_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Divide_VectorFloat_ReturnValue) == 0x00015C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MakeRotator_ReturnValue2) == 0x000168, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWorldDeltaSeconds_ReturnValue3) == 0x000174, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWorldDeltaSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_GetWorldDeltaSeconds_ReturnValue4) == 0x000178, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_GetWorldDeltaSeconds_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_FInterpTo_ReturnValue) == 0x00017C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_MakeRotator_ReturnValue3) == 0x000180, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_MakeRotator_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Add_FloatFloat_ReturnValue) == 0x00018C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_FClamp_ReturnValue2) == 0x000190, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000194, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBikePose, CallFunc_FInterpTo_ReturnValue2) == 0x00019C, "Member 'ABP_Motorbike_04_C_TickBikePose::CallFunc_FInterpTo_ReturnValue2' has a wrong offset!");

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.TickFrontSuspension
// 0x0030 (0x0030 - 0x0000)
struct ABP_Motorbike_04_C_TickFrontSuspension final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslWheeledVehicleMovement*             CallFunc_GetTslVehicleMovement_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleWheel*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSuspensionOffset_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_TickFrontSuspension) == 0x000008, "Wrong alignment on ABP_Motorbike_04_C_TickFrontSuspension");
static_assert(sizeof(ABP_Motorbike_04_C_TickFrontSuspension) == 0x000030, "Wrong size on ABP_Motorbike_04_C_TickFrontSuspension");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_GetTslVehicleMovement_ReturnValue) == 0x000008, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_GetTslVehicleMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_Array_Get_Item) == 0x000010, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_GetSuspensionOffset_ReturnValue) == 0x00001C, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_GetSuspensionOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000024, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickFrontSuspension, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'ABP_Motorbike_04_C_TickFrontSuspension::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.TickBackSuspension
// 0x0030 (0x0030 - 0x0000)
struct ABP_Motorbike_04_C_TickBackSuspension final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslWheeledVehicleMovement*             CallFunc_GetTslVehicleMovement_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleWheel*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSuspensionOffset_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_TickBackSuspension) == 0x000008, "Wrong alignment on ABP_Motorbike_04_C_TickBackSuspension");
static_assert(sizeof(ABP_Motorbike_04_C_TickBackSuspension) == 0x000030, "Wrong size on ABP_Motorbike_04_C_TickBackSuspension");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_GetTslVehicleMovement_ReturnValue) == 0x000008, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_GetTslVehicleMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_Array_Get_Item) == 0x000010, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_GetSuspensionOffset_ReturnValue) == 0x00001C, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_GetSuspensionOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000020, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000024, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickBackSuspension, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'ABP_Motorbike_04_C_TickBackSuspension::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function ABP_Motorbike_04.ABP_Motorbike_04_C.TickSteer
// 0x0020 (0x0020 - 0x0000)
struct ABP_Motorbike_04_C_TickSteer final
{
public:
	class UTslWheeledVehicleMovement*             CallFunc_GetTslVehicleMovement_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSteeringInputClamped_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Motorbike_04_C_TickSteer) == 0x000008, "Wrong alignment on ABP_Motorbike_04_C_TickSteer");
static_assert(sizeof(ABP_Motorbike_04_C_TickSteer) == 0x000020, "Wrong size on ABP_Motorbike_04_C_TickSteer");
static_assert(offsetof(ABP_Motorbike_04_C_TickSteer, CallFunc_GetTslVehicleMovement_ReturnValue) == 0x000000, "Member 'ABP_Motorbike_04_C_TickSteer::CallFunc_GetTslVehicleMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickSteer, CallFunc_GetSteeringInputClamped_ReturnValue) == 0x000008, "Member 'ABP_Motorbike_04_C_TickSteer::CallFunc_GetSteeringInputClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C_TickSteer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'ABP_Motorbike_04_C_TickSteer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
