#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Motorbike_04_Sidecar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Motorbike_04_Sidecar.ABP_Motorbike_04_Sidecar_C
// 0x0FE0 (0x1860 - 0x0880)
class UABP_Motorbike_04_Sidecar_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2BA4401C41D527D1F4CA91ADBD401744; // 0x0888(0x0048)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_B556C8A74DF35714EC73A0AEB2DAF39E; // 0x08D0(0x0088)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9166E0364609E50181537F8E86FF203A; // 0x0958(0x0098)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_C27266324C748685DB45609450C7CE3A; // 0x09F0(0x00D8)()
	uint8                                         Pad_AC8[0x8];                                      // 0x0AC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4F2C49264CDF2244866894951259AFDB; // 0x0AD0(0x0150)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16772EBB4ACFCAE04DC700A076B12F9C; // 0x0C20(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8E69C072408CE2D4338C4B9119E00D1B; // 0x0C68(0x0038)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8147BAF045DB84D345FD03BBC900FE1B; // 0x0CA0(0x0048)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_D6CFEEB54630C0F0D56941A10EDAAA0D; // 0x0CE8(0x0098)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_98F0D58B42CC1DAF929BDD82BA4950AF; // 0x0D80(0x0098)()
	uint8                                         Pad_E18[0x8];                                      // 0x0E18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1AB4EC01420DFCD79756C1B61AE240E0; // 0x0E20(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_9F1CBCD349EB66B7C3F4F9AE67AF519D; // 0x0F70(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_340FA171423B264747775F974A9976B1; // 0x10C0(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_A8C83AB74934A68683310F8988B0A65F; // 0x1210(0x0150)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_667EFEB64E62473E948009AB4A214191; // 0x1360(0x00B0)()
	struct FAnimNode_RotationMultiplier           AnimGraphNode_RotationMultiplier_35273B904539F81233C7E6B844278DC8; // 0x1410(0x0098)()
	struct FAnimNode_BoneDrivenController         AnimGraphNode_BoneDrivenController_B683B53447BEBD52795000ADA3078837; // 0x14A8(0x00D8)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_AB2B241D412579B32716889387C4E029; // 0x1580(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_A2C074A84022463F56261985AF0370D8; // 0x16D0(0x0150)()
	class ATslMotorbikeVehicle*                   BikeRef;                                           // 0x1820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         SteerRoll;                                         // 0x1828(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               BodyRot;                                           // 0x182C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AD_Alpha;                                          // 0x1838(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                LastVelocity;                                      // 0x183C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                EF;                                                // 0x1848(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Motorbike_04_Sidecar(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Motorbike_04_Sidecar_AnimGraphNode_ModifyBone_667EFEB64E62473E948009AB4A214191();
	void TickBikePose();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Motorbike_04_Sidecar_C">();
	}
	static class UABP_Motorbike_04_Sidecar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Motorbike_04_Sidecar_C>();
	}
};
static_assert(alignof(UABP_Motorbike_04_Sidecar_C) == 0x000010, "Wrong alignment on UABP_Motorbike_04_Sidecar_C");
static_assert(sizeof(UABP_Motorbike_04_Sidecar_C) == 0x001860, "Wrong size on UABP_Motorbike_04_Sidecar_C");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, UberGraphFrame) == 0x000880, "Member 'UABP_Motorbike_04_Sidecar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_ComponentToLocalSpace_2BA4401C41D527D1F4CA91ADBD401744) == 0x000888, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_ComponentToLocalSpace_2BA4401C41D527D1F4CA91ADBD401744' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_WheelHandler_B556C8A74DF35714EC73A0AEB2DAF39E) == 0x0008D0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_WheelHandler_B556C8A74DF35714EC73A0AEB2DAF39E' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_CopyBone_9166E0364609E50181537F8E86FF203A) == 0x000958, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_CopyBone_9166E0364609E50181537F8E86FF203A' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_BoneDrivenController_C27266324C748685DB45609450C7CE3A) == 0x0009F0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_BoneDrivenController_C27266324C748685DB45609450C7CE3A' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_4F2C49264CDF2244866894951259AFDB) == 0x000AD0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_4F2C49264CDF2244866894951259AFDB' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LocalToComponentSpace_16772EBB4ACFCAE04DC700A076B12F9C) == 0x000C20, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LocalToComponentSpace_16772EBB4ACFCAE04DC700A076B12F9C' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LocalRefPose_8E69C072408CE2D4338C4B9119E00D1B) == 0x000C68, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LocalRefPose_8E69C072408CE2D4338C4B9119E00D1B' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_Root_8147BAF045DB84D345FD03BBC900FE1B) == 0x000CA0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_Root_8147BAF045DB84D345FD03BBC900FE1B' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_RotationMultiplier_D6CFEEB54630C0F0D56941A10EDAAA0D) == 0x000CE8, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_RotationMultiplier_D6CFEEB54630C0F0D56941A10EDAAA0D' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_RotationMultiplier_98F0D58B42CC1DAF929BDD82BA4950AF) == 0x000D80, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_RotationMultiplier_98F0D58B42CC1DAF929BDD82BA4950AF' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_1AB4EC01420DFCD79756C1B61AE240E0) == 0x000E20, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_1AB4EC01420DFCD79756C1B61AE240E0' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_9F1CBCD349EB66B7C3F4F9AE67AF519D) == 0x000F70, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_9F1CBCD349EB66B7C3F4F9AE67AF519D' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_340FA171423B264747775F974A9976B1) == 0x0010C0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_340FA171423B264747775F974A9976B1' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_A8C83AB74934A68683310F8988B0A65F) == 0x001210, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_A8C83AB74934A68683310F8988B0A65F' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_ModifyBone_667EFEB64E62473E948009AB4A214191) == 0x001360, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_ModifyBone_667EFEB64E62473E948009AB4A214191' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_RotationMultiplier_35273B904539F81233C7E6B844278DC8) == 0x001410, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_RotationMultiplier_35273B904539F81233C7E6B844278DC8' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_BoneDrivenController_B683B53447BEBD52795000ADA3078837) == 0x0014A8, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_BoneDrivenController_B683B53447BEBD52795000ADA3078837' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_AB2B241D412579B32716889387C4E029) == 0x001580, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_AB2B241D412579B32716889387C4E029' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AnimGraphNode_LookAt_A2C074A84022463F56261985AF0370D8) == 0x0016D0, "Member 'UABP_Motorbike_04_Sidecar_C::AnimGraphNode_LookAt_A2C074A84022463F56261985AF0370D8' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, BikeRef) == 0x001820, "Member 'UABP_Motorbike_04_Sidecar_C::BikeRef' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, SteerRoll) == 0x001828, "Member 'UABP_Motorbike_04_Sidecar_C::SteerRoll' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, BodyRot) == 0x00182C, "Member 'UABP_Motorbike_04_Sidecar_C::BodyRot' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, AD_Alpha) == 0x001838, "Member 'UABP_Motorbike_04_Sidecar_C::AD_Alpha' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, LastVelocity) == 0x00183C, "Member 'UABP_Motorbike_04_Sidecar_C::LastVelocity' has a wrong offset!");
static_assert(offsetof(UABP_Motorbike_04_Sidecar_C, EF) == 0x001848, "Member 'UABP_Motorbike_04_Sidecar_C::EF' has a wrong offset!");

}

