#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct AkAudio.AkAudioEventTrackKey
// 0x0020 (0x0020 - 0x0000)
struct FAkAudioEventTrackKey final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAkAudioEventTrackKey) == 0x000008, "Wrong alignment on FAkAudioEventTrackKey");
static_assert(sizeof(FAkAudioEventTrackKey) == 0x000020, "Wrong size on FAkAudioEventTrackKey");
static_assert(offsetof(FAkAudioEventTrackKey, Time) == 0x000000, "Member 'FAkAudioEventTrackKey::Time' has a wrong offset!");
static_assert(offsetof(FAkAudioEventTrackKey, AkAudioEvent) == 0x000008, "Member 'FAkAudioEventTrackKey::AkAudioEvent' has a wrong offset!");
static_assert(offsetof(FAkAudioEventTrackKey, EventName) == 0x000010, "Member 'FAkAudioEventTrackKey::EventName' has a wrong offset!");

}

