#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleListWidget.BattleListWidget_C
// 0x0030 (0x0270 - 0x0240)
class UBattleListWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BGBOX;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UScrollBox*                             List;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class ATslCharacter*>                  RefreshedPlayerLIst;                               // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsShow;                                            // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BattleListWidget(int32 EntryPoint);
	void TimerCheckUpdateList();
	void CustomTick();
	void Construct();
	void RefreshPlayerList();
	void UpdateBattleList();
	void FindCharacterByPlayerState(class APlayerState* PlayerState, class ATslCharacter** Character);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleListWidget_C">();
	}
	static class UBattleListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleListWidget_C>();
	}
};
static_assert(alignof(UBattleListWidget_C) == 0x000008, "Wrong alignment on UBattleListWidget_C");
static_assert(sizeof(UBattleListWidget_C) == 0x000270, "Wrong size on UBattleListWidget_C");
static_assert(offsetof(UBattleListWidget_C, UberGraphFrame) == 0x000240, "Member 'UBattleListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattleListWidget_C, BGBOX) == 0x000248, "Member 'UBattleListWidget_C::BGBOX' has a wrong offset!");
static_assert(offsetof(UBattleListWidget_C, List) == 0x000250, "Member 'UBattleListWidget_C::List' has a wrong offset!");
static_assert(offsetof(UBattleListWidget_C, RefreshedPlayerLIst) == 0x000258, "Member 'UBattleListWidget_C::RefreshedPlayerLIst' has a wrong offset!");
static_assert(offsetof(UBattleListWidget_C, IsShow) == 0x000268, "Member 'UBattleListWidget_C::IsShow' has a wrong offset!");

}

