#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BigEquipmentSlotWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.ExecuteUbergraph_BigEquipmentSlotWidget
// 0x0030 (0x0030 - 0x0000)
struct BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_Event_Item;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         K2Node_MakeStruct_EquipPosition;                   // 0x0010(0x0008)()
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget");
static_assert(sizeof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget) == 0x000030, "Wrong size on BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, EntryPoint) == 0x000000, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, K2Node_Event_Item) == 0x000008, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, K2Node_MakeStruct_EquipPosition) == 0x000010, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::K2Node_MakeStruct_EquipPosition' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, CallFunc_GetItem_ReturnValue) == 0x000018, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::CallFunc_GetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BigEquipmentSlotWidget_C_ExecuteUbergraph_BigEquipmentSlotWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.OnUpdateItem
// 0x0008 (0x0008 - 0x0000)
struct BigEquipmentSlotWidget_C_OnUpdateItem final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_OnUpdateItem) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_OnUpdateItem");
static_assert(sizeof(BigEquipmentSlotWidget_C_OnUpdateItem) == 0x000008, "Wrong size on BigEquipmentSlotWidget_C_OnUpdateItem");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnUpdateItem, Item_0) == 0x000000, "Member 'BigEquipmentSlotWidget_C_OnUpdateItem::Item_0' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetSlotName
// 0x0048 (0x0048 - 0x0000)
struct BigEquipmentSlotWidget_C_GetSlotName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotName_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetSlotName_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetSlotName) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_GetSlotName");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetSlotName) == 0x000048, "Wrong size on BigEquipmentSlotWidget_C_GetSlotName");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotName, ReturnValue) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetSlotName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BigEquipmentSlotWidget_C_GetSlotName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotName, CallFunc_GetSlotName_self_CastInput) == 0x000020, "Member 'BigEquipmentSlotWidget_C_GetSlotName::CallFunc_GetSlotName_self_CastInput' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotName, CallFunc_GetSlotName_ReturnValue) == 0x000030, "Member 'BigEquipmentSlotWidget_C_GetSlotName::CallFunc_GetSlotName_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.OnDragDetected
// 0x00C0 (0x00C0 - 0x0000)
struct BigEquipmentSlotWidget_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            CallFunc_CreateTslDragDropOperation_Bp_OutOperation; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_OnDragDetected) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_OnDragDetected");
static_assert(sizeof(BigEquipmentSlotWidget_C_OnDragDetected) == 0x0000C0, "Wrong size on BigEquipmentSlotWidget_C_OnDragDetected");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'BigEquipmentSlotWidget_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'BigEquipmentSlotWidget_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnDragDetected, Operation) == 0x0000B0, "Member 'BigEquipmentSlotWidget_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnDragDetected, CallFunc_CreateTslDragDropOperation_Bp_OutOperation) == 0x0000B8, "Member 'BigEquipmentSlotWidget_C_OnDragDetected::CallFunc_CreateTslDragDropOperation_Bp_OutOperation' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetDurabilityPercent
// 0x000C (0x000C - 0x0000)
struct BigEquipmentSlotWidget_C_GetDurabilityPercent final
{
public:
	float                                         DurabilityPercent;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetDurabilityPercent) == 0x000004, "Wrong alignment on BigEquipmentSlotWidget_C_GetDurabilityPercent");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetDurabilityPercent) == 0x00000C, "Wrong size on BigEquipmentSlotWidget_C_GetDurabilityPercent");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetDurabilityPercent, DurabilityPercent) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetDurabilityPercent::DurabilityPercent' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetDurabilityPercent, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BigEquipmentSlotWidget_C_GetDurabilityPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetDurabilityPercent, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000008, "Member 'BigEquipmentSlotWidget_C_GetDurabilityPercent::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.HaveDurability
// 0x0003 (0x0003 - 0x0000)
struct BigEquipmentSlotWidget_C_HaveDurability final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_HaveDurability) == 0x000001, "Wrong alignment on BigEquipmentSlotWidget_C_HaveDurability");
static_assert(sizeof(BigEquipmentSlotWidget_C_HaveDurability) == 0x000003, "Wrong size on BigEquipmentSlotWidget_C_HaveDurability");
static_assert(offsetof(BigEquipmentSlotWidget_C_HaveDurability, Result) == 0x000000, "Member 'BigEquipmentSlotWidget_C_HaveDurability::Result' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_HaveDurability, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BigEquipmentSlotWidget_C_HaveDurability::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_HaveDurability, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000002, "Member 'BigEquipmentSlotWidget_C_HaveDurability::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.OnPreviewMouseButtonDown
// 0x0430 (0x0430 - 0x0000)
struct BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsCharacterCasting_IsCasting;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00A8)()
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0210(0x00A8)()
	TScriptInterface<class ISlotContainerInterface> CallFunc_DoSlotActionDefault_self_CastInput;       // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_DoSlotActionDefault_Slot_CastInput;       // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x02D8(0x00A8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue2;                   // 0x0388(0x00A8)()
};
static_assert(alignof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown");
static_assert(sizeof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown) == 0x000430, "Wrong size on BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_IsCharacterCasting_IsCasting) == 0x000158, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_IsCharacterCasting_IsCasting' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000208, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000210, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DoSlotActionDefault_self_CastInput) == 0x0002B8, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DoSlotActionDefault_self_CastInput' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DoSlotActionDefault_Slot_CastInput) == 0x0002C8, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DoSlotActionDefault_Slot_CastInput' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x0002D8, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_IsValid_ReturnValue) == 0x000380, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue2) == 0x000388, "Member 'BigEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue2' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.UpdateDurabilityVisibility
// 0x0010 (0x0010 - 0x0000)
struct BigEquipmentSlotWidget_C_UpdateDurabilityVisibility final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HaveDurability_Result;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_UpdateDurabilityVisibility");
static_assert(sizeof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility) == 0x000010, "Wrong size on BigEquipmentSlotWidget_C_UpdateDurabilityVisibility");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, BoundWidget) == 0x000000, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::BoundWidget' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, m__bool_Variable) == 0x000008, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, m__byte_Variable) == 0x000009, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, m__byte_Variable2) == 0x00000A, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, CallFunc_HaveDurability_Result) == 0x00000B, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::CallFunc_HaveDurability_Result' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityVisibility, K2Node_Select_Default) == 0x00000C, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityVisibility::K2Node_Select_Default' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.UpdateDurabilityGauge
// 0x0030 (0x0030 - 0x0000)
struct BigEquipmentSlotWidget_C_UpdateDurabilityGauge final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDurabilityPercent_DurabilityPercent;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_DynamicCast_AsImage;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_UpdateDurabilityGauge");
static_assert(sizeof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge) == 0x000030, "Wrong size on BigEquipmentSlotWidget_C_UpdateDurabilityGauge");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, BoundWidget) == 0x000000, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::BoundWidget' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, CallFunc_GetDurabilityPercent_DurabilityPercent) == 0x000008, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::CallFunc_GetDurabilityPercent_DurabilityPercent' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, K2Node_DynamicCast_AsImage) == 0x000010, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::K2Node_DynamicCast_AsImage' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurabilityGauge, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BigEquipmentSlotWidget_C_UpdateDurabilityGauge::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.UpdateDurationNumber
// 0x0040 (0x0040 - 0x0000)
struct BigEquipmentSlotWidget_C_UpdateDurationNumber final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDurabilityPercent_DurabilityPercent;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
static_assert(alignof(BigEquipmentSlotWidget_C_UpdateDurationNumber) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_UpdateDurationNumber");
static_assert(sizeof(BigEquipmentSlotWidget_C_UpdateDurationNumber) == 0x000040, "Wrong size on BigEquipmentSlotWidget_C_UpdateDurationNumber");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, BoundWidget) == 0x000000, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::BoundWidget' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_GetDurabilityPercent_DurabilityPercent) == 0x000008, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_GetDurabilityPercent_DurabilityPercent' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_IsValid_ReturnValue2) == 0x000020, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_FFloor_ReturnValue) == 0x000024, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_UpdateDurationNumber, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'BigEquipmentSlotWidget_C_UpdateDurationNumber::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetDurability
// 0x0008 (0x0008 - 0x0000)
struct BigEquipmentSlotWidget_C_GetDurability final
{
public:
	float                                         Durability;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetDurability) == 0x000004, "Wrong alignment on BigEquipmentSlotWidget_C_GetDurability");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetDurability) == 0x000008, "Wrong size on BigEquipmentSlotWidget_C_GetDurability");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetDurability, Durability) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetDurability::Durability' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetDurability, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BigEquipmentSlotWidget_C_GetDurability::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetItem_Bp
// 0x0018 (0x0018 - 0x0000)
struct BigEquipmentSlotWidget_C_GetItem_Bp final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         K2Node_MakeStruct_EquipPosition;                   // 0x0008(0x0008)()
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetItem_Bp) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_GetItem_Bp");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetItem_Bp) == 0x000018, "Wrong size on BigEquipmentSlotWidget_C_GetItem_Bp");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetItem_Bp, Item_0) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetItem_Bp::Item_0' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetItem_Bp, K2Node_MakeStruct_EquipPosition) == 0x000008, "Member 'BigEquipmentSlotWidget_C_GetItem_Bp::K2Node_MakeStruct_EquipPosition' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetItem_Bp, CallFunc_GetItem_ReturnValue) == 0x000010, "Member 'BigEquipmentSlotWidget_C_GetItem_Bp::CallFunc_GetItem_ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.On_FocusColorBG_Prepass_0
// 0x0008 (0x0008 - 0x0000)
struct BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0");
static_assert(sizeof(BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0) == 0x000008, "Wrong size on BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0");
static_assert(offsetof(BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0, BoundWidget) == 0x000000, "Member 'BigEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0::BoundWidget' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.SetFocus
// 0x0002 (0x0002 - 0x0000)
struct BigEquipmentSlotWidget_C_SetFocus final
{
public:
	bool                                          NewFocus;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_SetFocus) == 0x000001, "Wrong alignment on BigEquipmentSlotWidget_C_SetFocus");
static_assert(sizeof(BigEquipmentSlotWidget_C_SetFocus) == 0x000002, "Wrong size on BigEquipmentSlotWidget_C_SetFocus");
static_assert(offsetof(BigEquipmentSlotWidget_C_SetFocus, NewFocus) == 0x000000, "Member 'BigEquipmentSlotWidget_C_SetFocus::NewFocus' has a wrong offset!");
static_assert(offsetof(BigEquipmentSlotWidget_C_SetFocus, ReturnValue) == 0x000001, "Member 'BigEquipmentSlotWidget_C_SetFocus::ReturnValue' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetSlotContainer
// 0x0010 (0x0010 - 0x0000)
struct BigEquipmentSlotWidget_C_GetSlotContainer final
{
public:
	TScriptInterface<class ISlotContainerInterface> SlotContainer;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetSlotContainer) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_GetSlotContainer");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetSlotContainer) == 0x000010, "Wrong size on BigEquipmentSlotWidget_C_GetSlotContainer");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotContainer, SlotContainer) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetSlotContainer::SlotContainer' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.GetSlotItem
// 0x0010 (0x0010 - 0x0000)
struct BigEquipmentSlotWidget_C_GetSlotItem final
{
public:
	TScriptInterface<class ISlotInterface>        SlotItem;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_GetSlotItem) == 0x000008, "Wrong alignment on BigEquipmentSlotWidget_C_GetSlotItem");
static_assert(sizeof(BigEquipmentSlotWidget_C_GetSlotItem) == 0x000010, "Wrong size on BigEquipmentSlotWidget_C_GetSlotItem");
static_assert(offsetof(BigEquipmentSlotWidget_C_GetSlotItem, SlotItem) == 0x000000, "Member 'BigEquipmentSlotWidget_C_GetSlotItem::SlotItem' has a wrong offset!");

// Function BigEquipmentSlotWidget.BigEquipmentSlotWidget_C.IsFocus
// 0x0001 (0x0001 - 0x0000)
struct BigEquipmentSlotWidget_C_IsFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BigEquipmentSlotWidget_C_IsFocus) == 0x000001, "Wrong alignment on BigEquipmentSlotWidget_C_IsFocus");
static_assert(sizeof(BigEquipmentSlotWidget_C_IsFocus) == 0x000001, "Wrong size on BigEquipmentSlotWidget_C_IsFocus");
static_assert(offsetof(BigEquipmentSlotWidget_C_IsFocus, ReturnValue) == 0x000000, "Member 'BigEquipmentSlotWidget_C_IsFocus::ReturnValue' has a wrong offset!");

}

