#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BikeSidecartWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BikeSidecartWidget.BikeSidecartWidget_C
// 0x0038 (0x0278 - 0x0240)
class UBikeSidecartWidget_C final : public UUserWidget
{
public:
	class UVehicleSeatInfoWidget_C*               BikesidecartDriver_0;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 BikesidecartImage;                                 // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleSeatInfoWidget_C*               BikesidecartRider_1;                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleSeatInfoWidget_C*               BikesidecartRider_2;                               // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeat_0;                                 // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeat_1;                                 // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeat_2;                                 // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BikeSidecartWidget_C">();
	}
	static class UBikeSidecartWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBikeSidecartWidget_C>();
	}
};
static_assert(alignof(UBikeSidecartWidget_C) == 0x000008, "Wrong alignment on UBikeSidecartWidget_C");
static_assert(sizeof(UBikeSidecartWidget_C) == 0x000278, "Wrong size on UBikeSidecartWidget_C");
static_assert(offsetof(UBikeSidecartWidget_C, BikesidecartDriver_0) == 0x000240, "Member 'UBikeSidecartWidget_C::BikesidecartDriver_0' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, BikesidecartImage) == 0x000248, "Member 'UBikeSidecartWidget_C::BikesidecartImage' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, BikesidecartRider_1) == 0x000250, "Member 'UBikeSidecartWidget_C::BikesidecartRider_1' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, BikesidecartRider_2) == 0x000258, "Member 'UBikeSidecartWidget_C::BikesidecartRider_2' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, VehicleTireSeat_0) == 0x000260, "Member 'UBikeSidecartWidget_C::VehicleTireSeat_0' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, VehicleTireSeat_1) == 0x000268, "Member 'UBikeSidecartWidget_C::VehicleTireSeat_1' has a wrong offset!");
static_assert(offsetof(UBikeSidecartWidget_C, VehicleTireSeat_2) == 0x000270, "Member 'UBikeSidecartWidget_C::VehicleTireSeat_2' has a wrong offset!");

}

