#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BloodSpotWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BloodSpotWidget.BloodSpotWidget_C.ExecuteUbergraph_BloodSpotWidget
// 0x0038 (0x0038 - 0x0000)
struct BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForKoreanRating_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UTexture2D*>                     K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget) == 0x000008, "Wrong alignment on BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget");
static_assert(sizeof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget) == 0x000038, "Wrong size on BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, EntryPoint) == 0x000000, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, CallFunc_IsForKoreanRating_ReturnValue) == 0x000004, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::CallFunc_IsForKoreanRating_ReturnValue' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, K2Node_MakeArray_Array) == 0x000018, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, CallFunc_RandomInteger_ReturnValue) == 0x00002C, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget, CallFunc_Array_Get_Item) == 0x000030, "Member 'BloodSpotWidget_C_ExecuteUbergraph_BloodSpotWidget::CallFunc_Array_Get_Item' has a wrong offset!");

}

