#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoatBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BoatBase.BoatBase_C
// 0x0080 (0x0518 - 0x0498)
class ABoatBase_C : public ATslFloatingVehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URadialForceComponent*                  RadialForce;                                       // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCameraComponent*                       FirstPersonCameraInVehicle;                        // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCameraComponent*                       ThirdPersonCameraInVehicle;                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpringArmInVehicleComponent*           FirstPersonSpringArmInVehicle;                     // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpringArmInVehicleComponent*           ThirdPersonSpringArmInVehicle;                     // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         LaunchVelocityFactorOnHitCharacter;                // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DamageCurve;                                       // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactModifier;                                    // 0x04D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactModifierUpsideDown;                          // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactAbsorption;                                  // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactAbsorptionUpsideDown;                        // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactAbsorptionPassenger;                         // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ImpactAbsorptionPassengerUpsideDown;               // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FuelConsumptionModifierBoost;                      // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ExplosionRadius_Inner;                             // 0x04F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ExplosionRadius_Outer;                             // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            FuelConsumptionCurve;                              // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FuelEfficiency;                                    // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FuelConsumptionModifierIdle;                       // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LastFuelConsumptionTime;                           // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BoatBase(int32 EntryPoint);
	void EventFuelConsumption();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BoatBase_C">();
	}
	static class ABoatBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoatBase_C>();
	}
};
static_assert(alignof(ABoatBase_C) == 0x000008, "Wrong alignment on ABoatBase_C");
static_assert(sizeof(ABoatBase_C) == 0x000518, "Wrong size on ABoatBase_C");
static_assert(offsetof(ABoatBase_C, UberGraphFrame) == 0x000498, "Member 'ABoatBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, RadialForce) == 0x0004A0, "Member 'ABoatBase_C::RadialForce' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FirstPersonCameraInVehicle) == 0x0004A8, "Member 'ABoatBase_C::FirstPersonCameraInVehicle' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ThirdPersonCameraInVehicle) == 0x0004B0, "Member 'ABoatBase_C::ThirdPersonCameraInVehicle' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FirstPersonSpringArmInVehicle) == 0x0004B8, "Member 'ABoatBase_C::FirstPersonSpringArmInVehicle' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ThirdPersonSpringArmInVehicle) == 0x0004C0, "Member 'ABoatBase_C::ThirdPersonSpringArmInVehicle' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, LaunchVelocityFactorOnHitCharacter) == 0x0004C8, "Member 'ABoatBase_C::LaunchVelocityFactorOnHitCharacter' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, DamageCurve) == 0x0004D0, "Member 'ABoatBase_C::DamageCurve' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactModifier) == 0x0004D8, "Member 'ABoatBase_C::ImpactModifier' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactModifierUpsideDown) == 0x0004DC, "Member 'ABoatBase_C::ImpactModifierUpsideDown' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactAbsorption) == 0x0004E0, "Member 'ABoatBase_C::ImpactAbsorption' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactAbsorptionUpsideDown) == 0x0004E4, "Member 'ABoatBase_C::ImpactAbsorptionUpsideDown' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactAbsorptionPassenger) == 0x0004E8, "Member 'ABoatBase_C::ImpactAbsorptionPassenger' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ImpactAbsorptionPassengerUpsideDown) == 0x0004EC, "Member 'ABoatBase_C::ImpactAbsorptionPassengerUpsideDown' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FuelConsumptionModifierBoost) == 0x0004F0, "Member 'ABoatBase_C::FuelConsumptionModifierBoost' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ExplosionRadius_Inner) == 0x0004F4, "Member 'ABoatBase_C::ExplosionRadius_Inner' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, ExplosionRadius_Outer) == 0x0004F8, "Member 'ABoatBase_C::ExplosionRadius_Outer' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FuelConsumptionCurve) == 0x000500, "Member 'ABoatBase_C::FuelConsumptionCurve' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FuelEfficiency) == 0x000508, "Member 'ABoatBase_C::FuelEfficiency' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, FuelConsumptionModifierIdle) == 0x00050C, "Member 'ABoatBase_C::FuelConsumptionModifierIdle' has a wrong offset!");
static_assert(offsetof(ABoatBase_C, LastFuelConsumptionTime) == 0x000510, "Member 'ABoatBase_C::LastFuelConsumptionTime' has a wrong offset!");

}

