#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boat_PG117_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Boat_PG117_Animation.Boat_PG117_Animation_C
// 0x0308 (0x07A0 - 0x0498)
class UBoat_PG117_Animation_C final : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6F449E654EF7DE9DD0A9D7822CA89D21; // 0x04A0(0x0048)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_A3EB3FA84C550B2ED5F9B081D8672BB8; // 0x04E8(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8057CE8141CBA4DBCBB2FC8BC84934CE; // 0x0518(0x00B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D1558F914C96EE151AF4F890F275573F; // 0x05C8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_64A4DFC849F2AC37DED7E693D6450034; // 0x0610(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23B5532142004C9B1C5E36A8005A6FD9; // 0x06C0(0x00B0)()
	float                                         SteeringWheelAngle;                                // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RudderAngle;                                       // 0x0774(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PropellerRotation;                                 // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RudderRot;                                         // 0x077C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               SteeringWheelRot;                                  // 0x0788(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PropellerRot;                                      // 0x0794(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Boat_PG117_Animation(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Boat_PG117_Animation_AnimGraphNode_ModifyBone_8057CE8141CBA4DBCBB2FC8BC84934CE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Boat_PG117_Animation_AnimGraphNode_ModifyBone_23B5532142004C9B1C5E36A8005A6FD9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Boat_PG117_Animation_AnimGraphNode_ModifyBone_64A4DFC849F2AC37DED7E693D6450034();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Boat_PG117_Animation_C">();
	}
	static class UBoat_PG117_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBoat_PG117_Animation_C>();
	}
};
static_assert(alignof(UBoat_PG117_Animation_C) == 0x000008, "Wrong alignment on UBoat_PG117_Animation_C");
static_assert(sizeof(UBoat_PG117_Animation_C) == 0x0007A0, "Wrong size on UBoat_PG117_Animation_C");
static_assert(offsetof(UBoat_PG117_Animation_C, UberGraphFrame) == 0x000498, "Member 'UBoat_PG117_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_Root_6F449E654EF7DE9DD0A9D7822CA89D21) == 0x0004A0, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_Root_6F449E654EF7DE9DD0A9D7822CA89D21' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_MeshRefPose_A3EB3FA84C550B2ED5F9B081D8672BB8) == 0x0004E8, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_MeshRefPose_A3EB3FA84C550B2ED5F9B081D8672BB8' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_ModifyBone_8057CE8141CBA4DBCBB2FC8BC84934CE) == 0x000518, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_ModifyBone_8057CE8141CBA4DBCBB2FC8BC84934CE' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_ComponentToLocalSpace_D1558F914C96EE151AF4F890F275573F) == 0x0005C8, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_ComponentToLocalSpace_D1558F914C96EE151AF4F890F275573F' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_ModifyBone_64A4DFC849F2AC37DED7E693D6450034) == 0x000610, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_ModifyBone_64A4DFC849F2AC37DED7E693D6450034' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, AnimGraphNode_ModifyBone_23B5532142004C9B1C5E36A8005A6FD9) == 0x0006C0, "Member 'UBoat_PG117_Animation_C::AnimGraphNode_ModifyBone_23B5532142004C9B1C5E36A8005A6FD9' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, SteeringWheelAngle) == 0x000770, "Member 'UBoat_PG117_Animation_C::SteeringWheelAngle' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, RudderAngle) == 0x000774, "Member 'UBoat_PG117_Animation_C::RudderAngle' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, PropellerRotation) == 0x000778, "Member 'UBoat_PG117_Animation_C::PropellerRotation' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, RudderRot) == 0x00077C, "Member 'UBoat_PG117_Animation_C::RudderRot' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, SteeringWheelRot) == 0x000788, "Member 'UBoat_PG117_Animation_C::SteeringWheelRot' has a wrong offset!");
static_assert(offsetof(UBoat_PG117_Animation_C, PropellerRot) == 0x000794, "Member 'UBoat_PG117_Animation_C::PropellerRot' has a wrong offset!");

}

