#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BoatBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BoatBase.BoatBase_C.ExecuteUbergraph_BoatBase
// 0x00A8 (0x00A8 - 0x0000)
struct BoatBase_C_ExecuteUbergraph_BoatBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxRotationYawAngle_ReturnValue;       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRotationYawAngle_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAcceleration_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxAcceleration_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAcceleration_ReturnValue2;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBoosting_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue2;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         m__float_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetVehicleEngineImmersionDepth_ReturnValue; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue2;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue3;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BoatBase_C_ExecuteUbergraph_BoatBase) == 0x000008, "Wrong alignment on BoatBase_C_ExecuteUbergraph_BoatBase");
static_assert(sizeof(BoatBase_C_ExecuteUbergraph_BoatBase) == 0x0000A8, "Wrong size on BoatBase_C_ExecuteUbergraph_BoatBase");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, EntryPoint) == 0x000000, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetMaxRotationYawAngle_ReturnValue) == 0x000024, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetMaxRotationYawAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetRotationYawAngle_ReturnValue) == 0x000028, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetRotationYawAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetAcceleration_ReturnValue) == 0x00002C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000030, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_HasAuthority_ReturnValue2) == 0x000034, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetMaxAcceleration_ReturnValue) == 0x000038, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetMaxAcceleration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetAcceleration_ReturnValue2) == 0x00003C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetAcceleration_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_IsBoosting_ReturnValue) == 0x000040, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_IsBoosting_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_SafeDivide_FloatFloat_ReturnValue2) == 0x000044, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_SafeDivide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetVelocity_ReturnValue) == 0x000048, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_FMin_ReturnValue) == 0x00005C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000060, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_FMax_ReturnValue) == 0x000064, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetFloatValue_ReturnValue) == 0x000068, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, m__float_Variable) == 0x00006C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::m__float_Variable' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, m__bool_Variable) == 0x000070, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetVehicleEngineImmersionDepth_ReturnValue) == 0x000074, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetVehicleEngineImmersionDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, K2Node_Select_Default) == 0x000078, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetTimeSeconds_ReturnValue) == 0x00007C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetTimeSeconds_ReturnValue2) == 0x000080, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetTimeSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_GetTimeSeconds_ReturnValue3) == 0x000084, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_GetTimeSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00008C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000090, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000094, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000098, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x00009C, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BoatBase_C_ExecuteUbergraph_BoatBase, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x0000A0, "Member 'BoatBase_C_ExecuteUbergraph_BoatBase::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");

// Function BoatBase.BoatBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BoatBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BoatBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BoatBase_C_ReceiveTick");
static_assert(sizeof(BoatBase_C_ReceiveTick) == 0x000004, "Wrong size on BoatBase_C_ReceiveTick");
static_assert(offsetof(BoatBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BoatBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

