#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boat_PG117

#include "Basic.hpp"


namespace SDK::Params
{

// Function Boat_PG117.Boat_PG117_C.ExecuteUbergraph_Boat_PG117
// 0x0030 (0x0030 - 0x0000)
struct Boat_PG117_C_ExecuteUbergraph_Boat_PG117 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          K2Node_ComponentBoundEvent_Rider;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleSeatInteractionComponent*       K2Node_ComponentBoundEvent_Seat;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          K2Node_ComponentBoundEvent_Rider2;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleSeatInteractionComponent*       K2Node_ComponentBoundEvent_Seat2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117) == 0x000008, "Wrong alignment on Boat_PG117_C_ExecuteUbergraph_Boat_PG117");
static_assert(sizeof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117) == 0x000030, "Wrong size on Boat_PG117_C_ExecuteUbergraph_Boat_PG117");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, EntryPoint) == 0x000000, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::EntryPoint' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, K2Node_ComponentBoundEvent_Rider) == 0x000008, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::K2Node_ComponentBoundEvent_Rider' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, K2Node_ComponentBoundEvent_Seat) == 0x000010, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::K2Node_ComponentBoundEvent_Seat' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, K2Node_ComponentBoundEvent_Rider2) == 0x000018, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::K2Node_ComponentBoundEvent_Rider2' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, K2Node_ComponentBoundEvent_Seat2) == 0x000020, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::K2Node_ComponentBoundEvent_Seat2' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, CallFunc_IsLocallyControlled_ReturnValue) == 0x000028, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, CallFunc_IsLocallyControlled_ReturnValue2) == 0x00002A, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_ExecuteUbergraph_Boat_PG117, CallFunc_IsValid_ReturnValue2) == 0x00002B, "Member 'Boat_PG117_C_ExecuteUbergraph_Boat_PG117::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function Boat_PG117.Boat_PG117_C.BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature final
{
public:
	class ATslCharacter*                          Rider;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleSeatInteractionComponent*       Seat;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature) == 0x000008, "Wrong alignment on Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature");
static_assert(sizeof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature) == 0x000010, "Wrong size on Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature");
static_assert(offsetof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature, Rider) == 0x000000, "Member 'Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature::Rider' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature, Seat) == 0x000008, "Member 'Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature::Seat' has a wrong offset!");

// Function Boat_PG117.Boat_PG117_C.BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature final
{
public:
	class ATslCharacter*                          Rider;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVehicleSeatInteractionComponent*       Seat;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature) == 0x000008, "Wrong alignment on Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature");
static_assert(sizeof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature) == 0x000010, "Wrong size on Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature");
static_assert(offsetof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature, Rider) == 0x000000, "Member 'Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature::Rider' has a wrong offset!");
static_assert(offsetof(Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature, Seat) == 0x000008, "Member 'Boat_PG117_C_BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature::Seat' has a wrong offset!");

}

