#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boat_PG117

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BoatBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Boat_PG117.Boat_PG117_C
// 0x0060 (0x0578 - 0x0518)
class ABoat_PG117_C final : public ABoatBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Boat_PG117_C;                       // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere4;                                           // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UVehicleSeatInteractionComponent*       PassengerBCSeat;                                   // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Sphere3;                                           // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UVehicleSeatInteractionComponent*       PassengerBRSeat;                                   // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Sphere2;                                           // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UVehicleSeatInteractionComponent*       PassengerBLSeat;                                   // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Sphere1;                                           // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UVehicleSeatInteractionComponent*       PassengerFRSeat;                                   // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Sphere;                                            // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UVehicleSeatInteractionComponent*       DriverSeat;                                        // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_Boat_PG117(int32 EntryPoint);
	void BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_1_UTslVehicleSeatComponentOnLeave__DelegateSignature(class ATslCharacter* Rider, class UVehicleSeatInteractionComponent* Seat);
	void BndEvt__VehicleSeatComponent_K2Node_ComponentBoundEvent_0_UTslVehicleSeatComponentOnRide__DelegateSignature(class ATslCharacter* Rider, class UVehicleSeatInteractionComponent* Seat);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Boat_PG117_C">();
	}
	static class ABoat_PG117_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoat_PG117_C>();
	}
};
static_assert(alignof(ABoat_PG117_C) == 0x000008, "Wrong alignment on ABoat_PG117_C");
static_assert(sizeof(ABoat_PG117_C) == 0x000578, "Wrong size on ABoat_PG117_C");
static_assert(offsetof(ABoat_PG117_C, UberGraphFrame_Boat_PG117_C) == 0x000518, "Member 'ABoat_PG117_C::UberGraphFrame_Boat_PG117_C' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, Sphere4) == 0x000520, "Member 'ABoat_PG117_C::Sphere4' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, PassengerBCSeat) == 0x000528, "Member 'ABoat_PG117_C::PassengerBCSeat' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, Sphere3) == 0x000530, "Member 'ABoat_PG117_C::Sphere3' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, PassengerBRSeat) == 0x000538, "Member 'ABoat_PG117_C::PassengerBRSeat' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, Sphere2) == 0x000540, "Member 'ABoat_PG117_C::Sphere2' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, PassengerBLSeat) == 0x000548, "Member 'ABoat_PG117_C::PassengerBLSeat' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, Sphere1) == 0x000550, "Member 'ABoat_PG117_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, PassengerFRSeat) == 0x000558, "Member 'ABoat_PG117_C::PassengerFRSeat' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, Sphere) == 0x000560, "Member 'ABoat_PG117_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, DriverSeat) == 0x000568, "Member 'ABoat_PG117_C::DriverSeat' has a wrong offset!");
static_assert(offsetof(ABoat_PG117_C, StaticMesh) == 0x000570, "Member 'ABoat_PG117_C::StaticMesh' has a wrong offset!");

}

