#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Church

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Church.BP_Church_C
// 0x0280 (0x0620 - 0x03A0)
class ABP_Church_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight9;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UPointLightComponent*                   PointLight1;                                       // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight8;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight7;                                        // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight6;                                        // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight5;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight4;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight3;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight2;                                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight1;                                        // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpotLightComponent*                    SpotLight;                                         // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UBoxReflectionCaptureSAComponent*       BoxReflectionCaptureSA;                            // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot16;                                        // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot15;                                        // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot14;                                        // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot13;                                        // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot12;                                        // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot11;                                        // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot10;                                        // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot9;                                         // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot;                                          // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot7;                                         // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot6;                                         // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot5;                                         // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot4;                                         // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot3;                                         // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot2;                                         // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot1;                                         // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotComponent*                     ItemSpot8;                                         // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItemSpotGroupComponent*                ItemSpotGroup;                                     // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh56;                                      // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh55;                                      // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh54;                                      // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh53;                                      // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh52;                                      // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh51;                                      // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh50;                                      // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh49;                                      // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh48;                                      // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh47;                                      // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh46;                                      // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh45;                                      // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh44;                                      // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh43;                                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh41;                                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh40;                                      // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh38;                                      // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh37;                                      // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh36;                                      // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh33;                                      // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh32;                                      // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh31;                                      // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh30;                                      // 0x0540(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh29;                                      // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh28;                                      // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh27;                                      // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh25;                                      // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh24;                                      // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        SharedRoot;                                        // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Church_C">();
	}
	static class ABP_Church_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Church_C>();
	}
};
static_assert(alignof(ABP_Church_C) == 0x000008, "Wrong alignment on ABP_Church_C");
static_assert(sizeof(ABP_Church_C) == 0x000620, "Wrong size on ABP_Church_C");
static_assert(offsetof(ABP_Church_C, SpotLight9) == 0x0003A0, "Member 'ABP_Church_C::SpotLight9' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, PointLight1) == 0x0003A8, "Member 'ABP_Church_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight8) == 0x0003B0, "Member 'ABP_Church_C::SpotLight8' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight7) == 0x0003B8, "Member 'ABP_Church_C::SpotLight7' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight6) == 0x0003C0, "Member 'ABP_Church_C::SpotLight6' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight5) == 0x0003C8, "Member 'ABP_Church_C::SpotLight5' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight4) == 0x0003D0, "Member 'ABP_Church_C::SpotLight4' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight3) == 0x0003D8, "Member 'ABP_Church_C::SpotLight3' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight2) == 0x0003E0, "Member 'ABP_Church_C::SpotLight2' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight1) == 0x0003E8, "Member 'ABP_Church_C::SpotLight1' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SpotLight) == 0x0003F0, "Member 'ABP_Church_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, BoxReflectionCaptureSA) == 0x0003F8, "Member 'ABP_Church_C::BoxReflectionCaptureSA' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot16) == 0x000400, "Member 'ABP_Church_C::ItemSpot16' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot15) == 0x000408, "Member 'ABP_Church_C::ItemSpot15' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot14) == 0x000410, "Member 'ABP_Church_C::ItemSpot14' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot13) == 0x000418, "Member 'ABP_Church_C::ItemSpot13' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot12) == 0x000420, "Member 'ABP_Church_C::ItemSpot12' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot11) == 0x000428, "Member 'ABP_Church_C::ItemSpot11' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot10) == 0x000430, "Member 'ABP_Church_C::ItemSpot10' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot9) == 0x000438, "Member 'ABP_Church_C::ItemSpot9' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot) == 0x000440, "Member 'ABP_Church_C::ItemSpot' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot7) == 0x000448, "Member 'ABP_Church_C::ItemSpot7' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot6) == 0x000450, "Member 'ABP_Church_C::ItemSpot6' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot5) == 0x000458, "Member 'ABP_Church_C::ItemSpot5' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot4) == 0x000460, "Member 'ABP_Church_C::ItemSpot4' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot3) == 0x000468, "Member 'ABP_Church_C::ItemSpot3' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot2) == 0x000470, "Member 'ABP_Church_C::ItemSpot2' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot1) == 0x000478, "Member 'ABP_Church_C::ItemSpot1' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpot8) == 0x000480, "Member 'ABP_Church_C::ItemSpot8' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, ItemSpotGroup) == 0x000488, "Member 'ABP_Church_C::ItemSpotGroup' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh56) == 0x000490, "Member 'ABP_Church_C::StaticMesh56' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh55) == 0x000498, "Member 'ABP_Church_C::StaticMesh55' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh54) == 0x0004A0, "Member 'ABP_Church_C::StaticMesh54' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh53) == 0x0004A8, "Member 'ABP_Church_C::StaticMesh53' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh52) == 0x0004B0, "Member 'ABP_Church_C::StaticMesh52' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh51) == 0x0004B8, "Member 'ABP_Church_C::StaticMesh51' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh50) == 0x0004C0, "Member 'ABP_Church_C::StaticMesh50' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh49) == 0x0004C8, "Member 'ABP_Church_C::StaticMesh49' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh48) == 0x0004D0, "Member 'ABP_Church_C::StaticMesh48' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh47) == 0x0004D8, "Member 'ABP_Church_C::StaticMesh47' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh46) == 0x0004E0, "Member 'ABP_Church_C::StaticMesh46' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh45) == 0x0004E8, "Member 'ABP_Church_C::StaticMesh45' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh44) == 0x0004F0, "Member 'ABP_Church_C::StaticMesh44' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh43) == 0x0004F8, "Member 'ABP_Church_C::StaticMesh43' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh41) == 0x000500, "Member 'ABP_Church_C::StaticMesh41' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh40) == 0x000508, "Member 'ABP_Church_C::StaticMesh40' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh38) == 0x000510, "Member 'ABP_Church_C::StaticMesh38' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh37) == 0x000518, "Member 'ABP_Church_C::StaticMesh37' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh36) == 0x000520, "Member 'ABP_Church_C::StaticMesh36' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh33) == 0x000528, "Member 'ABP_Church_C::StaticMesh33' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh32) == 0x000530, "Member 'ABP_Church_C::StaticMesh32' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh31) == 0x000538, "Member 'ABP_Church_C::StaticMesh31' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh30) == 0x000540, "Member 'ABP_Church_C::StaticMesh30' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh29) == 0x000548, "Member 'ABP_Church_C::StaticMesh29' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh28) == 0x000550, "Member 'ABP_Church_C::StaticMesh28' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh27) == 0x000558, "Member 'ABP_Church_C::StaticMesh27' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh25) == 0x000560, "Member 'ABP_Church_C::StaticMesh25' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh24) == 0x000568, "Member 'ABP_Church_C::StaticMesh24' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh21) == 0x000570, "Member 'ABP_Church_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh20) == 0x000578, "Member 'ABP_Church_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh19) == 0x000580, "Member 'ABP_Church_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh17) == 0x000588, "Member 'ABP_Church_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh16) == 0x000590, "Member 'ABP_Church_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh15) == 0x000598, "Member 'ABP_Church_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh14) == 0x0005A0, "Member 'ABP_Church_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh13) == 0x0005A8, "Member 'ABP_Church_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh12) == 0x0005B0, "Member 'ABP_Church_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh11) == 0x0005B8, "Member 'ABP_Church_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh10) == 0x0005C0, "Member 'ABP_Church_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh9) == 0x0005C8, "Member 'ABP_Church_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh8) == 0x0005D0, "Member 'ABP_Church_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh7) == 0x0005D8, "Member 'ABP_Church_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh6) == 0x0005E0, "Member 'ABP_Church_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh5) == 0x0005E8, "Member 'ABP_Church_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh4) == 0x0005F0, "Member 'ABP_Church_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh3) == 0x0005F8, "Member 'ABP_Church_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh2) == 0x000600, "Member 'ABP_Church_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh1) == 0x000608, "Member 'ABP_Church_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, StaticMesh) == 0x000610, "Member 'ABP_Church_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Church_C, SharedRoot) == 0x000618, "Member 'ABP_Church_C::SharedRoot' has a wrong offset!");

}

