#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FppWeaponListSlotWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FppWeaponListSlotWidget.BP_FppWeaponListSlotWidget_C
// 0x0048 (0x05B0 - 0x0568)
class UBP_FppWeaponListSlotWidget_C final : public UWeaponSlotBaseWidget
{
public:
	class UImage*                                 weaponImage;                                       // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	UMulticastDelegateProperty_                   ShowStart;                                         // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ShowEnd;                                           // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HIddenStart;                                       // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HIddenEnd;                                         // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FppWeaponListSlotWidget_C">();
	}
	static class UBP_FppWeaponListSlotWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FppWeaponListSlotWidget_C>();
	}
};
static_assert(alignof(UBP_FppWeaponListSlotWidget_C) == 0x000008, "Wrong alignment on UBP_FppWeaponListSlotWidget_C");
static_assert(sizeof(UBP_FppWeaponListSlotWidget_C) == 0x0005B0, "Wrong size on UBP_FppWeaponListSlotWidget_C");
static_assert(offsetof(UBP_FppWeaponListSlotWidget_C, weaponImage) == 0x000568, "Member 'UBP_FppWeaponListSlotWidget_C::weaponImage' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponListSlotWidget_C, ShowStart) == 0x000570, "Member 'UBP_FppWeaponListSlotWidget_C::ShowStart' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponListSlotWidget_C, ShowEnd) == 0x000580, "Member 'UBP_FppWeaponListSlotWidget_C::ShowEnd' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponListSlotWidget_C, HIddenStart) == 0x000590, "Member 'UBP_FppWeaponListSlotWidget_C::HIddenStart' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponListSlotWidget_C, HIddenEnd) == 0x0005A0, "Member 'UBP_FppWeaponListSlotWidget_C::HIddenEnd' has a wrong offset!");

}

