#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FppWeaponSlotWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FppWeaponSlotWidget.BP_FppWeaponSlotWidget_C
// 0x0090 (0x05F8 - 0x0568)
class UBP_FppWeaponSlotWidget_C final : public UWeaponSlotBaseWidget
{
public:
	class UWidgetAnimation*                       ZeroDistIncreasing;                                // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ZeroDistDecreasing;                                // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       UnloadedAmmoIncreasing;                            // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       UnloadedAmmoDecreasing;                            // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       AmmoIncreasing;                                    // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       AmmoDecreasing;                                    // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ScaleDown;                                         // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ScaleUp;                                           // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Hidden;                                            // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       show;                                              // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	UMulticastDelegateProperty_                   ShowStart;                                         // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   ShowEnd;                                           // 0x05C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HIddenStart;                                       // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   HIddenEnd;                                         // 0x05E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FppWeaponSlotWidget_C">();
	}
	static class UBP_FppWeaponSlotWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FppWeaponSlotWidget_C>();
	}
};
static_assert(alignof(UBP_FppWeaponSlotWidget_C) == 0x000008, "Wrong alignment on UBP_FppWeaponSlotWidget_C");
static_assert(sizeof(UBP_FppWeaponSlotWidget_C) == 0x0005F8, "Wrong size on UBP_FppWeaponSlotWidget_C");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ZeroDistIncreasing) == 0x000568, "Member 'UBP_FppWeaponSlotWidget_C::ZeroDistIncreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ZeroDistDecreasing) == 0x000570, "Member 'UBP_FppWeaponSlotWidget_C::ZeroDistDecreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, UnloadedAmmoIncreasing) == 0x000578, "Member 'UBP_FppWeaponSlotWidget_C::UnloadedAmmoIncreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, UnloadedAmmoDecreasing) == 0x000580, "Member 'UBP_FppWeaponSlotWidget_C::UnloadedAmmoDecreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, AmmoIncreasing) == 0x000588, "Member 'UBP_FppWeaponSlotWidget_C::AmmoIncreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, AmmoDecreasing) == 0x000590, "Member 'UBP_FppWeaponSlotWidget_C::AmmoDecreasing' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ScaleDown) == 0x000598, "Member 'UBP_FppWeaponSlotWidget_C::ScaleDown' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ScaleUp) == 0x0005A0, "Member 'UBP_FppWeaponSlotWidget_C::ScaleUp' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, Hidden) == 0x0005A8, "Member 'UBP_FppWeaponSlotWidget_C::Hidden' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, show) == 0x0005B0, "Member 'UBP_FppWeaponSlotWidget_C::show' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ShowStart) == 0x0005B8, "Member 'UBP_FppWeaponSlotWidget_C::ShowStart' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, ShowEnd) == 0x0005C8, "Member 'UBP_FppWeaponSlotWidget_C::ShowEnd' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, HIddenStart) == 0x0005D8, "Member 'UBP_FppWeaponSlotWidget_C::HIddenStart' has a wrong offset!");
static_assert(offsetof(UBP_FppWeaponSlotWidget_C, HIddenEnd) == 0x0005E8, "Member 'UBP_FppWeaponSlotWidget_C::HIddenEnd' has a wrong offset!");

}

