#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_InteractionWidget.BP_InteractionWidget_C
// 0x0038 (0x0468 - 0x0430)
class UBP_InteractionWidget_C final : public UInteractionBaseWidget
{
public:
	class UWidgetAnimation*                       AdditionalMessageVanishing;                        // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       AdditionalMessageEmerging;                         // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       AdditionalMessageNormal;                           // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       AdditionalMessageBlinking;                         // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Vanishing;                                         // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       show;                                              // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Default;                                           // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractionWidget_C">();
	}
	static class UBP_InteractionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InteractionWidget_C>();
	}
};
static_assert(alignof(UBP_InteractionWidget_C) == 0x000008, "Wrong alignment on UBP_InteractionWidget_C");
static_assert(sizeof(UBP_InteractionWidget_C) == 0x000468, "Wrong size on UBP_InteractionWidget_C");
static_assert(offsetof(UBP_InteractionWidget_C, AdditionalMessageVanishing) == 0x000430, "Member 'UBP_InteractionWidget_C::AdditionalMessageVanishing' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, AdditionalMessageEmerging) == 0x000438, "Member 'UBP_InteractionWidget_C::AdditionalMessageEmerging' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, AdditionalMessageNormal) == 0x000440, "Member 'UBP_InteractionWidget_C::AdditionalMessageNormal' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, AdditionalMessageBlinking) == 0x000448, "Member 'UBP_InteractionWidget_C::AdditionalMessageBlinking' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, Vanishing) == 0x000450, "Member 'UBP_InteractionWidget_C::Vanishing' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, show) == 0x000458, "Member 'UBP_InteractionWidget_C::show' has a wrong offset!");
static_assert(offsetof(UBP_InteractionWidget_C, Default) == 0x000460, "Member 'UBP_InteractionWidget_C::Default' has a wrong offset!");

}

