#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapMarkerWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MapMarkerWidget.BP_MapMarkerWidget_C
// 0x0018 (0x02F0 - 0x02D8)
class UBP_MapMarkerWidget_C final : public UMapMarkerBaseWidget
{
public:
	class UWidgetAnimation*                       MyMarkerEmerging;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMaterialInstanceDynamic*               MarkerMaterial;                                    // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Number;                                            // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bShow;                                             // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapMarkerWidget_C">();
	}
	static class UBP_MapMarkerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MapMarkerWidget_C>();
	}
};
static_assert(alignof(UBP_MapMarkerWidget_C) == 0x000008, "Wrong alignment on UBP_MapMarkerWidget_C");
static_assert(sizeof(UBP_MapMarkerWidget_C) == 0x0002F0, "Wrong size on UBP_MapMarkerWidget_C");
static_assert(offsetof(UBP_MapMarkerWidget_C, MyMarkerEmerging) == 0x0002D8, "Member 'UBP_MapMarkerWidget_C::MyMarkerEmerging' has a wrong offset!");
static_assert(offsetof(UBP_MapMarkerWidget_C, MarkerMaterial) == 0x0002E0, "Member 'UBP_MapMarkerWidget_C::MarkerMaterial' has a wrong offset!");
static_assert(offsetof(UBP_MapMarkerWidget_C, Number) == 0x0002E8, "Member 'UBP_MapMarkerWidget_C::Number' has a wrong offset!");
static_assert(offsetof(UBP_MapMarkerWidget_C, bShow) == 0x0002EC, "Member 'UBP_MapMarkerWidget_C::bShow' has a wrong offset!");

}

