#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Motorbike_04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Motorbike_04.BP_Motorbike_04_C
// 0x00F0 (0x0958 - 0x0868)
class ABP_Motorbike_04_C final : public ATslMotorbikeVehicle_Standalone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere1;                                           // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UMotorbikeVehicleSeatInteraction*       PassengerSeat;                                     // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USphereComponent*                       Sphere;                                            // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UMotorbikeVehicleSeatInteraction*       DriverSeat;                                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class URadialForceComponent*                  RadialForce;                                       // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCameraComponent*                       FirstPersonCameraInVehicle;                        // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpringArmInVehicleComponent*           FirstPersonSpringArmInVehicle;                     // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UArrowComponent*                        Arrow;                                             // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UCameraComponent*                       ThirdPersonCameraInVehicle;                        // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USpringArmInVehicleComponent*           ThirdPersonSpringArmInVehicle;                     // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         COM_Offset_Steer;                                  // 0x08C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         COM_Offset_Yaw;                                    // 0x08C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         COM_Offset_Roll;                                   // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         COM_Boost;                                         // 0x08CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            RollCurve;                                         // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            ReturnClampCurve;                                  // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            SteerCurve;                                        // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            YawCurve;                                          // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            TorqueStabilizeCurve;                              // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasContact;                                       // 0x08F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GameTime;                                          // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_CameraMan_C*                        CameraManRef;                                      // 0x0900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AIrControl_F;                                      // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         AIrControl_R;                                      // 0x090C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasSideCart;                                      // 0x0910(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_911[0x7];                                      // 0x0911(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            RollCurve_Cart;                                    // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            ReturnClampCurve_Cart;                             // 0x0920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            SteerCurve_Cart;                                   // 0x0928(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            YawCurve_Cart;                                     // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            TorqueStabilizeCurve_Cart;                         // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            EngineAudioCurve;                                  // 0x0940(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UTslWheeledVehicleMovement*             TslMovementRef;                                    // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         FuelEfficiency;                                    // 0x0950(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Motorbike_04(int32 EntryPoint);
	void OnDeath_Event_0(float KillingDamage, const struct FDamageEvent& DamageEvent, class ATslPlayerState* PlayerInstigator, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void InpAxisEvt_AirControlRoll_K2Node_InputAxisEvent_13(float AxisValue);
	void InpAxisEvt_AirControlPitch_K2Node_InputAxisEvent_7(float AxisValue);
	void InpActEvt_Decimal_K2Node_InputKeyEvent_16(const struct FKey& Key);
	void InpActEvt_NumPadFive_K2Node_InputKeyEvent_17(const struct FKey& Key);
	void InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18(const struct FKey& Key);
	void InpActEvt_NumPadEight_K2Node_InputKeyEvent_19(const struct FKey& Key);
	void InpActEvt_NumPadNine_K2Node_InputKeyEvent_20(const struct FKey& Key);
	void InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21(const struct FKey& Key);
	void InpActEvt_NumPadThree_K2Node_InputKeyEvent_22(const struct FKey& Key);
	void InpActEvt_Subtract_K2Node_InputKeyEvent_23(const struct FKey& Key);
	void InpActEvt_Add_K2Node_InputKeyEvent_24(const struct FKey& Key);
	void InpActEvt_NumPadOne_K2Node_InputKeyEvent_25(const struct FKey& Key);
	void InpActEvt_NumPadFour_K2Node_InputKeyEvent_26(const struct FKey& Key);
	void InpActEvt_NumPadFour_K2Node_InputKeyEvent_27(const struct FKey& Key);
	void InpActEvt_NumPadSix_K2Node_InputKeyEvent_28(const struct FKey& Key);
	void InpActEvt_NumPadSix_K2Node_InputKeyEvent_29(const struct FKey& Key);
	void InpActEvt_Multiply_K2Node_InputKeyEvent_30(const struct FKey& Key);
	void InpActEvt_NumPadZero_K2Node_InputKeyEvent_31(const struct FKey& Key);
	void UserConstructionScript();
	void Process_Stabilize();
	void Process_Contact();
	void Process_Eject();
	void Process_AirControl();
	void Process_Camera();
	void StablizeMotorbike();
	void StabilizeMotorbikeSidecart();
	void Process_Boost();
	void Process_Audio();
	void Process_FuelConsumption();
	void Init_Cache();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Motorbike_04_C">();
	}
	static class ABP_Motorbike_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Motorbike_04_C>();
	}
};
static_assert(alignof(ABP_Motorbike_04_C) == 0x000008, "Wrong alignment on ABP_Motorbike_04_C");
static_assert(sizeof(ABP_Motorbike_04_C) == 0x000958, "Wrong size on ABP_Motorbike_04_C");
static_assert(offsetof(ABP_Motorbike_04_C, UberGraphFrame) == 0x000868, "Member 'ABP_Motorbike_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, Sphere1) == 0x000870, "Member 'ABP_Motorbike_04_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, PassengerSeat) == 0x000878, "Member 'ABP_Motorbike_04_C::PassengerSeat' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, Sphere) == 0x000880, "Member 'ABP_Motorbike_04_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, DriverSeat) == 0x000888, "Member 'ABP_Motorbike_04_C::DriverSeat' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, RadialForce) == 0x000890, "Member 'ABP_Motorbike_04_C::RadialForce' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, FirstPersonCameraInVehicle) == 0x000898, "Member 'ABP_Motorbike_04_C::FirstPersonCameraInVehicle' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, FirstPersonSpringArmInVehicle) == 0x0008A0, "Member 'ABP_Motorbike_04_C::FirstPersonSpringArmInVehicle' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, Arrow) == 0x0008A8, "Member 'ABP_Motorbike_04_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, ThirdPersonCameraInVehicle) == 0x0008B0, "Member 'ABP_Motorbike_04_C::ThirdPersonCameraInVehicle' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, ThirdPersonSpringArmInVehicle) == 0x0008B8, "Member 'ABP_Motorbike_04_C::ThirdPersonSpringArmInVehicle' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, COM_Offset_Steer) == 0x0008C0, "Member 'ABP_Motorbike_04_C::COM_Offset_Steer' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, COM_Offset_Yaw) == 0x0008C4, "Member 'ABP_Motorbike_04_C::COM_Offset_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, COM_Offset_Roll) == 0x0008C8, "Member 'ABP_Motorbike_04_C::COM_Offset_Roll' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, COM_Boost) == 0x0008CC, "Member 'ABP_Motorbike_04_C::COM_Boost' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, RollCurve) == 0x0008D0, "Member 'ABP_Motorbike_04_C::RollCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, ReturnClampCurve) == 0x0008D8, "Member 'ABP_Motorbike_04_C::ReturnClampCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, SteerCurve) == 0x0008E0, "Member 'ABP_Motorbike_04_C::SteerCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, YawCurve) == 0x0008E8, "Member 'ABP_Motorbike_04_C::YawCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, TorqueStabilizeCurve) == 0x0008F0, "Member 'ABP_Motorbike_04_C::TorqueStabilizeCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, bHasContact) == 0x0008F8, "Member 'ABP_Motorbike_04_C::bHasContact' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, GameTime) == 0x0008FC, "Member 'ABP_Motorbike_04_C::GameTime' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, CameraManRef) == 0x000900, "Member 'ABP_Motorbike_04_C::CameraManRef' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, AIrControl_F) == 0x000908, "Member 'ABP_Motorbike_04_C::AIrControl_F' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, AIrControl_R) == 0x00090C, "Member 'ABP_Motorbike_04_C::AIrControl_R' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, bHasSideCart) == 0x000910, "Member 'ABP_Motorbike_04_C::bHasSideCart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, RollCurve_Cart) == 0x000918, "Member 'ABP_Motorbike_04_C::RollCurve_Cart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, ReturnClampCurve_Cart) == 0x000920, "Member 'ABP_Motorbike_04_C::ReturnClampCurve_Cart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, SteerCurve_Cart) == 0x000928, "Member 'ABP_Motorbike_04_C::SteerCurve_Cart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, YawCurve_Cart) == 0x000930, "Member 'ABP_Motorbike_04_C::YawCurve_Cart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, TorqueStabilizeCurve_Cart) == 0x000938, "Member 'ABP_Motorbike_04_C::TorqueStabilizeCurve_Cart' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, EngineAudioCurve) == 0x000940, "Member 'ABP_Motorbike_04_C::EngineAudioCurve' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, TslMovementRef) == 0x000948, "Member 'ABP_Motorbike_04_C::TslMovementRef' has a wrong offset!");
static_assert(offsetof(ABP_Motorbike_04_C, FuelEfficiency) == 0x000950, "Member 'ABP_Motorbike_04_C::FuelEfficiency' has a wrong offset!");

}

