#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapCharacterIconWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_MapCharacterIconWidget.BP_MapCharacterIconWidget_C
// 0x0030 (0x0428 - 0x03F8)
class UBP_MapCharacterIconWidget_C final : public UMapCharacterIconBaseWidget
{
public:
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       GroggyWarning;                                     // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Hitted;                                            // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Attacked;                                          // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBP_LifeGaugeTemplateWidget_C*          LifeGauge;                                         // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapCharacterIconWidget_C">();
	}
	static class UBP_MapCharacterIconWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MapCharacterIconWidget_C>();
	}
};
static_assert(alignof(UBP_MapCharacterIconWidget_C) == 0x000008, "Wrong alignment on UBP_MapCharacterIconWidget_C");
static_assert(sizeof(UBP_MapCharacterIconWidget_C) == 0x000428, "Wrong size on UBP_MapCharacterIconWidget_C");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, NewAnimation_1) == 0x0003F8, "Member 'UBP_MapCharacterIconWidget_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, FadeOut) == 0x000400, "Member 'UBP_MapCharacterIconWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, GroggyWarning) == 0x000408, "Member 'UBP_MapCharacterIconWidget_C::GroggyWarning' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, Hitted) == 0x000410, "Member 'UBP_MapCharacterIconWidget_C::Hitted' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, Attacked) == 0x000418, "Member 'UBP_MapCharacterIconWidget_C::Attacked' has a wrong offset!");
static_assert(offsetof(UBP_MapCharacterIconWidget_C, LifeGauge) == 0x000420, "Member 'UBP_MapCharacterIconWidget_C::LifeGauge' has a wrong offset!");

}

