#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Motorbike_03

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Motorbike_03.BP_Motorbike_03_C.ExecuteUbergraph_BP_Motorbike_03
// 0x0530 (0x0530 - 0x0000)
struct BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key16;                        // 0x0008(0x0018)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   m__struct_Variable;                                // 0x00E8(0x0018)()
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0100(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0128(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult;    // 0x0148(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FKey                                   K2Node_InputActionEvent_Key2;                      // 0x01D0(0x0018)()
	struct FKey                                   m__struct_Variable2;                               // 0x01E8(0x0018)()
	struct FKey                                   K2Node_InputActionEvent_Key3;                      // 0x0200(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputActionEvent_Key4;                      // 0x0220(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0238(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0250(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x0268(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x0280(0x0018)()
	bool                                          CallFunc_IsShipping_ReturnValue;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue2;                  // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x029B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue3;                  // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue4;                  // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x029E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x029F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue5;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue6;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x02A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue7;                  // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue8;                  // 0x02A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x02A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue8;                 // 0x02A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue9;                  // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue10;                 // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue9;                 // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue10;                // 0x02AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue11;                 // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShipping_ReturnValue12;                 // 0x02AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue11;                // 0x02AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue12;                // 0x02AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x02B0(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key6;                         // 0x02C8(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key7;                         // 0x02E0(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02F8(0x0008)()
	struct FKey                                   K2Node_InputKeyEvent_Key8;                         // 0x0300(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key9;                         // 0x0318(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key10;                        // 0x0330(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeLocation_SweepHitResult2;   // 0x0350(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FKey                                   m__struct_Variable3;                               // 0x03D8(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key11;                        // 0x03F0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key12;                        // 0x0410(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   m__struct_Variable4;                               // 0x0438(0x0018)()
	struct FKey                                   K2Node_InputKeyEvent_Key13;                        // 0x0450(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue6;              // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue4;                      // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key14;                        // 0x04A0(0x0018)()
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x04D0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FKey                                   K2Node_InputKeyEvent_Key15;                        // 0x0508(0x0018)()
	class ABP_CameraMan_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03) == 0x000010, "Wrong alignment on BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03");
static_assert(sizeof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03) == 0x000530, "Wrong size on BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, EntryPoint) == 0x000000, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key16) == 0x000008, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key16' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000034, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000044, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000050, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000DC, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_FClamp_ReturnValue) == 0x0000E0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_FClamp_ReturnValue2) == 0x0000E4, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, m__struct_Variable) == 0x0000E8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Conv_FloatToString_ReturnValue) == 0x000100, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue2) == 0x000120, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue3) == 0x000121, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputActionEvent_Key) == 0x000128, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue4) == 0x000140, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue5) == 0x000141, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_AddRelativeLocation_SweepHitResult) == 0x000148, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_AddRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputActionEvent_Key2) == 0x0001D0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputActionEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, m__struct_Variable2) == 0x0001E8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::m__struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputActionEvent_Key3) == 0x000200, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputActionEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue6) == 0x000218, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue3) == 0x00021C, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputActionEvent_Key4) == 0x000220, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputActionEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key) == 0x000238, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key2) == 0x000250, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key3) == 0x000268, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key4) == 0x000280, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue) == 0x000298, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue2) == 0x000299, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue) == 0x00029A, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue2) == 0x00029B, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue3) == 0x00029C, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue4) == 0x00029D, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue3) == 0x00029E, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue4) == 0x00029F, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue5) == 0x0002A0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue6) == 0x0002A1, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue5) == 0x0002A2, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue6) == 0x0002A3, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue7) == 0x0002A4, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue8) == 0x0002A5, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue7) == 0x0002A6, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue8) == 0x0002A7, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue9) == 0x0002A8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue10) == 0x0002A9, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue9) == 0x0002AA, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue10) == 0x0002AB, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue11) == 0x0002AC, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsShipping_ReturnValue12) == 0x0002AD, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsShipping_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue11) == 0x0002AE, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Not_PreBool_ReturnValue12) == 0x0002AF, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Not_PreBool_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key5) == 0x0002B0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key5' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key6) == 0x0002C8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key6' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key7) == 0x0002E0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key7' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_SetTimer_ReturnValue) == 0x0002F8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key8) == 0x000300, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key8' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key9) == 0x000318, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key9' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key10) == 0x000330, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key10' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue7) == 0x000348, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_AddRelativeLocation_SweepHitResult2) == 0x000350, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_AddRelativeLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, m__struct_Variable3) == 0x0003D8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::m__struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key11) == 0x0003F0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key11' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue8) == 0x000408, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue4) == 0x00040C, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key12) == 0x000410, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key12' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue9) == 0x000428, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue5) == 0x00042C, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_FClamp_ReturnValue3) == 0x000430, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, m__struct_Variable4) == 0x000438, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::m__struct_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key13) == 0x000450, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key13' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue10) == 0x000468, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_FloatFloat_ReturnValue6) == 0x00046C, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_FClamp_ReturnValue4) == 0x000470, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_FClamp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000474, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_Add_VectorVector_ReturnValue) == 0x000480, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_GetPlayerController_ReturnValue) == 0x000490, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_GetPlayerController_ReturnValue2) == 0x000498, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key14) == 0x0004A0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key14' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0004B8, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_IsValid_ReturnValue11) == 0x0004C0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_IsValid_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_GetCameraRotation_ReturnValue) == 0x0004C4, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_MakeTransform_ReturnValue) == 0x0004D0, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000500, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, K2Node_InputKeyEvent_Key15) == 0x000508, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::K2Node_InputKeyEvent_Key15' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03, CallFunc_FinishSpawningActor_ReturnValue) == 0x000520, "Member 'BP_Motorbike_03_C_ExecuteUbergraph_BP_Motorbike_03::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Motorbike_03_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Motorbike_03_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Motorbike_03_C_ReceiveTick");
static_assert(sizeof(BP_Motorbike_03_C_ReceiveTick) == 0x000004, "Wrong size on BP_Motorbike_03_C_ReceiveTick");
static_assert(offsetof(BP_Motorbike_03_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Motorbike_03_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_PeekRight_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_PeekRight_K2Node_InputActionEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_PeekRight_K2Node_InputActionEvent_5::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_PeekLeft_K2Node_InputActionEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_6::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_PeekLeft_K2Node_InputActionEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_PeekLeft_K2Node_InputActionEvent_7::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_Decimal_K2Node_InputKeyEvent_16
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_Decimal_K2Node_InputKeyEvent_16::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadFive_K2Node_InputKeyEvent_17
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadFive_K2Node_InputKeyEvent_17::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadTwo_K2Node_InputKeyEvent_18::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadEight_K2Node_InputKeyEvent_19
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadEight_K2Node_InputKeyEvent_19::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadNine_K2Node_InputKeyEvent_20
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadNine_K2Node_InputKeyEvent_20::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadSeven_K2Node_InputKeyEvent_21::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadThree_K2Node_InputKeyEvent_22
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadThree_K2Node_InputKeyEvent_22::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_Subtract_K2Node_InputKeyEvent_23
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_Subtract_K2Node_InputKeyEvent_23::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_Add_K2Node_InputKeyEvent_24
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_Add_K2Node_InputKeyEvent_24::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadOne_K2Node_InputKeyEvent_25
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadOne_K2Node_InputKeyEvent_25::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadFour_K2Node_InputKeyEvent_26
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_26::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadFour_K2Node_InputKeyEvent_27
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadFour_K2Node_InputKeyEvent_27::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadSix_K2Node_InputKeyEvent_28
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_28::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadSix_K2Node_InputKeyEvent_29
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadSix_K2Node_InputKeyEvent_29::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_Multiply_K2Node_InputKeyEvent_30
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_Multiply_K2Node_InputKeyEvent_30::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.InpActEvt_NumPadZero_K2Node_InputKeyEvent_31
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm)
};
static_assert(alignof(BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31");
static_assert(sizeof(BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31) == 0x000018, "Wrong size on BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31");
static_assert(offsetof(BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31, Key) == 0x000000, "Member 'BP_Motorbike_03_C_InpActEvt_NumPadZero_K2Node_InputKeyEvent_31::Key' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.Process_Stabilize
// 0x0018 (0x0018 - 0x0000)
struct BP_Motorbike_03_C_Process_Stabilize final
{
public:
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetDriver_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Motorbike_03_C_Process_Stabilize) == 0x000008, "Wrong alignment on BP_Motorbike_03_C_Process_Stabilize");
static_assert(sizeof(BP_Motorbike_03_C_Process_Stabilize) == 0x000018, "Wrong size on BP_Motorbike_03_C_Process_Stabilize");
static_assert(offsetof(BP_Motorbike_03_C_Process_Stabilize, CallFunc_HasAuthority_ReturnValue) == 0x000000, "Member 'BP_Motorbike_03_C_Process_Stabilize::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_Process_Stabilize, CallFunc_GetDriver_ReturnValue) == 0x000008, "Member 'BP_Motorbike_03_C_Process_Stabilize::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Motorbike_03_C_Process_Stabilize, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Motorbike_03_C_Process_Stabilize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Motorbike_03.BP_Motorbike_03_C.Process_Contact
// 0x0030 (0x0030 - 0x0000)
struct BP_Motorbike_03_C_Process_Contact final
{
public:
	bool                                          m__bool_True_if_break_was_hit_Variable;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVehicleWheel*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
