#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSlotHudWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_WeaponSlotHudWidget.BP_WeaponSlotHudWidget_C
// 0x0040 (0x04B0 - 0x0470)
class UBP_WeaponSlotHudWidget_C final : public UWeaponSlotHudBaseWidget
{
public:
	class UWidgetAnimation*                       NewFadeInSlotList;                                 // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       NewFadeOutSlotList;                                // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOutUnarmedWeaponSlot;                          // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeInUnarmedWeaponSlot;                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOutWeaponSlot;                                 // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeInWeaponSlot;                                  // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOutSlotList;                                   // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeInSlotList;                                    // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponSlotHudWidget_C">();
	}
	static class UBP_WeaponSlotHudWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_WeaponSlotHudWidget_C>();
	}
};
static_assert(alignof(UBP_WeaponSlotHudWidget_C) == 0x000008, "Wrong alignment on UBP_WeaponSlotHudWidget_C");
static_assert(sizeof(UBP_WeaponSlotHudWidget_C) == 0x0004B0, "Wrong size on UBP_WeaponSlotHudWidget_C");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, NewFadeInSlotList) == 0x000470, "Member 'UBP_WeaponSlotHudWidget_C::NewFadeInSlotList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, NewFadeOutSlotList) == 0x000478, "Member 'UBP_WeaponSlotHudWidget_C::NewFadeOutSlotList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeOutUnarmedWeaponSlot) == 0x000480, "Member 'UBP_WeaponSlotHudWidget_C::FadeOutUnarmedWeaponSlot' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeInUnarmedWeaponSlot) == 0x000488, "Member 'UBP_WeaponSlotHudWidget_C::FadeInUnarmedWeaponSlot' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeOutWeaponSlot) == 0x000490, "Member 'UBP_WeaponSlotHudWidget_C::FadeOutWeaponSlot' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeInWeaponSlot) == 0x000498, "Member 'UBP_WeaponSlotHudWidget_C::FadeInWeaponSlot' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeOutSlotList) == 0x0004A0, "Member 'UBP_WeaponSlotHudWidget_C::FadeOutSlotList' has a wrong offset!");
static_assert(offsetof(UBP_WeaponSlotHudWidget_C, FadeInSlotList) == 0x0004A8, "Member 'UBP_WeaponSlotHudWidget_C::FadeInSlotList' has a wrong offset!");

}

