#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Buff_BreakSunkenVehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Buff_BreakSunkenVehicle.Buff_BreakSunkenVehicle_C.ExecuteUbergraph_Buff_BreakSunkenVehicle
// 0x0038 (0x0038 - 0x0000)
struct Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bCanceled;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslVehicleCommonComponent*             CallFunc_GetVehicleCommonComponent_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetOwnerPawn_ReturnValue2;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslVehicleCommonComponent*             CallFunc_GetVehicleCommonComponent_ReturnValue2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBroken_ReturnValue;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBroken_ReturnValue2;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle) == 0x000008, "Wrong alignment on Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle");
static_assert(sizeof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle) == 0x000038, "Wrong size on Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, EntryPoint) == 0x000000, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_GetOwnerPawn_ReturnValue) == 0x000008, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_GetOwnerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, K2Node_Event_bCanceled) == 0x000010, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::K2Node_Event_bCanceled' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_GetVehicleCommonComponent_ReturnValue) == 0x000018, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_GetVehicleCommonComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_GetOwnerPawn_ReturnValue2) == 0x000020, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_GetOwnerPawn_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_GetVehicleCommonComponent_ReturnValue2) == 0x000028, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_GetVehicleCommonComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_IsBroken_ReturnValue) == 0x000032, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_IsBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle, CallFunc_IsBroken_ReturnValue2) == 0x000033, "Member 'Buff_BreakSunkenVehicle_C_ExecuteUbergraph_Buff_BreakSunkenVehicle::CallFunc_IsBroken_ReturnValue2' has a wrong offset!");

// Function Buff_BreakSunkenVehicle.Buff_BreakSunkenVehicle_C.StopBuffBlueprint
// 0x0001 (0x0001 - 0x0000)
struct Buff_BreakSunkenVehicle_C_StopBuffBlueprint final
{
public:
	bool                                          bCanceled;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Buff_BreakSunkenVehicle_C_StopBuffBlueprint) == 0x000001, "Wrong alignment on Buff_BreakSunkenVehicle_C_StopBuffBlueprint");
static_assert(sizeof(Buff_BreakSunkenVehicle_C_StopBuffBlueprint) == 0x000001, "Wrong size on Buff_BreakSunkenVehicle_C_StopBuffBlueprint");
static_assert(offsetof(Buff_BreakSunkenVehicle_C_StopBuffBlueprint, bCanceled) == 0x000000, "Member 'Buff_BreakSunkenVehicle_C_StopBuffBlueprint::bCanceled' has a wrong offset!");

}

