#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ButtonWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ButtonWidget.ButtonWidget_C.ExecuteUbergraph_ButtonWidget
// 0x0070 (0x0070 - 0x0000)
struct ButtonWidget_C_ExecuteUbergraph_ButtonWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0068)()
};
static_assert(alignof(ButtonWidget_C_ExecuteUbergraph_ButtonWidget) == 0x000008, "Wrong alignment on ButtonWidget_C_ExecuteUbergraph_ButtonWidget");
static_assert(sizeof(ButtonWidget_C_ExecuteUbergraph_ButtonWidget) == 0x000070, "Wrong size on ButtonWidget_C_ExecuteUbergraph_ButtonWidget");
static_assert(offsetof(ButtonWidget_C_ExecuteUbergraph_ButtonWidget, EntryPoint) == 0x000000, "Member 'ButtonWidget_C_ExecuteUbergraph_ButtonWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ButtonWidget_C_ExecuteUbergraph_ButtonWidget, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'ButtonWidget_C_ExecuteUbergraph_ButtonWidget::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function ButtonWidget.ButtonWidget_C.MakeBrush
// 0x0130 (0x0130 - 0x0000)
struct ButtonWidget_C_MakeBrush final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            Brush;                                             // 0x0008(0x0090)(Parm, OutParm)
	int32                                         CallFunc_Blueprint_GetSizeX_ReturnValue;           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Blueprint_GetSizeY_ReturnValue;           // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x00A0(0x0090)()
};
static_assert(alignof(ButtonWidget_C_MakeBrush) == 0x000008, "Wrong alignment on ButtonWidget_C_MakeBrush");
static_assert(sizeof(ButtonWidget_C_MakeBrush) == 0x000130, "Wrong size on ButtonWidget_C_MakeBrush");
static_assert(offsetof(ButtonWidget_C_MakeBrush, Texture) == 0x000000, "Member 'ButtonWidget_C_MakeBrush::Texture' has a wrong offset!");
static_assert(offsetof(ButtonWidget_C_MakeBrush, Brush) == 0x000008, "Member 'ButtonWidget_C_MakeBrush::Brush' has a wrong offset!");
static_assert(offsetof(ButtonWidget_C_MakeBrush, CallFunc_Blueprint_GetSizeX_ReturnValue) == 0x000098, "Member 'ButtonWidget_C_MakeBrush::CallFunc_Blueprint_GetSizeX_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonWidget_C_MakeBrush, CallFunc_Blueprint_GetSizeY_ReturnValue) == 0x00009C, "Member 'ButtonWidget_C_MakeBrush::CallFunc_Blueprint_GetSizeY_ReturnValue' has a wrong offset!");
static_assert(offsetof(ButtonWidget_C_MakeBrush, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x0000A0, "Member 'ButtonWidget_C_MakeBrush::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

}

