#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShakeForFalling

#include "Basic.hpp"


namespace SDK::Params
{

// Function CameraShakeForFalling.CameraShakeForFalling_C.ExecuteUbergraph_CameraShakeForFalling
// 0x0008 (0x0008 - 0x0000)
struct CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Scale;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling) == 0x000004, "Wrong alignment on CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling");
static_assert(sizeof(CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling) == 0x000008, "Wrong size on CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling");
static_assert(offsetof(CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling, EntryPoint) == 0x000000, "Member 'CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling::EntryPoint' has a wrong offset!");
static_assert(offsetof(CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling, K2Node_Event_Scale) == 0x000004, "Member 'CameraShakeForFalling_C_ExecuteUbergraph_CameraShakeForFalling::K2Node_Event_Scale' has a wrong offset!");

// Function CameraShakeForFalling.CameraShakeForFalling_C.ReceivePlayShake
// 0x0004 (0x0004 - 0x0000)
struct CameraShakeForFalling_C_ReceivePlayShake final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraShakeForFalling_C_ReceivePlayShake) == 0x000004, "Wrong alignment on CameraShakeForFalling_C_ReceivePlayShake");
static_assert(sizeof(CameraShakeForFalling_C_ReceivePlayShake) == 0x000004, "Wrong size on CameraShakeForFalling_C_ReceivePlayShake");
static_assert(offsetof(CameraShakeForFalling_C_ReceivePlayShake, Scale) == 0x000000, "Member 'CameraShakeForFalling_C_ReceivePlayShake::Scale' has a wrong offset!");

}

