#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CarePackgeItemListWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CarePackgeItemListWidget.CarePackgeItemListWidget_C.ExecuteUbergraph_CarePackgeItemListWidget
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget) == 0x000008, "Wrong alignment on CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget");
static_assert(sizeof(CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget) == 0x000018, "Wrong size on CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget");
static_assert(offsetof(CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget, EntryPoint) == 0x000000, "Member 'CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CarePackgeItemListWidget_C_ExecuteUbergraph_CarePackgeItemListWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function CarePackgeItemListWidget.CarePackgeItemListWidget_C.GetCarePackageItemWidget
// 0x0038 (0x0038 - 0x0000)
struct CarePackgeItemListWidget_C_GetCarePackageItemWidget final
{
public:
	class UTexture*                               ItemIcon;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   ItemName;                                          // 0x0008(0x0018)(Parm)
	int32                                         ItemCount;                                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCarePackageItemSlotWidget_C*           CarePackageItemSlotWidget;                         // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCarePackageItemSlotWidget_C*           CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CarePackgeItemListWidget_C_GetCarePackageItemWidget) == 0x000008, "Wrong alignment on CarePackgeItemListWidget_C_GetCarePackageItemWidget");
static_assert(sizeof(CarePackgeItemListWidget_C_GetCarePackageItemWidget) == 0x000038, "Wrong size on CarePackgeItemListWidget_C_GetCarePackageItemWidget");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemWidget, ItemIcon) == 0x000000, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemWidget::ItemIcon' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemWidget, ItemName) == 0x000008, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemWidget::ItemName' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemWidget, ItemCount) == 0x000020, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemWidget::ItemCount' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemWidget, CarePackageItemSlotWidget) == 0x000028, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemWidget::CarePackageItemSlotWidget' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemWidget, CallFunc_Create_ReturnValue) == 0x000030, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function CarePackgeItemListWidget.CarePackgeItemListWidget_C.GetCarePackageItemIcons
// 0x0040 (0x0040 - 0x0000)
struct CarePackgeItemListWidget_C_GetCarePackageItemIcons final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslSpectatorPawn*                      K2Node_DynamicCast_AsTsl_Spectator_Pawn;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsObserving_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarePackageItem*                       CallFunc_GetSpectableCarePackageItem_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CarePackgeItemListWidget_C_GetCarePackageItemIcons) == 0x000008, "Wrong alignment on CarePackgeItemListWidget_C_GetCarePackageItemIcons");
static_assert(sizeof(CarePackgeItemListWidget_C_GetCarePackageItemIcons) == 0x000040, "Wrong size on CarePackgeItemListWidget_C_GetCarePackageItemIcons");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, CallFunc_GetSpectatorPawn_ReturnValue) == 0x000008, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::CallFunc_GetSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000010, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, K2Node_DynamicCast_AsTsl_Spectator_Pawn) == 0x000020, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::K2Node_DynamicCast_AsTsl_Spectator_Pawn' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, CallFunc_IsObserving_ReturnValue) == 0x000029, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::CallFunc_IsObserving_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, CallFunc_GetSpectableCarePackageItem_ReturnValue) == 0x000030, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::CallFunc_GetSpectableCarePackageItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_GetCarePackageItemIcons, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'CarePackgeItemListWidget_C_GetCarePackageItemIcons::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function CarePackgeItemListWidget.CarePackgeItemListWidget_C.SetCarePackgeItemList
// 0x0038 (0x0038 - 0x0000)
struct CarePackgeItemListWidget_C_SetCarePackgeItemList final
{
public:
	int32                                         m__int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTexture*                               CallFunc_GetIconTexture_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCarePackageItemSlotWidget_C*           CallFunc_GetCarePackageItemWidget_CarePackageItemSlotWidget; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CarePackgeItemListWidget_C_SetCarePackgeItemList) == 0x000008, "Wrong alignment on CarePackgeItemListWidget_C_SetCarePackgeItemList");
static_assert(sizeof(CarePackgeItemListWidget_C_SetCarePackgeItemList) == 0x000038, "Wrong size on CarePackgeItemListWidget_C_SetCarePackgeItemList");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, m__int_Array_Index_Variable) == 0x000000, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, m__int_Loop_Counter_Variable) == 0x000004, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_Array_Get_Item) == 0x000010, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_GetIconTexture_ReturnValue) == 0x000018, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_GetIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_GetCarePackageItemWidget_CarePackageItemSlotWidget) == 0x000028, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_GetCarePackageItemWidget_CarePackageItemSlotWidget' has a wrong offset!");
static_assert(offsetof(CarePackgeItemListWidget_C_SetCarePackgeItemList, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'CarePackgeItemListWidget_C_SetCarePackgeItemList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

