#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CarePackageInteractionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CarePackageInteractionWidget.CarePackageInteractionWidget_C
// 0x0018 (0x0258 - 0x0240)
class UCarePackageInteractionWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        InteractionInputMethodSwitcher;                    // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 KeyImage;                                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_CarePackageInteractionWidget(int32 EntryPoint);
	void TimerCheckCarePackage();
	void CustomTick();
	void BndEvt__Vanishing_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ShowCarePackageInteractionWidget(bool IsShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CarePackageInteractionWidget_C">();
	}
	static class UCarePackageInteractionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCarePackageInteractionWidget_C>();
	}
};
static_assert(alignof(UCarePackageInteractionWidget_C) == 0x000008, "Wrong alignment on UCarePackageInteractionWidget_C");
static_assert(sizeof(UCarePackageInteractionWidget_C) == 0x000258, "Wrong size on UCarePackageInteractionWidget_C");
static_assert(offsetof(UCarePackageInteractionWidget_C, UberGraphFrame) == 0x000240, "Member 'UCarePackageInteractionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCarePackageInteractionWidget_C, InteractionInputMethodSwitcher) == 0x000248, "Member 'UCarePackageInteractionWidget_C::InteractionInputMethodSwitcher' has a wrong offset!");
static_assert(offsetof(UCarePackageInteractionWidget_C, KeyImage) == 0x000250, "Member 'UCarePackageInteractionWidget_C::KeyImage' has a wrong offset!");

}

