#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CategoryGroupWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CategoryGroupWidget.CategoryGroupWidget_C.AddItemSlot
// 0x0010 (0x0010 - 0x0000)
struct CategoryGroupWidget_C_AddItemSlot final
{
public:
	class UItemSlotWidget_C*                      ItemSlotWidget;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryGroupWidget_C_AddItemSlot) == 0x000008, "Wrong alignment on CategoryGroupWidget_C_AddItemSlot");
static_assert(sizeof(CategoryGroupWidget_C_AddItemSlot) == 0x000010, "Wrong size on CategoryGroupWidget_C_AddItemSlot");
static_assert(offsetof(CategoryGroupWidget_C_AddItemSlot, ItemSlotWidget) == 0x000000, "Member 'CategoryGroupWidget_C_AddItemSlot::ItemSlotWidget' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_AddItemSlot, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'CategoryGroupWidget_C_AddItemSlot::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function CategoryGroupWidget.CategoryGroupWidget_C.OnPrepass_0
// 0x0018 (0x0018 - 0x0000)
struct CategoryGroupWidget_C_OnPrepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryGroupWidget_C_OnPrepass_0) == 0x000008, "Wrong alignment on CategoryGroupWidget_C_OnPrepass_0");
static_assert(sizeof(CategoryGroupWidget_C_OnPrepass_0) == 0x000018, "Wrong size on CategoryGroupWidget_C_OnPrepass_0");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, BoundWidget) == 0x000000, "Member 'CategoryGroupWidget_C_OnPrepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, m__bool_Variable) == 0x000008, "Member 'CategoryGroupWidget_C_OnPrepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, m__byte_Variable) == 0x000009, "Member 'CategoryGroupWidget_C_OnPrepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, m__byte_Variable2) == 0x00000A, "Member 'CategoryGroupWidget_C_OnPrepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, CallFunc_GetChildrenCount_ReturnValue) == 0x00000C, "Member 'CategoryGroupWidget_C_OnPrepass_0::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'CategoryGroupWidget_C_OnPrepass_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_OnPrepass_0, K2Node_Select_Default) == 0x000011, "Member 'CategoryGroupWidget_C_OnPrepass_0::K2Node_Select_Default' has a wrong offset!");

// Function CategoryGroupWidget.CategoryGroupWidget_C.AddChild
// 0x0010 (0x0010 - 0x0000)
struct CategoryGroupWidget_C_AddChild final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryGroupWidget_C_AddChild) == 0x000008, "Wrong alignment on CategoryGroupWidget_C_AddChild");
static_assert(sizeof(CategoryGroupWidget_C_AddChild) == 0x000010, "Wrong size on CategoryGroupWidget_C_AddChild");
static_assert(offsetof(CategoryGroupWidget_C_AddChild, Widget) == 0x000000, "Member 'CategoryGroupWidget_C_AddChild::Widget' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_AddChild, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'CategoryGroupWidget_C_AddChild::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function CategoryGroupWidget.CategoryGroupWidget_C.GetChilderenCount
// 0x0008 (0x0008 - 0x0000)
struct CategoryGroupWidget_C_GetChilderenCount final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CategoryGroupWidget_C_GetChilderenCount) == 0x000004, "Wrong alignment on CategoryGroupWidget_C_GetChilderenCount");
static_assert(sizeof(CategoryGroupWidget_C_GetChilderenCount) == 0x000008, "Wrong size on CategoryGroupWidget_C_GetChilderenCount");
static_assert(offsetof(CategoryGroupWidget_C_GetChilderenCount, Count) == 0x000000, "Member 'CategoryGroupWidget_C_GetChilderenCount::Count' has a wrong offset!");
static_assert(offsetof(CategoryGroupWidget_C_GetChilderenCount, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'CategoryGroupWidget_C_GetChilderenCount::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");

}

