#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharProxy_AnimBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function CharProxy_AnimBP.CharProxy_AnimBP_C.ExecuteUbergraph_CharProxy_AnimBP
// 0x0070 (0x0070 - 0x0000)
struct CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCurveValue_ReturnValue2;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponAnimInfoComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslWeapon*                             CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponClass                                  CallFunc_GetWeaponClassEnum_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslWeapon_Gun*                         K2Node_DynamicCast_AsTsl_Weapon_Gun;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimWeaponType                               CallFunc_GetAnimWeaponType_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGripTypeIndex_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpaceBase*                        CallFunc_GetCharacterLHGripBlendspace_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UBlendSpace1D*                          CallFunc_GetCharacterGripBlendspace_ReturnValue;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP) == 0x000008, "Wrong alignment on CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP");
static_assert(sizeof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP) == 0x000070, "Wrong size on CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, EntryPoint) == 0x000000, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetCurveValue_ReturnValue2) == 0x000008, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetCurveValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000010, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000030, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_IsValid_ReturnValue2) == 0x000038, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetWeaponClassEnum_ReturnValue) == 0x000039, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetWeaponClassEnum_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, K2Node_DynamicCast_AsTsl_Weapon_Gun) == 0x000040, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::K2Node_DynamicCast_AsTsl_Weapon_Gun' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetAnimWeaponType_ReturnValue) == 0x000049, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetAnimWeaponType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetGripTypeIndex_ReturnValue) == 0x00004C, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetGripTypeIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000050, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetCharacterLHGripBlendspace_ReturnValue) == 0x000058, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetCharacterLHGripBlendspace_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, CallFunc_GetCharacterGripBlendspace_ReturnValue) == 0x000060, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::CallFunc_GetCharacterGripBlendspace_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP, K2Node_Event_DeltaTimeX) == 0x000068, "Member 'CharProxy_AnimBP_C_ExecuteUbergraph_CharProxy_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function CharProxy_AnimBP.CharProxy_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct CharProxy_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharProxy_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on CharProxy_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(CharProxy_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on CharProxy_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(CharProxy_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'CharProxy_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function CharProxy_AnimBP.CharProxy_AnimBP_C.GetAnimWeaponType
// 0x0028 (0x0028 - 0x0000)
struct CharProxy_AnimBP_C_GetAnimWeaponType final
{
public:
	EAnimWeaponType                               AnimWeaponType_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponAnimInfoComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslWeapon*                             CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAnimWeaponType                               CallFunc_GetAnimWeaponType_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharProxy_AnimBP_C_GetAnimWeaponType) == 0x000008, "Wrong alignment on CharProxy_AnimBP_C_GetAnimWeaponType");
static_assert(sizeof(CharProxy_AnimBP_C_GetAnimWeaponType) == 0x000028, "Wrong size on CharProxy_AnimBP_C_GetAnimWeaponType");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, AnimWeaponType_0) == 0x000000, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::AnimWeaponType_0' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000018, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_IsValid_ReturnValue2) == 0x000021, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponType, CallFunc_GetAnimWeaponType_ReturnValue) == 0x000022, "Member 'CharProxy_AnimBP_C_GetAnimWeaponType::CallFunc_GetAnimWeaponType_ReturnValue' has a wrong offset!");

// Function CharProxy_AnimBP.CharProxy_AnimBP_C.GetAnimWeaponIKLeft
// 0x00B0 (0x00B0 - 0x0000)
struct CharProxy_AnimBP_C_GetAnimWeaponIKLeft final
{
public:
	struct FTransform                             IKLeft;                                            // 0x0000(0x0030)(Parm, OutParm, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class UWeaponAnimInfoComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetWeaponHandIK_Left_ReturnValue;         // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft) == 0x000010, "Wrong alignment on CharProxy_AnimBP_C_GetAnimWeaponIKLeft");
static_assert(sizeof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft) == 0x0000B0, "Wrong size on CharProxy_AnimBP_C_GetAnimWeaponIKLeft");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, IKLeft) == 0x000000, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::IKLeft' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000030, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, CallFunc_GetComponentByClass_ReturnValue) == 0x000070, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_GetAnimWeaponIKLeft, CallFunc_GetWeaponHandIK_Left_ReturnValue) == 0x000080, "Member 'CharProxy_AnimBP_C_GetAnimWeaponIKLeft::CallFunc_GetWeaponHandIK_Left_ReturnValue' has a wrong offset!");

// Function CharProxy_AnimBP.CharProxy_AnimBP_C.UpdateBlink
// 0x0020 (0x0020 - 0x0000)
struct CharProxy_AnimBP_C_UpdateBlink final
{
public:
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMod_Remainder;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CharProxy_AnimBP_C_UpdateBlink) == 0x000004, "Wrong alignment on CharProxy_AnimBP_C_UpdateBlink");
static_assert(sizeof(CharProxy_AnimBP_C_UpdateBlink) == 0x000020, "Wrong size on CharProxy_AnimBP_C_UpdateBlink");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000000, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_FMod_Remainder) == 0x000004, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_FMod_ReturnValue) == 0x000008, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_FClamp_ReturnValue) == 0x00000C, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000018, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CharProxy_AnimBP_C_UpdateBlink, CallFunc_DegSin_ReturnValue) == 0x00001C, "Member 'CharProxy_AnimBP_C_UpdateBlink::CallFunc_DegSin_ReturnValue' has a wrong offset!");

}

