#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterProxyBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CharacterProxyBase.CharacterProxyBase_C
// 0x0030 (0x0820 - 0x07F0)
class ACharacterProxyBase_C : public ATslCharacterProxy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTslAccessoryComponent*                 Slot_Thrown;                                       // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UTslAccessoryComponent*                 Slot_Melee;                                        // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UTslAccessoryComponent*                 Slot_SideArm;                                      // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UTslAccessoryComponent*                 Slot_Secondary;                                    // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UTslAccessoryComponent*                 Slot_Primary;                                      // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)

public:
	void ExecuteUbergraph_CharacterProxyBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterProxyBase_C">();
	}
	static class ACharacterProxyBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACharacterProxyBase_C>();
	}
};
static_assert(alignof(ACharacterProxyBase_C) == 0x000010, "Wrong alignment on ACharacterProxyBase_C");
static_assert(sizeof(ACharacterProxyBase_C) == 0x000820, "Wrong size on ACharacterProxyBase_C");
static_assert(offsetof(ACharacterProxyBase_C, UberGraphFrame) == 0x0007F0, "Member 'ACharacterProxyBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACharacterProxyBase_C, Slot_Thrown) == 0x0007F8, "Member 'ACharacterProxyBase_C::Slot_Thrown' has a wrong offset!");
static_assert(offsetof(ACharacterProxyBase_C, Slot_Melee) == 0x000800, "Member 'ACharacterProxyBase_C::Slot_Melee' has a wrong offset!");
static_assert(offsetof(ACharacterProxyBase_C, Slot_SideArm) == 0x000808, "Member 'ACharacterProxyBase_C::Slot_SideArm' has a wrong offset!");
static_assert(offsetof(ACharacterProxyBase_C, Slot_Secondary) == 0x000810, "Member 'ACharacterProxyBase_C::Slot_Secondary' has a wrong offset!");
static_assert(offsetof(ACharacterProxyBase_C, Slot_Primary) == 0x000818, "Member 'ACharacterProxyBase_C::Slot_Primary' has a wrong offset!");

}

