#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomizableObject

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CustomizableObject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class CustomizableObject.CustomizableMeshComponent
// 0x0068 (0x0368 - 0x0300)
#pragma pack(push, 0x1)
class alignas(0x08) UCustomizableMeshComponent : public USceneComponent
{
public:
	uint8                                         Pad_300[0x58];                                     // 0x0300(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class UTexture2D>>      CreatedTextures;                                   // 0x0358(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableMeshComponent">();
	}
	static class UCustomizableMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableMeshComponent>();
	}
};
#pragma pack(pop)
static_assert(alignof(UCustomizableMeshComponent) == 0x000008, "Wrong alignment on UCustomizableMeshComponent");
static_assert(sizeof(UCustomizableMeshComponent) == 0x000368, "Wrong size on UCustomizableMeshComponent");
static_assert(offsetof(UCustomizableMeshComponent, CreatedTextures) == 0x000358, "Member 'UCustomizableMeshComponent::CreatedTextures' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectSystem
// 0x00C8 (0x00F0 - 0x0028)
class UCustomizableObjectSystem final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMutableSkeletalMeshTracker>    SkeletalMeshTrackerArray;                          // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMutableTextureTracker>         TextureTrackerArray;                               // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x20];                                      // 0x0068(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableSkeletalComponent*         CurrentBeginUpdateComponent;                       // 0x0088(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x60];                                      // 0x0090(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectSystem">();
	}
	static class UCustomizableObjectSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectSystem>();
	}
};
static_assert(alignof(UCustomizableObjectSystem) == 0x000008, "Wrong alignment on UCustomizableObjectSystem");
static_assert(sizeof(UCustomizableObjectSystem) == 0x0000F0, "Wrong size on UCustomizableObjectSystem");
static_assert(offsetof(UCustomizableObjectSystem, SkeletalMeshTrackerArray) == 0x000048, "Member 'UCustomizableObjectSystem::SkeletalMeshTrackerArray' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystem, TextureTrackerArray) == 0x000058, "Member 'UCustomizableObjectSystem::TextureTrackerArray' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectSystem, CurrentBeginUpdateComponent) == 0x000088, "Member 'UCustomizableObjectSystem::CurrentBeginUpdateComponent' has a wrong offset!");

// Class CustomizableObject.CustomizableSkeletalComponent
// 0x0058 (0x03C0 - 0x0368)
class UCustomizableSkeletalComponent : public UCustomizableMeshComponent
{
public:
	class UCustomizableObjectInstance*            CustomizableObjectInstance;                        // 0x0368(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0370(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_378[0x48];                                     // 0x0378(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableSkeletalComponent">();
	}
	static class UCustomizableSkeletalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableSkeletalComponent>();
	}
};
static_assert(alignof(UCustomizableSkeletalComponent) == 0x000008, "Wrong alignment on UCustomizableSkeletalComponent");
static_assert(sizeof(UCustomizableSkeletalComponent) == 0x0003C0, "Wrong size on UCustomizableSkeletalComponent");
static_assert(offsetof(UCustomizableSkeletalComponent, CustomizableObjectInstance) == 0x000368, "Member 'UCustomizableSkeletalComponent::CustomizableObjectInstance' has a wrong offset!");
static_assert(offsetof(UCustomizableSkeletalComponent, SkeletalMesh) == 0x000370, "Member 'UCustomizableSkeletalComponent::SkeletalMesh' has a wrong offset!");

// Class CustomizableObject.CustomizableInstancePrivateData
// 0x00D8 (0x0100 - 0x0028)
class UCustomizableInstancePrivateData final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGeneratedMaterial>             GeneratedMaterials;                                // 0x0030(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedMesh>                 GeneratedMeshes;                                   // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FGeneratedTexture>              GeneratedTextures;                                 // 0x0050(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0xA0];                                      // 0x0060(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableInstancePrivateData">();
	}
	static class UCustomizableInstancePrivateData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableInstancePrivateData>();
	}
};
static_assert(alignof(UCustomizableInstancePrivateData) == 0x000008, "Wrong alignment on UCustomizableInstancePrivateData");
static_assert(sizeof(UCustomizableInstancePrivateData) == 0x000100, "Wrong size on UCustomizableInstancePrivateData");
static_assert(offsetof(UCustomizableInstancePrivateData, GeneratedMaterials) == 0x000030, "Member 'UCustomizableInstancePrivateData::GeneratedMaterials' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivateData, GeneratedMeshes) == 0x000040, "Member 'UCustomizableInstancePrivateData::GeneratedMeshes' has a wrong offset!");
static_assert(offsetof(UCustomizableInstancePrivateData, GeneratedTextures) == 0x000050, "Member 'UCustomizableInstancePrivateData::GeneratedTextures' has a wrong offset!");

// Class CustomizableObject.CustomizableObject
// 0x00C0 (0x00E8 - 0x0028)
class UCustomizableObject final : public UObject
{
public:
	class USkeletalMesh*                          ReferenceSkeletalMesh;                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ReferenceStaticMesh;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             ReferencedMaterials;                               // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMutableModelImageProperties>   ImageProperties;                                   // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<class FString, struct FCustomizableObjectIdPair> GroupNodeMap;                                      // 0x0058(0x0050)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCompilationOptions                    CompileOptions;                                    // 0x00A8(0x000C)(NativeAccessSpecifierPublic)
	struct FGuid                                  VersionId;                                         // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMutableModelParameterProperties> ParameterProperties;                               // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObject">();
	}
	static class UCustomizableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObject>();
	}
};
static_assert(alignof(UCustomizableObject) == 0x000008, "Wrong alignment on UCustomizableObject");
static_assert(sizeof(UCustomizableObject) == 0x0000E8, "Wrong size on UCustomizableObject");
static_assert(offsetof(UCustomizableObject, ReferenceSkeletalMesh) == 0x000028, "Member 'UCustomizableObject::ReferenceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ReferenceStaticMesh) == 0x000030, "Member 'UCustomizableObject::ReferenceStaticMesh' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ReferencedMaterials) == 0x000038, "Member 'UCustomizableObject::ReferencedMaterials' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ImageProperties) == 0x000048, "Member 'UCustomizableObject::ImageProperties' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, GroupNodeMap) == 0x000058, "Member 'UCustomizableObject::GroupNodeMap' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, CompileOptions) == 0x0000A8, "Member 'UCustomizableObject::CompileOptions' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, VersionId) == 0x0000B4, "Member 'UCustomizableObject::VersionId' has a wrong offset!");
static_assert(offsetof(UCustomizableObject, ParameterProperties) == 0x0000C8, "Member 'UCustomizableObject::ParameterProperties' has a wrong offset!");

// Class CustomizableObject.CustomizableObjectInstance
// 0x0108 (0x0130 - 0x0028)
class UCustomizableObjectInstance final : public UObject
{
public:
	class UCustomizableObject*                    CustomizableObject;                                // 0x0028(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         State;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCustomizableObjectBoolParameterValue> BoolParameters;                                    // 0x0038(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectIntParameterValue> IntParameters;                                     // 0x0048(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectFloatParameterValue> FloatParameters;                                   // 0x0058(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectVectorParameterValue> VectorParameters;                                  // 0x0068(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCustomizableObjectProjectorParameterValue> ProjectorParameters;                               // 0x0078(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bBuildRawData;                                     // 0x0088(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBuildRenderData;                                  // 0x0089(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x96];                                      // 0x008A(0x0096)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomizableInstancePrivateData*       PrivateData;                                       // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetRandomValues();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomizableObjectInstance">();
	}
	static class UCustomizableObjectInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomizableObjectInstance>();
	}
};
static_assert(alignof(UCustomizableObjectInstance) == 0x000008, "Wrong alignment on UCustomizableObjectInstance");
static_assert(sizeof(UCustomizableObjectInstance) == 0x000130, "Wrong size on UCustomizableObjectInstance");
static_assert(offsetof(UCustomizableObjectInstance, CustomizableObject) == 0x000028, "Member 'UCustomizableObjectInstance::CustomizableObject' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, State) == 0x000030, "Member 'UCustomizableObjectInstance::State' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, BoolParameters) == 0x000038, "Member 'UCustomizableObjectInstance::BoolParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, IntParameters) == 0x000048, "Member 'UCustomizableObjectInstance::IntParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, FloatParameters) == 0x000058, "Member 'UCustomizableObjectInstance::FloatParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, VectorParameters) == 0x000068, "Member 'UCustomizableObjectInstance::VectorParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, ProjectorParameters) == 0x000078, "Member 'UCustomizableObjectInstance::ProjectorParameters' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, bBuildRawData) == 0x000088, "Member 'UCustomizableObjectInstance::bBuildRawData' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, bBuildRenderData) == 0x000089, "Member 'UCustomizableObjectInstance::bBuildRenderData' has a wrong offset!");
static_assert(offsetof(UCustomizableObjectInstance, PrivateData) == 0x000120, "Member 'UCustomizableObjectInstance::PrivateData' has a wrong offset!");

}

