#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DistanceSliderWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function DistanceSliderWidget.DistanceSliderWidget_C.ExecuteUbergraph_DistanceSliderWidget
// 0x0050 (0x0050 - 0x0000)
struct DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslSpectatorPawn*                      K2Node_DynamicCast_AsTsl_Spectator_Pawn;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget) == 0x000008, "Wrong alignment on DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget");
static_assert(sizeof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget) == 0x000050, "Wrong size on DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, EntryPoint) == 0x000000, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000010, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, CallFunc_GetSpectatorPawn_ReturnValue) == 0x000020, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::CallFunc_GetSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_ComponentBoundEvent_Value) == 0x000028, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_DynamicCast_AsTsl_Spectator_Pawn) == 0x000030, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_DynamicCast_AsTsl_Spectator_Pawn' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'DistanceSliderWidget_C_ExecuteUbergraph_DistanceSliderWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'DistanceSliderWidget_C_BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.SetDistance
// 0x0008 (0x0008 - 0x0000)
struct DistanceSliderWidget_C_SetDistance final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_SetDistance) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_SetDistance");
static_assert(sizeof(DistanceSliderWidget_C_SetDistance) == 0x000008, "Wrong size on DistanceSliderWidget_C_SetDistance");
static_assert(offsetof(DistanceSliderWidget_C_SetDistance, Value) == 0x000000, "Member 'DistanceSliderWidget_C_SetDistance::Value' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_SetDistance, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000004, "Member 'DistanceSliderWidget_C_SetDistance::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.SetValue
// 0x0008 (0x0008 - 0x0000)
struct DistanceSliderWidget_C_SetValue final
{
public:
	float                                         Pos;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_SetValue) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_SetValue");
static_assert(sizeof(DistanceSliderWidget_C_SetValue) == 0x000008, "Wrong size on DistanceSliderWidget_C_SetValue");
static_assert(offsetof(DistanceSliderWidget_C_SetValue, Pos) == 0x000000, "Member 'DistanceSliderWidget_C_SetValue::Pos' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_SetValue, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'DistanceSliderWidget_C_SetValue::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.ChangeDistance_Slider
// 0x0008 (0x0008 - 0x0000)
struct DistanceSliderWidget_C_ChangeDistance_Slider final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetDistance_Distance;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_ChangeDistance_Slider) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_ChangeDistance_Slider");
static_assert(sizeof(DistanceSliderWidget_C_ChangeDistance_Slider) == 0x000008, "Wrong size on DistanceSliderWidget_C_ChangeDistance_Slider");
static_assert(offsetof(DistanceSliderWidget_C_ChangeDistance_Slider, Value) == 0x000000, "Member 'DistanceSliderWidget_C_ChangeDistance_Slider::Value' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ChangeDistance_Slider, CallFunc_GetDistance_Distance) == 0x000004, "Member 'DistanceSliderWidget_C_ChangeDistance_Slider::CallFunc_GetDistance_Distance' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.SetDistanceFunc
// 0x0008 (0x0008 - 0x0000)
struct DistanceSliderWidget_C_SetDistanceFunc final
{
public:
	float                                         CallFunc_GetShowPlayerInfoDistance_ReturnValue;    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_SetDistanceFunc) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_SetDistanceFunc");
static_assert(sizeof(DistanceSliderWidget_C_SetDistanceFunc) == 0x000008, "Wrong size on DistanceSliderWidget_C_SetDistanceFunc");
static_assert(offsetof(DistanceSliderWidget_C_SetDistanceFunc, CallFunc_GetShowPlayerInfoDistance_ReturnValue) == 0x000000, "Member 'DistanceSliderWidget_C_SetDistanceFunc::CallFunc_GetShowPlayerInfoDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_SetDistanceFunc, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000004, "Member 'DistanceSliderWidget_C_SetDistanceFunc::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.ChangeDistance_Delegate
// 0x0008 (0x0008 - 0x0000)
struct DistanceSliderWidget_C_ChangeDistance_Delegate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetShowPlayerInfoDistance_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_ChangeDistance_Delegate) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_ChangeDistance_Delegate");
static_assert(sizeof(DistanceSliderWidget_C_ChangeDistance_Delegate) == 0x000008, "Wrong size on DistanceSliderWidget_C_ChangeDistance_Delegate");
static_assert(offsetof(DistanceSliderWidget_C_ChangeDistance_Delegate, Value) == 0x000000, "Member 'DistanceSliderWidget_C_ChangeDistance_Delegate::Value' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_ChangeDistance_Delegate, CallFunc_GetShowPlayerInfoDistance_ReturnValue) == 0x000004, "Member 'DistanceSliderWidget_C_ChangeDistance_Delegate::CallFunc_GetShowPlayerInfoDistance_ReturnValue' has a wrong offset!");

// Function DistanceSliderWidget.DistanceSliderWidget_C.GetDistance
// 0x000C (0x000C - 0x0000)
struct DistanceSliderWidget_C_GetDistance final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DistanceSliderWidget_C_GetDistance) == 0x000004, "Wrong alignment on DistanceSliderWidget_C_GetDistance");
static_assert(sizeof(DistanceSliderWidget_C_GetDistance) == 0x00000C, "Wrong size on DistanceSliderWidget_C_GetDistance");
static_assert(offsetof(DistanceSliderWidget_C_GetDistance, Distance) == 0x000000, "Member 'DistanceSliderWidget_C_GetDistance::Distance' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_GetDistance, CallFunc_GetValue_ReturnValue) == 0x000004, "Member 'DistanceSliderWidget_C_GetDistance::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(DistanceSliderWidget_C_GetDistance, CallFunc_GetFloatValue_ReturnValue) == 0x000008, "Member 'DistanceSliderWidget_C_GetDistance::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");

}

