#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DistanceSliderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DistanceSliderWidget.DistanceSliderWidget_C
// 0x0040 (0x0280 - 0x0240)
class UDistanceSliderWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USlider*                                DistanceSlider;                                    // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	float                                         MinDistance;                                       // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MaxDistance;                                       // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	UMulticastDelegateProperty_                   ChagedDistance;                                    // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCurveFloat*                            DistanceCurve;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Position;                                          // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslSpectatorPawn*                      TslSpectatorPawn;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DistanceSliderWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__DistanceSlider_K2Node_ComponentBoundEvent_64_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void SetDistance(float Value);
	void SetValue(float Pos);
	void ChangeDistance_Slider(float Value);
	void SetDistanceFunc();
	void ChangeDistance_Delegate(float Value);

	void GetDistance(float* Distance) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DistanceSliderWidget_C">();
	}
	static class UDistanceSliderWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistanceSliderWidget_C>();
	}
};
static_assert(alignof(UDistanceSliderWidget_C) == 0x000008, "Wrong alignment on UDistanceSliderWidget_C");
static_assert(sizeof(UDistanceSliderWidget_C) == 0x000280, "Wrong size on UDistanceSliderWidget_C");
static_assert(offsetof(UDistanceSliderWidget_C, UberGraphFrame) == 0x000240, "Member 'UDistanceSliderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, DistanceSlider) == 0x000248, "Member 'UDistanceSliderWidget_C::DistanceSlider' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, MinDistance) == 0x000250, "Member 'UDistanceSliderWidget_C::MinDistance' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, MaxDistance) == 0x000254, "Member 'UDistanceSliderWidget_C::MaxDistance' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, ChagedDistance) == 0x000258, "Member 'UDistanceSliderWidget_C::ChagedDistance' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, DistanceCurve) == 0x000268, "Member 'UDistanceSliderWidget_C::DistanceCurve' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, Position) == 0x000270, "Member 'UDistanceSliderWidget_C::Position' has a wrong offset!");
static_assert(offsetof(UDistanceSliderWidget_C, TslSpectatorPawn) == 0x000278, "Member 'UDistanceSliderWidget_C::TslSpectatorPawn' has a wrong offset!");

}

