#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EquipmentWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function EquipmentWidget.EquipmentWidget_C.ExecuteUbergraph_EquipmentWidget
// 0x05C0 (0x05C0 - 0x0000)
struct EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUseCharacterCapture_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue2;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue3;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry3;                          // 0x00B4(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x00E8(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0168(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_ReturnValue;                 // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_EnterOtherContainer_NewOtherContainer_CastInput; // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x0274(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter2; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterValid_ReturnValue;             // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BB[0x5];                                      // 0x02BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SpawnedActor;                   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacterStudio*                       K2Node_DynamicCast_AsCharacter_Studio;             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x02D8(0x0078)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Scale2;                         // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_Scale;                          // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4; // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue4;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x2];                                      // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0384(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x03B8(0x0078)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue4;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue5;             // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMousePosition_LocationX;               // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMousePosition_LocationY;               // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMousePosition_ReturnValue;             // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x044C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue6;             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue2;                      // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDragDropOperation*                     CallFunc_GetDragDroppingContent_ReturnValue;       // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3; // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue2;                     // 0x0483(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue3;                     // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue4;                     // 0x0485(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_486[0x2];                                      // 0x0486(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetRealChildUpWidget_UpWidget;            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5; // 0x0498(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue5;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x6];                                      // 0x04AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetRealChildUpWidget_UpWidget2;           // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x04B8(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6; // 0x04C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue6;                    // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA[0x6];                                      // 0x04DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x04E0(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            CallFunc_GetRealChildDownWidget_DownWidget;        // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetRealChildDownWidget_DownWidget2;       // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7; // 0x0508(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Scale)>                  K2Node_CreateDelegate_OutputDelegate7;             // 0x0520(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue7;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetRealChildLeftWidget_LeftWidget;        // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetRealChildLeftWidget_LeftWidget2;       // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8; // 0x0550(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float Scale)>                  K2Node_CreateDelegate_OutputDelegate8;             // 0x0568(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue8;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetRealChildRightWidget_RightWidget;      // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetRealChildRightWidget_RightWidget2;     // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUseCharacterCapture_ReturnValue2;      // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* SpawnedActor)>   K2Node_CreateDelegate_OutputDelegate9;             // 0x0598(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue;                    // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue11;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget) == 0x000010, "Wrong alignment on EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget");
static_assert(sizeof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget) == 0x0005C0, "Wrong size on EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, EntryPoint) == 0x000000, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetUseCharacterCapture_ReturnValue) == 0x000004, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetUseCharacterCapture_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface) == 0x000008, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2) == 0x000020, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess2) == 0x000030, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue) == 0x000031, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue2) == 0x000032, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3) == 0x000038, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess3) == 0x000048, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue3) == 0x000060, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetHUD_ReturnValue) == 0x000090, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000098, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_HUD) == 0x0000A8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess4) == 0x0000B0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_MyGeometry3) == 0x0000B4, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_MyGeometry3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_PointerEvent2) == 0x0000E8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_Operation2) == 0x000160, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_PointerEvent) == 0x000168, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_Operation) == 0x0001E0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x0001E8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess5) == 0x0001F0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2) == 0x0001F8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess6) == 0x000200, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000208, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetInventoryFacade_ReturnValue) == 0x000218, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetInventoryFacade_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetEquipment_ReturnValue) == 0x000220, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue2) == 0x000228, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_EnterOtherContainer_NewOtherContainer_CastInput) == 0x000230, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_EnterOtherContainer_NewOtherContainer_CastInput' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_MakeTransform_ReturnValue) == 0x000240, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue3) == 0x000270, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_MyGeometry2) == 0x000274, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_InDeltaTime) == 0x0002A8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0002AC, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter2) == 0x0002B0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue4) == 0x0002B8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue5) == 0x0002B9, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsCharacterValid_ReturnValue) == 0x0002BA, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsCharacterValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CustomEvent_SpawnedActor) == 0x0002C0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CustomEvent_SpawnedActor' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsCharacter_Studio) == 0x0002C8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsCharacter_Studio' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess7) == 0x0002D0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_MouseEvent2) == 0x0002D8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000350, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue3) == 0x000358, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CustomEvent_Scale2) == 0x000360, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CustomEvent_Scale2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CustomEvent_Scale) == 0x000364, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000368, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue6) == 0x00036C, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00036D, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4) == 0x000370, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess8) == 0x000380, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue4) == 0x000381, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_MyGeometry) == 0x000384, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_Event_MouseEvent) == 0x0003B8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue4) == 0x000430, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue5) == 0x000438, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetMousePosition_LocationX) == 0x000440, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetMousePosition_LocationX' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetMousePosition_LocationY) == 0x000444, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetMousePosition_LocationY' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetMousePosition_ReturnValue) == 0x000448, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_MakeVector2D_ReturnValue) == 0x00044C, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetOwningPlayer_ReturnValue6) == 0x000458, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetOwningPlayer_ReturnValue6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_BreakVector2D_X) == 0x000460, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_BreakVector2D_Y) == 0x000464, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_FTrunc_ReturnValue) == 0x000468, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_FTrunc_ReturnValue2) == 0x00046C, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_FTrunc_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetDragDroppingContent_ReturnValue) == 0x000470, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetDragDroppingContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3) == 0x000478, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess9) == 0x000480, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000481, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsFocus_ReturnValue) == 0x000482, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsFocus_ReturnValue2) == 0x000483, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsFocus_ReturnValue3) == 0x000484, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsFocus_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsFocus_ReturnValue4) == 0x000485, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsFocus_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildUpWidget_UpWidget) == 0x000488, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildUpWidget_UpWidget' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue7) == 0x000490, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5) == 0x000498, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess10) == 0x0004A8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue5) == 0x0004A9, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildUpWidget_UpWidget2) == 0x0004B0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildUpWidget_UpWidget2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x0004B8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6) == 0x0004C8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess11) == 0x0004D8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue6) == 0x0004D9, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate6) == 0x0004E0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildDownWidget_DownWidget) == 0x0004F0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildDownWidget_DownWidget' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue8) == 0x0004F8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildDownWidget_DownWidget2) == 0x000500, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildDownWidget_DownWidget2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7) == 0x000508, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess12) == 0x000518, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate7) == 0x000520, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue7) == 0x000530, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue7' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildLeftWidget_LeftWidget) == 0x000538, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildLeftWidget_LeftWidget' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildLeftWidget_LeftWidget2) == 0x000540, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildLeftWidget_LeftWidget2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue9) == 0x000548, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8) == 0x000550, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_DynamicCast_bSuccess13) == 0x000560, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate8) == 0x000568, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_SetFocus_ReturnValue8) == 0x000578, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_SetFocus_ReturnValue8' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildRightWidget_RightWidget) == 0x000580, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildRightWidget_RightWidget' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetRealChildRightWidget_RightWidget2) == 0x000588, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetRealChildRightWidget_RightWidget2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue10) == 0x000590, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetUseCharacterCapture_ReturnValue2) == 0x000591, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetUseCharacterCapture_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, K2Node_CreateDelegate_OutputDelegate9) == 0x000598, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_BooleanAND_ReturnValue) == 0x0005A8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_GetTslHUD_ReturnValue) == 0x0005B0, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_GetTslHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget, CallFunc_IsValid_ReturnValue11) == 0x0005B8, "Member 'EquipmentWidget_C_ExecuteUbergraph_EquipmentWidget::CallFunc_IsValid_ReturnValue11' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct EquipmentWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(EquipmentWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on EquipmentWidget_C_OnMouseEnter");
static_assert(sizeof(EquipmentWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on EquipmentWidget_C_OnMouseEnter");
static_assert(offsetof(EquipmentWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'EquipmentWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'EquipmentWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnAddYaw
// 0x0004 (0x0004 - 0x0000)
struct EquipmentWidget_C_OnAddYaw final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_OnAddYaw) == 0x000004, "Wrong alignment on EquipmentWidget_C_OnAddYaw");
static_assert(sizeof(EquipmentWidget_C_OnAddYaw) == 0x000004, "Wrong size on EquipmentWidget_C_OnAddYaw");
static_assert(offsetof(EquipmentWidget_C_OnAddYaw, Scale) == 0x000000, "Member 'EquipmentWidget_C_OnAddYaw::Scale' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnLookUp
// 0x0004 (0x0004 - 0x0000)
struct EquipmentWidget_C_OnLookUp final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_OnLookUp) == 0x000004, "Wrong alignment on EquipmentWidget_C_OnLookUp");
static_assert(sizeof(EquipmentWidget_C_OnLookUp) == 0x000004, "Wrong size on EquipmentWidget_C_OnLookUp");
static_assert(offsetof(EquipmentWidget_C_OnLookUp, Scale) == 0x000000, "Member 'EquipmentWidget_C_OnLookUp::Scale' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct EquipmentWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(EquipmentWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on EquipmentWidget_C_OnMouseLeave");
static_assert(sizeof(EquipmentWidget_C_OnMouseLeave) == 0x000078, "Wrong size on EquipmentWidget_C_OnMouseLeave");
static_assert(offsetof(EquipmentWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'EquipmentWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnSpawnActorInSceneCaptureWorld
// 0x0008 (0x0008 - 0x0000)
struct EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld final
{
public:
	class AActor*                                 SpawnedActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld) == 0x000008, "Wrong alignment on EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld");
static_assert(sizeof(EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld) == 0x000008, "Wrong size on EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld");
static_assert(offsetof(EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld, SpawnedActor) == 0x000000, "Member 'EquipmentWidget_C_OnSpawnActorInSceneCaptureWorld::SpawnedActor' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct EquipmentWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_Tick) == 0x000004, "Wrong alignment on EquipmentWidget_C_Tick");
static_assert(sizeof(EquipmentWidget_C_Tick) == 0x000038, "Wrong size on EquipmentWidget_C_Tick");
static_assert(offsetof(EquipmentWidget_C_Tick, MyGeometry) == 0x000000, "Member 'EquipmentWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'EquipmentWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct EquipmentWidget_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_OnDragLeave) == 0x000008, "Wrong alignment on EquipmentWidget_C_OnDragLeave");
static_assert(sizeof(EquipmentWidget_C_OnDragLeave) == 0x000080, "Wrong size on EquipmentWidget_C_OnDragLeave");
static_assert(offsetof(EquipmentWidget_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'EquipmentWidget_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_OnDragLeave, Operation) == 0x000078, "Member 'EquipmentWidget_C_OnDragLeave::Operation' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct EquipmentWidget_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EquipmentWidget_C_OnDragEnter) == 0x000008, "Wrong alignment on EquipmentWidget_C_OnDragEnter");
static_assert(sizeof(EquipmentWidget_C_OnDragEnter) == 0x0000B8, "Wrong size on EquipmentWidget_C_OnDragEnter");
static_assert(offsetof(EquipmentWidget_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'EquipmentWidget_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'EquipmentWidget_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(EquipmentWidget_C_OnDragEnter, Operation) == 0x0000B0, "Member 'EquipmentWidget_C_OnDragEnter::Operation' has a wrong offset!");

// Function EquipmentWidget.EquipmentWidget_C.OnDrop
// 0x0128 (0x0128 - 0x0000)
struct EquipmentWidget_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotWidgetBaseInterface_C> K2Node_DynamicCast_AsSlot_Widget_Base_Interface;   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem;                     // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
