#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayOptionWidget_BP

#include "Basic.hpp"

#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function GameplayOptionWidget_BP.GameplayOptionWidget_BP_C.ExecuteUbergraph_GameplayOptionWidget_BP
// 0x0028 (0x0028 - 0x0000)
struct GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQualityComboBox_C*>             K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UQualityComboBox_C*>             K2Node_MakeArray_Array2;                           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP) == 0x000008, "Wrong alignment on GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP");
static_assert(sizeof(GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP) == 0x000028, "Wrong size on GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP");
static_assert(offsetof(GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP, EntryPoint) == 0x000000, "Member 'GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP, K2Node_MakeArray_Array) == 0x000008, "Member 'GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP, K2Node_MakeArray_Array2) == 0x000018, "Member 'GameplayOptionWidget_BP_C_ExecuteUbergraph_GameplayOptionWidget_BP::K2Node_MakeArray_Array2' has a wrong offset!");

// Function GameplayOptionWidget_BP.GameplayOptionWidget_BP_C.InitializeWidgets
// 0x0150 (0x0150 - 0x0000)
struct GameplayOptionWidget_BP_C_InitializeWidgets final
{
public:
	int32                                         m__int_Variable;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable2;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFunctionalityEnabled_ReturnValue;       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable3;                                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable4;                                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue3;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue4;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETslInputModes                                CallFunc_GetTslInputMode_ReturnValue;              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue2; // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue3;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue4;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue5;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue3;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDoubleTapSupported_ReturnValue;         // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable2;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable3;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable3;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable4;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable5;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable4;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETslInputModes                                m__byte_Variable;                                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_Select_Default;                             // 0x0088(0x0010)(ZeroConstructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue2;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00A0(0x0010)(ZeroConstructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable5;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item2;                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item3;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item4;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FKeyInputModeName>              CallFunc_GetKeyInputModeNames_ReturnValue;         // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FKeyInputModeName                      CallFunc_Array_Get_Item5;                          // 0x00F0(0x0020)()
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item6;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item7;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameplayOptionWidget_BP_C_InitializeWidgets) == 0x000008, "Wrong alignment on GameplayOptionWidget_BP_C_InitializeWidgets");
static_assert(sizeof(GameplayOptionWidget_BP_C_InitializeWidgets) == 0x000150, "Wrong size on GameplayOptionWidget_BP_C_InitializeWidgets");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Variable) == 0x000000, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Variable2) == 0x000004, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000011, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_IsFunctionalityEnabled_ReturnValue) == 0x000012, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_IsFunctionalityEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000013, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x000018, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Variable3) == 0x00001C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Variable3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Variable4) == 0x000020, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Variable4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_IntToByte_ReturnValue3) == 0x000024, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_IntToByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue2) == 0x000028, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetValidValue_ReturnValue2) == 0x00002C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_IntToByte_ReturnValue4) == 0x00002D, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_IntToByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetTslInputMode_ReturnValue) == 0x00002E, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetTslInputMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetEnumeratorValueFromIndex_ReturnValue2) == 0x00002F, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetEnumeratorValueFromIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_ByteToInt_ReturnValue3) == 0x000030, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_ByteToInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_ByteToInt_ReturnValue4) == 0x000034, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_ByteToInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Loop_Counter_Variable) == 0x000038, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue3) == 0x00003C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Array_Index_Variable) == 0x000040, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_MakeLiteralInt_ReturnValue) == 0x000044, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_IntToByte_ReturnValue5) == 0x000048, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_IntToByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetValidValue_ReturnValue3) == 0x00004A, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetValidValue_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_IsDoubleTapSupported_ReturnValue) == 0x00004B, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_IsDoubleTapSupported_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Loop_Counter_Variable2) == 0x00004C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Array_Index_Variable2) == 0x000050, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue4) == 0x000054, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Loop_Counter_Variable3) == 0x000058, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue5) == 0x00005C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Array_Index_Variable3) == 0x000060, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Loop_Counter_Variable4) == 0x000064, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue6) == 0x000068, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Loop_Counter_Variable5) == 0x00006C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Add_IntInt_ReturnValue7) == 0x000070, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Array_Index_Variable4) == 0x000074, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__byte_Variable) == 0x000078, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item) == 0x000080, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, K2Node_Select_Default) == 0x000088, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_MakeLiteralInt_ReturnValue2) == 0x000098, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_MakeLiteralInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_SelectString_ReturnValue) == 0x0000A0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue2) == 0x0000B0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, m__int_Array_Index_Variable5) == 0x0000B4, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::m__int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item2) == 0x0000B8, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue3) == 0x0000C4, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item3) == 0x0000C8, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Length_ReturnValue2) == 0x0000D0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue4) == 0x0000D4, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item4) == 0x0000D8, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_GetKeyInputModeNames_ReturnValue) == 0x0000E0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_GetKeyInputModeNames_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item5) == 0x0000F0, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item6) == 0x000110, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Length_ReturnValue3) == 0x000118, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00011C, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue5) == 0x00011D, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Conv_NameToString_ReturnValue) == 0x000120, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Length_ReturnValue4) == 0x000130, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue6) == 0x000134, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Length_ReturnValue5) == 0x000138, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Array_Get_Item7) == 0x000140, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_InitializeWidgets, CallFunc_Less_IntInt_ReturnValue7) == 0x000148, "Member 'GameplayOptionWidget_BP_C_InitializeWidgets::CallFunc_Less_IntInt_ReturnValue7' has a wrong offset!");

// Function GameplayOptionWidget_BP.GameplayOptionWidget_BP_C.SetToDefault
// 0x0080 (0x0080 - 0x0000)
struct GameplayOptionWidget_BP_C_SetToDefault final
{
public:
	ETslInputModes                                m__byte_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable2;                                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDefaultFunctionalityEnabled_ReturnValue; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue2;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Variable3;                                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue3;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Variable4;                                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETslInputModes                                CallFunc_GetDefaultInputModeSetting_ReturnValue;   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue3;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue4;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue2; // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue4;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0068(0x0010)(ZeroConstructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item2;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameplayOptionWidget_BP_C_SetToDefault) == 0x000008, "Wrong alignment on GameplayOptionWidget_BP_C_SetToDefault");
static_assert(sizeof(GameplayOptionWidget_BP_C_SetToDefault) == 0x000080, "Wrong size on GameplayOptionWidget_BP_C_SetToDefault");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, m__byte_Variable) == 0x000000, "Member 'GameplayOptionWidget_BP_C_SetToDefault::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_MakeLiteralInt_ReturnValue) == 0x000004, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, m__int_Variable) == 0x000008, "Member 'GameplayOptionWidget_BP_C_SetToDefault::m__int_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, m__int_Variable2) == 0x00000C, "Member 'GameplayOptionWidget_BP_C_SetToDefault::m__int_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_IntToByte_ReturnValue) == 0x000010, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_GetValidValue_ReturnValue) == 0x000018, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000019, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_IsDefaultFunctionalityEnabled_ReturnValue) == 0x00001A, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_IsDefaultFunctionalityEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00001B, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x000020, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_MakeLiteralInt_ReturnValue2) == 0x000024, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_MakeLiteralInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, m__int_Variable3) == 0x00002C, "Member 'GameplayOptionWidget_BP_C_SetToDefault::m__int_Variable3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_IntToByte_ReturnValue3) == 0x000030, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_IntToByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_GetValidValue_ReturnValue2) == 0x000031, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, m__int_Variable4) == 0x000034, "Member 'GameplayOptionWidget_BP_C_SetToDefault::m__int_Variable4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Add_IntInt_ReturnValue2) == 0x000038, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_GetDefaultInputModeSetting_ReturnValue) == 0x00003C, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_GetDefaultInputModeSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_ByteToInt_ReturnValue3) == 0x000040, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_ByteToInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_IntToByte_ReturnValue4) == 0x000044, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_IntToByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Less_IntInt_ReturnValue2) == 0x000045, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_GetEnumeratorValueFromIndex_ReturnValue2) == 0x000046, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_GetEnumeratorValueFromIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Conv_ByteToInt_ReturnValue4) == 0x000048, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Conv_ByteToInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, K2Node_Select_Default) == 0x000050, "Member 'GameplayOptionWidget_BP_C_SetToDefault::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Array_Get_Item) == 0x000060, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_SelectString_ReturnValue) == 0x000068, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_SetToDefault, CallFunc_Array_Get_Item2) == 0x000078, "Member 'GameplayOptionWidget_BP_C_SetToDefault::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function GameplayOptionWidget_BP.GameplayOptionWidget_BP_C.ApplyByCurrentSelectedSettings
// 0x0060 (0x0060 - 0x0000)
struct GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings final
{
public:
	int32                                         m__int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable2;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0030(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_GetSelectedOption_SelectedOption2;        // 0x0040(0x0010)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings) == 0x000008, "Wrong alignment on GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings");
static_assert(sizeof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings) == 0x000060, "Wrong size on GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, m__int_Array_Index_Variable) == 0x000000, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Conv_IntToByte_ReturnValue) == 0x000004, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_GetValidValue_ReturnValue) == 0x000005, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, m__int_Loop_Counter_Variable) == 0x000008, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, m__int_Array_Index_Variable2) == 0x000010, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Conv_IntToByte_ReturnValue2) == 0x000014, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_GetValidValue_ReturnValue2) == 0x000015, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, m__int_Loop_Counter_Variable2) == 0x000018, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::m__int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Add_IntInt_ReturnValue2) == 0x00001C, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Array_Get_Item) == 0x000020, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Array_Get_Item2) == 0x000028, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_GetSelectedOption_SelectedOption) == 0x000030, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_GetSelectedOption_SelectedOption2) == 0x000040, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_GetSelectedOption_SelectedOption2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000050, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, K2Node_SwitchString_CmpSuccess) == 0x000051, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings, CallFunc_Less_IntInt_ReturnValue2) == 0x00005D, "Member 'GameplayOptionWidget_BP_C_ApplyByCurrentSelectedSettings::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function GameplayOptionWidget_BP.GameplayOptionWidget_BP_C.IsChanged
// 0x0098 (0x0098 - 0x0000)
struct GameplayOptionWidget_BP_C_IsChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFunctionalityEnabled_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable2;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue2;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChanged_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue2;               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETslInputModes                                CallFunc_GetTslInputMode_ReturnValue;              // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor)
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0040(0x0010)(ZeroConstructor)
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQualityComboBox_C*                     CallFunc_Array_Get_Item2;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption2;        // 0x0070(0x0010)(ZeroConstructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETslInputModes                                CallFunc_CastTslInputModeFromName_ReturnValue;     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GameplayOptionWidget_BP_C_IsChanged) == 0x000008, "Wrong alignment on GameplayOptionWidget_BP_C_IsChanged");
static_assert(sizeof(GameplayOptionWidget_BP_C_IsChanged) == 0x000098, "Wrong size on GameplayOptionWidget_BP_C_IsChanged");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, ReturnValue) == 0x000000, "Member 'GameplayOptionWidget_BP_C_IsChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, m__int_Array_Index_Variable) == 0x000004, "Member 'GameplayOptionWidget_BP_C_IsChanged::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_GetValidValue_ReturnValue) == 0x000009, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, m__int_Loop_Counter_Variable) == 0x00000C, "Member 'GameplayOptionWidget_BP_C_IsChanged::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_IsFunctionalityEnabled_ReturnValue) == 0x000014, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_IsFunctionalityEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, m__int_Array_Index_Variable2) == 0x000018, "Member 'GameplayOptionWidget_BP_C_IsChanged::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_Conv_IntToByte_ReturnValue2) == 0x00001C, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_Conv_IntToByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_IsChanged_ReturnValue) == 0x00001D, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_IsChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_GetValidValue_ReturnValue2) == 0x00001E, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_GetValidValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_GetTslInputMode_ReturnValue) == 0x00001F, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_GetTslInputMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GameplayOptionWidget_BP_C_IsChanged, CallFunc_SelectString_ReturnValue) == 0x000020, "Member 'GameplayOptionWidget_BP_C_IsChanged::CallFunc_SelectString_ReturnValue' has a wrong offset!");
