#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GraphicOptionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseOptionWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GraphicOptionWidget.GraphicOptionWidget_C
// 0x0020 (0x0298 - 0x0278)
class UGraphicOptionWidget_C final : public UBaseOptionWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGeneralSettingWidget_C*                GeneralSettingWidget;                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualitySettingsWidget_C*               QualitySettingsWidget;                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UScreenSettingWidget_C*                 ResolutionDisplayWidget;                           // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_GraphicOptionWidget(int32 EntryPoint);
	void OnReset();
	void OnDefault();
	void OnApply();
	void Construct();

	bool IsChanged() const;
	bool IsKeyUp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GraphicOptionWidget_C">();
	}
	static class UGraphicOptionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGraphicOptionWidget_C>();
	}
};
static_assert(alignof(UGraphicOptionWidget_C) == 0x000008, "Wrong alignment on UGraphicOptionWidget_C");
static_assert(sizeof(UGraphicOptionWidget_C) == 0x000298, "Wrong size on UGraphicOptionWidget_C");
static_assert(offsetof(UGraphicOptionWidget_C, UberGraphFrame) == 0x000278, "Member 'UGraphicOptionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGraphicOptionWidget_C, GeneralSettingWidget) == 0x000280, "Member 'UGraphicOptionWidget_C::GeneralSettingWidget' has a wrong offset!");
static_assert(offsetof(UGraphicOptionWidget_C, QualitySettingsWidget) == 0x000288, "Member 'UGraphicOptionWidget_C::QualitySettingsWidget' has a wrong offset!");
static_assert(offsetof(UGraphicOptionWidget_C, ResolutionDisplayWidget) == 0x000290, "Member 'UGraphicOptionWidget_C::ResolutionDisplayWidget' has a wrong offset!");

}

