#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameMenuWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function InGameMenuWidget.InGameMenuWidget_C.ExecuteUbergraph_InGameMenuWidget
// 0x0130 (0x0130 - 0x0000)
struct InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLastInputGamepad_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue2;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD2;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD3;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate3;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue3;                      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD4;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate4;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue4;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue4;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD5;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HideWidgetByEscape_ReturnValue;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFiring_ReturnValue;                     // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargeting_ReturnValue;                  // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGamepadConnected_ReturnValue;           // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F4(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget) == 0x000008, "Wrong alignment on InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget");
static_assert(sizeof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget) == 0x000130, "Wrong size on InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, EntryPoint) == 0x000000, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsLastInputGamepad_ReturnValue) == 0x000004, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsLastInputGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000030, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetHUD_ReturnValue) == 0x000038, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetHUD_ReturnValue2) == 0x000040, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_AsTsl_HUD) == 0x000048, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_AsTsl_HUD2) == 0x000058, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_AsTsl_HUD2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_AsTsl_HUD3) == 0x000068, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_AsTsl_HUD3' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetOwningPlayer_ReturnValue3) == 0x000078, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000080, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetHUD_ReturnValue3) == 0x000090, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetHUD_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_AsTsl_HUD4) == 0x000098, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_AsTsl_HUD4' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_bSuccess4) == 0x0000A0, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x0000A8, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetOwningPlayer_ReturnValue4) == 0x0000B8, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetOwningPlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetHUD_ReturnValue4) == 0x0000C0, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetHUD_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_AsTsl_HUD5) == 0x0000C8, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_AsTsl_HUD5' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_DynamicCast_bSuccess5) == 0x0000D0, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_HideWidgetByEscape_ReturnValue) == 0x0000D1, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_HideWidgetByEscape_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsXBoxOnePlatform_NewParam) == 0x0000D2, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x0000D8, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x0000E0, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsFiring_ReturnValue) == 0x0000F1, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsFiring_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsTargeting_ReturnValue) == 0x0000F2, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_IsGamepadConnected_ReturnValue) == 0x0000F3, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_IsGamepadConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_Event_MyGeometry) == 0x0000F4, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, K2Node_Event_InDeltaTime) == 0x000128, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget, CallFunc_BooleanOR_ReturnValue) == 0x00012C, "Member 'InGameMenuWidget_C_ExecuteUbergraph_InGameMenuWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function InGameMenuWidget.InGameMenuWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct InGameMenuWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuWidget_C_Tick) == 0x000004, "Wrong alignment on InGameMenuWidget_C_Tick");
static_assert(sizeof(InGameMenuWidget_C_Tick) == 0x000038, "Wrong size on InGameMenuWidget_C_Tick");
static_assert(offsetof(InGameMenuWidget_C_Tick, MyGeometry) == 0x000000, "Member 'InGameMenuWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'InGameMenuWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function InGameMenuWidget.InGameMenuWidget_C.GoToLobby
// 0x0030 (0x0030 - 0x0000)
struct InGameMenuWidget_C_GoToLobby final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuWidget_C_GoToLobby) == 0x000008, "Wrong alignment on InGameMenuWidget_C_GoToLobby");
static_assert(sizeof(InGameMenuWidget_C_GoToLobby) == 0x000030, "Wrong size on InGameMenuWidget_C_GoToLobby");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, ButtonID) == 0x000000, "Member 'InGameMenuWidget_C_GoToLobby::ButtonID' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'InGameMenuWidget_C_GoToLobby::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'InGameMenuWidget_C_GoToLobby::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'InGameMenuWidget_C_GoToLobby::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, K2Node_DynamicCast_AsTsl_HUD) == 0x000020, "Member 'InGameMenuWidget_C_GoToLobby::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GoToLobby, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InGameMenuWidget_C_GoToLobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function InGameMenuWidget.InGameMenuWidget_C.QuitGame
// 0x0030 (0x0030 - 0x0000)
struct InGameMenuWidget_C_QuitGame final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGameMenuWidget_C_QuitGame) == 0x000008, "Wrong alignment on InGameMenuWidget_C_QuitGame");
static_assert(sizeof(InGameMenuWidget_C_QuitGame) == 0x000030, "Wrong size on InGameMenuWidget_C_QuitGame");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, ButtonID) == 0x000000, "Member 'InGameMenuWidget_C_QuitGame::ButtonID' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'InGameMenuWidget_C_QuitGame::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'InGameMenuWidget_C_QuitGame::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'InGameMenuWidget_C_QuitGame::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, K2Node_DynamicCast_AsTsl_HUD) == 0x000020, "Member 'InGameMenuWidget_C_QuitGame::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_QuitGame, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InGameMenuWidget_C_QuitGame::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function InGameMenuWidget.InGameMenuWidget_C.GetVersionText_0
// 0x0110 (0x0110 - 0x0000)
struct InGameMenuWidget_C_GetVersionText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class ATslGameState*                          CallFunc_GetTslGameState_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetGameVersion_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0090(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00A8(0x0040)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
};
static_assert(alignof(InGameMenuWidget_C_GetVersionText_0) == 0x000008, "Wrong alignment on InGameMenuWidget_C_GetVersionText_0");
static_assert(sizeof(InGameMenuWidget_C_GetVersionText_0) == 0x000110, "Wrong size on InGameMenuWidget_C_GetVersionText_0");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, ReturnValue) == 0x000000, "Member 'InGameMenuWidget_C_GetVersionText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_GetTslGameState_ReturnValue) == 0x000018, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_GetTslGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_GetGameVersion_ReturnValue) == 0x000020, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_GetGameVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'InGameMenuWidget_C_GetVersionText_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_Conv_StringToText_ReturnValue2) == 0x000090, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, K2Node_MakeStruct_FormatArgumentData2) == 0x0000A8, "Member 'InGameMenuWidget_C_GetVersionText_0::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, K2Node_MakeArray_Array) == 0x0000E8, "Member 'InGameMenuWidget_C_GetVersionText_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(InGameMenuWidget_C_GetVersionText_0, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'InGameMenuWidget_C_GetVersionText_0::CallFunc_Format_ReturnValue' has a wrong offset!");

}

