#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameMenuWidget

#include "Basic.hpp"

#include "InputHookingWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass InGameMenuWidget.InGameMenuWidget_C
// 0x0050 (0x02E0 - 0x0290)
class UInGameMenuWidget_C final : public UInputHookingWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButtonWidget_C*                        Exit;                                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonWidget_C*                        GotoLobbyButton;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_0;                                           // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_1;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        MainMenuSwitcher;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonWidget_C*                        OptionButton;                                      // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButtonWidget_C*                        Resume;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	UMulticastDelegateProperty_                   TestDispatcher;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_InGameMenuWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void CustomEvent_1();
	void CustomEvent_0();
	void OnHiddenWidget();
	void Construct();
	void BndEvt__Resume_K2Node_ComponentBoundEvent_195_OnClickedEventDispatcher__DelegateSignature();
	void BndEvt__ButtonWidget_108_K2Node_ComponentBoundEvent_96_OnClickedEventDispatcher__DelegateSignature();
	void BndEvt__GotoLobbyButton_K2Node_ComponentBoundEvent_89_OnClickedEventDispatcher__DelegateSignature();
	void BndEvt__OptionButton_K2Node_ComponentBoundEvent_107_OnClickedEventDispatcher__DelegateSignature();
	void GoToLobby(EPopupButtonID ButtonID);
	void QuitGame(EPopupButtonID ButtonID);
	class FText GetVersionText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGameMenuWidget_C">();
	}
	static class UInGameMenuWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInGameMenuWidget_C>();
	}
};
static_assert(alignof(UInGameMenuWidget_C) == 0x000008, "Wrong alignment on UInGameMenuWidget_C");
static_assert(sizeof(UInGameMenuWidget_C) == 0x0002E0, "Wrong size on UInGameMenuWidget_C");
static_assert(offsetof(UInGameMenuWidget_C, UberGraphFrame) == 0x000290, "Member 'UInGameMenuWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, Exit) == 0x000298, "Member 'UInGameMenuWidget_C::Exit' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, GotoLobbyButton) == 0x0002A0, "Member 'UInGameMenuWidget_C::GotoLobbyButton' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, Image_0) == 0x0002A8, "Member 'UInGameMenuWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, Image_1) == 0x0002B0, "Member 'UInGameMenuWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, MainMenuSwitcher) == 0x0002B8, "Member 'UInGameMenuWidget_C::MainMenuSwitcher' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, OptionButton) == 0x0002C0, "Member 'UInGameMenuWidget_C::OptionButton' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, Resume) == 0x0002C8, "Member 'UInGameMenuWidget_C::Resume' has a wrong offset!");
static_assert(offsetof(UInGameMenuWidget_C, TestDispatcher) == 0x0002D0, "Member 'UInGameMenuWidget_C::TestDispatcher' has a wrong offset!");

}

