#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function InventoryWidget.InventoryWidget_C.ExecuteUbergraph_InventoryWidget
// 0x04E8 (0x04E8 - 0x0000)
struct InventoryWidget_C_ExecuteUbergraph_InventoryWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0038(0x0010)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        K2Node_ComponentBoundEvent_Slot2;                  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> K2Node_ComponentBoundEvent_SlotContainer2;         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        K2Node_ComponentBoundEvent_Slot;                   // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> K2Node_ComponentBoundEvent_SlotContainer;          // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IDroppedItemInterface> K2Node_DynamicCast_AsDropped_Item_Interface;       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_DynamicCast_AsItem;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  CallFunc_GetDroppedItem_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UEquipableItem*                         K2Node_DynamicCast_AsEquipable_Item;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        K2Node_DynamicCast_AsAttachable_Item;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller2;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        K2Node_CustomEvent_Slot;                           // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> K2Node_CustomEvent_SlotContainer;                  // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFiring_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargeting_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x01B4(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x01E8(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0278(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputY_ReturnValue;                       // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputX_ReturnValue;                       // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputB_ReturnValue;                       // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputA_ReturnValue;                       // 0x0317(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue;       // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface; // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue;                     // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputRB_ReturnValue;                      // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputRT_ReturnValue;                      // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam2;              // 0x0336(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_337[0x1];                                      // 0x0337(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue2;      // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2; // 0x0340(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue2;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaTime;                      // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Left_ReturnValue;                         // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Right_ReturnValue;                        // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Up_ReturnValue;                           // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Down_ReturnValue;                         // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue2;       // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0398(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGamepadConnected_ReturnValue;           // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGamePadConnected_ReturnValue2;          // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x03D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerState*                        K2Node_DynamicCast_AsTsl_Player_State;             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0400(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetShortPlayerName_ReturnValue;           // 0x0410(0x0010)(ZeroConstructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0420(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0438(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult;          // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult2;         // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult3;         // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult4;         // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue;                    // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue2;                   // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isEmptyList_ReturnValue;                  // 0x0461(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor)
	const class UWidgetAnimation*                 K2Node_Select_Default;                             // 0x0478(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Select2_Default;                            // 0x0488(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue2;          // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Left_ReturnValue2;                        // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_493[0x1];                                      // 0x0493(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x0498(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Right_ReturnValue2;                       // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(TScriptInterface<class ISlotInterface> Slot, TScriptInterface<class ISlotContainerInterface> SlotContainer)> K2Node_CreateDelegate_OutputDelegate16;            // 0x04B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x04C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue3;     // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Up_ReturnValue2;                          // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate17;            // 0x04D0(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue4;     // 0x04E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Down_ReturnValue2;                        // 0x04E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget) == 0x000008, "Wrong alignment on InventoryWidget_C_ExecuteUbergraph_InventoryWidget");
static_assert(sizeof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget) == 0x0004E8, "Wrong size on InventoryWidget_C_ExecuteUbergraph_InventoryWidget");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, EntryPoint) == 0x000000, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_MakeStruct_Margin) == 0x000038, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000048, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x000058, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate6) == 0x000068, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate7) == 0x000078, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, m__bool_Variable) == 0x000088, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, m__bool_Variable2) == 0x000089, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::m__bool_Variable2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_ComponentBoundEvent_Slot2) == 0x000090, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_ComponentBoundEvent_Slot2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_ComponentBoundEvent_SlotContainer2) == 0x0000A0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_ComponentBoundEvent_SlotContainer2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_ComponentBoundEvent_Slot) == 0x0000B0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_ComponentBoundEvent_SlotContainer) == 0x0000C0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_ComponentBoundEvent_SlotContainer' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x0000D0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate8) == 0x0000D8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsDropped_Item_Interface) == 0x0000F0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsDropped_Item_Interface' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsItem) == 0x000108, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsItem' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess2) == 0x000110, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetDroppedItem_ReturnValue) == 0x000118, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetDroppedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsEquipable_Item) == 0x000120, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsEquipable_Item' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess3) == 0x000128, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsAttachable_Item) == 0x000130, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsAttachable_Item' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess4) == 0x000138, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000140, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000148, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000150, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess5) == 0x000158, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Player_Controller2) == 0x000160, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Player_Controller2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess6) == 0x000168, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CustomEvent_Slot) == 0x000170, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CustomEvent_SlotContainer) == 0x000180, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CustomEvent_SlotContainer' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000190, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsValid_ReturnValue2) == 0x000198, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate9) == 0x0001A0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsFiring_ReturnValue) == 0x0001B0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsFiring_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsTargeting_ReturnValue) == 0x0001B1, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_MyGeometry2) == 0x0001B4, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_PointerEvent2) == 0x0001E8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_Operation2) == 0x000260, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x000268, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess7) == 0x000270, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_PointerEvent) == 0x000278, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_Operation) == 0x0002F0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2) == 0x0002F8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess8) == 0x000300, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Array_Add_ReturnValue) == 0x000304, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Array_Add_ReturnValue2) == 0x000308, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Array_Add_ReturnValue3) == 0x00030C, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Array_Add_ReturnValue4) == 0x000310, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputY_ReturnValue) == 0x000314, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputY_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputX_ReturnValue) == 0x000315, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputX_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputB_ReturnValue) == 0x000316, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputB_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputA_ReturnValue) == 0x000317, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputA_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetFocusingChildWidget_ReturnValue) == 0x000318, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetFocusingChildWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface) == 0x000320, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess9) == 0x000330, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsValid_ReturnValue3) == 0x000331, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_SetFocus_ReturnValue) == 0x000332, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_SetFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputRB_ReturnValue) == 0x000333, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputRB_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_InputRT_ReturnValue) == 0x000334, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_InputRT_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsXBoxOnePlatform_NewParam) == 0x000335, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsXBoxOnePlatform_NewParam2) == 0x000336, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsXBoxOnePlatform_NewParam2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetFocusingChildWidget_ReturnValue2) == 0x000338, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetFocusingChildWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2) == 0x000340, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess10) == 0x000350, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_SetFocus_ReturnValue2) == 0x000351, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_SetFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CustomEvent_DeltaTime) == 0x000354, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CustomEvent_DeltaTime' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Left_ReturnValue) == 0x000358, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Right_ReturnValue) == 0x000359, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Right_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Up_ReturnValue) == 0x00035A, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Down_ReturnValue) == 0x00035B, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Down_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate10) == 0x000360, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetViewportSize_ReturnValue) == 0x000370, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_BreakVector2D_X) == 0x000378, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_BreakVector2D_Y) == 0x00037C, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000380, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000384, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_SafeDivide_FloatFloat_ReturnValue2) == 0x000388, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_SafeDivide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00038C, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000390, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000394, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_MyGeometry) == 0x000398, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Event_InDeltaTime) == 0x0003CC, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsGamepadConnected_ReturnValue) == 0x0003D0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsGamepadConnected_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsGamePadConnected_ReturnValue2) == 0x0003D1, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsGamePadConnected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_BooleanOR_ReturnValue) == 0x0003D2, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_BooleanOR_ReturnValue2) == 0x0003D3, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate11) == 0x0003D8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetOwningPlayer_ReturnValue3) == 0x0003E8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_AsTsl_Player_State) == 0x0003F0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_AsTsl_Player_State' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_DynamicCast_bSuccess11) == 0x0003F8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate12) == 0x000400, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetShortPlayerName_ReturnValue) == 0x000410, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetShortPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Conv_StringToText_ReturnValue) == 0x000420, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate13) == 0x000438, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsFocus_ReturnValue) == 0x000448, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsSelfAttachmentPutMode_bResult) == 0x000449, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsSelfAttachmentPutMode_bResult' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsSelfAttachmentPutMode_bResult2) == 0x00044A, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsSelfAttachmentPutMode_bResult2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsSelfAttachmentPutMode_bResult3) == 0x00044B, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsSelfAttachmentPutMode_bResult3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsSelfAttachmentPutMode_bResult4) == 0x00044C, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsSelfAttachmentPutMode_bResult4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetTslHUD_ReturnValue) == 0x000450, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetTslHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GetTslHUD_ReturnValue2) == 0x000458, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GetTslHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsValid_ReturnValue4) == 0x000460, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_isEmptyList_ReturnValue) == 0x000461, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_isEmptyList_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate14) == 0x000468, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Select_Default) == 0x000478, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000480, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_Select2_Default) == 0x000488, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000490, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_IsAnimationPlaying_ReturnValue2) == 0x000491, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_IsAnimationPlaying_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Left_ReturnValue2) == 0x000492, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Left_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000494, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate15) == 0x000498, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0004A8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Right_ReturnValue2) == 0x0004A9, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Right_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0004AC, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate16) == 0x0004B0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x0004C0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Add_FloatFloat_ReturnValue3) == 0x0004C4, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue3) == 0x0004C8, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Up_ReturnValue2) == 0x0004C9, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Up_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, K2Node_CreateDelegate_OutputDelegate17) == 0x0004D0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Add_FloatFloat_ReturnValue4) == 0x0004E0, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue4) == 0x0004E4, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_ExecuteUbergraph_InventoryWidget, CallFunc_Down_ReturnValue2) == 0x0004E5, "Member 'InventoryWidget_C_ExecuteUbergraph_InventoryWidget::CallFunc_Down_ReturnValue2' has a wrong offset!");

// Function InventoryWidget.InventoryWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct InventoryWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryWidget_C_Tick) == 0x000004, "Wrong alignment on InventoryWidget_C_Tick");
static_assert(sizeof(InventoryWidget_C_Tick) == 0x000038, "Wrong size on InventoryWidget_C_Tick");
static_assert(offsetof(InventoryWidget_C_Tick, MyGeometry) == 0x000000, "Member 'InventoryWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'InventoryWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function InventoryWidget.InventoryWidget_C.MoveTick
// 0x0004 (0x0004 - 0x0000)
struct InventoryWidget_C_MoveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryWidget_C_MoveTick) == 0x000004, "Wrong alignment on InventoryWidget_C_MoveTick");
static_assert(sizeof(InventoryWidget_C_MoveTick) == 0x000004, "Wrong size on InventoryWidget_C_MoveTick");
static_assert(offsetof(InventoryWidget_C_MoveTick, DeltaTime) == 0x000000, "Member 'InventoryWidget_C_MoveTick::DeltaTime' has a wrong offset!");

// Function InventoryWidget.InventoryWidget_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct InventoryWidget_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryWidget_C_OnDragLeave) == 0x000008, "Wrong alignment on InventoryWidget_C_OnDragLeave");
static_assert(sizeof(InventoryWidget_C_OnDragLeave) == 0x000080, "Wrong size on InventoryWidget_C_OnDragLeave");
static_assert(offsetof(InventoryWidget_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'InventoryWidget_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(InventoryWidget_C_OnDragLeave, Operation) == 0x000078, "Member 'InventoryWidget_C_OnDragLeave::Operation' has a wrong offset!");

// Function InventoryWidget.InventoryWidget_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct InventoryWidget_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
