#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventoryListBaseWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.ExecuteUbergraph_InventoryListBaseWidget
// 0x0380 (0x0380 - 0x0000)
struct InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         m__int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class ISlotInterface>        K2Node_CustomEvent_Slot;                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> K2Node_CustomEvent_SlotContainer;                  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x0050(0x0034)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x0088(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0108(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventory*                             K2Node_DynamicCast_AsInventory;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANearbyInteractiveItemExplorer*         K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventory*                             K2Node_DynamicCast_AsInventory2;                   // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANearbyInteractiveItemExplorer*         K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer2; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemSlotWidget_C*                      CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01F4(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_Array_Get_Item2;                          // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackageItem_ReturnValue;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADeathDropItemPackage_C*                K2Node_DynamicCast_AsDeath_Drop_Item_Package;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCategory_Category;                     // 0x0278(0x0018)()
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemSlotWidget_C*                      CallFunc_GetSlotItem_ItemSlotWidget;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue2;              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable;                                   // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x02BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BF[0x1];                                      // 0x02BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x02C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x02D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x02F0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue;                     // 0x031A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31B[0x1];                                      // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Scale;                          // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable2;                      // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemSlotWidget_C*                      CallFunc_Array_Get_Item3;                          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TScriptInterface<class ISlotInterface> Slot, TScriptInterface<class ISlotContainerInterface> SlotContainer)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0338(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFocusable_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x2];                                      // 0x034A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScrollAccelation_ReturnValue;          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Down_ReturnValue;                         // 0x035C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Up_ReturnValue;                           // 0x035D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35E[0x2];                                      // 0x035E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScrollAccelation_ReturnValue2;         // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue2;     // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Up_ReturnValue2;                          // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Down_ReturnValue2;                        // 0x0376(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x0377(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Up_ReturnValue3;                          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Down_ReturnValue3;                        // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue2;                     // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult2;         // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x037C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x037D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x037E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget) == 0x000008, "Wrong alignment on InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget");
static_assert(sizeof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget) == 0x000380, "Wrong size on InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, EntryPoint) == 0x000000, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsSelfAttachmentPutMode_bResult) == 0x000004, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsSelfAttachmentPutMode_bResult' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__bool_Variable) == 0x000005, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Not_PreBool_ReturnValue2) == 0x000007, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__int_Array_Index_Variable) == 0x000018, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CustomEvent_Slot) == 0x000030, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CustomEvent_SlotContainer) == 0x000040, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CustomEvent_SlotContainer' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_MyGeometry2) == 0x000050, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_PointerEvent2) == 0x000088, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_Operation2) == 0x000100, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_PointerEvent) == 0x000108, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_Operation) == 0x000180, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x000188, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2) == 0x000198, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess2) == 0x0001A0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsInventory) == 0x0001A8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsInventory' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess3) == 0x0001B0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer) == 0x0001B8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess4) == 0x0001C0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsInventory2) == 0x0001C8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsInventory2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess5) == 0x0001D0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer2) == 0x0001D8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsNearby_Interactive_Item_Explorer2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess6) == 0x0001E0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_MyGeometry) == 0x0001F4, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_Event_InDeltaTime) == 0x000228, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Length_ReturnValue2) == 0x00022C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Length_ReturnValue3) == 0x000230, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000234, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000238, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Length_ReturnValue4) == 0x00023C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000240, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Get_Item2) == 0x000248, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000258, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsPackageItem_ReturnValue) == 0x000260, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsPackageItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_AsDeath_Drop_Item_Package) == 0x000268, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_AsDeath_Drop_Item_Package' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_DynamicCast_bSuccess7) == 0x000270, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetCategory_Category) == 0x000278, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetCategory_Category' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetObjectClass_ReturnValue) == 0x000290, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_ClassIsChildOf_ReturnValue) == 0x000298, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetSlotItem_ItemSlotWidget) == 0x0002A0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetSlotItem_ItemSlotWidget' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_ClassIsChildOf_ReturnValue2) == 0x0002A8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_ClassIsChildOf_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0002AC, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__int_Loop_Counter_Variable) == 0x0002B0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__int_Variable) == 0x0002B4, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue2) == 0x0002B8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002BC, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanAND_ReturnValue) == 0x0002BD, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Less_IntInt_ReturnValue2) == 0x0002BE, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue3) == 0x0002C0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x0002C8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x0002D8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue4) == 0x0002E8, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x0002F0, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue5) == 0x000300, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue6) == 0x000304, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000308, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue7) == 0x00030C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000310, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Add_ReturnValue) == 0x000314, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanAND_ReturnValue2) == 0x000318, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsXBoxOnePlatform_NewParam) == 0x000319, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_SetFocus_ReturnValue) == 0x00031A, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_SetFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CustomEvent_Scale) == 0x00031C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CustomEvent_Scale' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__int_Array_Index_Variable2) == 0x000320, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000324, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Array_Get_Item3) == 0x000328, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000330, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, K2Node_CreateDelegate_OutputDelegate6) == 0x000338, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsFocusable_ReturnValue) == 0x000348, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsFocusable_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanAND_ReturnValue3) == 0x000349, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, m__int_Loop_Counter_Variable2) == 0x00034C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::m__int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetScrollAccelation_ReturnValue) == 0x000350, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetScrollAccelation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Less_IntInt_ReturnValue3) == 0x000354, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_IntInt_ReturnValue8) == 0x000358, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Down_ReturnValue) == 0x00035C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Down_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Up_ReturnValue) == 0x00035D, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000360, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanOR_ReturnValue) == 0x000364, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetTimeSeconds_ReturnValue) == 0x000368, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GetScrollAccelation_ReturnValue2) == 0x00036C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GetScrollAccelation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000370, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue2) == 0x000374, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Up_ReturnValue2) == 0x000375, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Up_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Down_ReturnValue2) == 0x000376, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Down_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsFocus_ReturnValue) == 0x000377, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Up_ReturnValue3) == 0x000378, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Up_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Down_ReturnValue3) == 0x000379, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Down_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsFocus_ReturnValue2) == 0x00037A, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_IsSelfAttachmentPutMode_bResult2) == 0x00037B, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_IsSelfAttachmentPutMode_bResult2' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanAND_ReturnValue4) == 0x00037C, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_Not_PreBool_ReturnValue3) == 0x00037D, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget, CallFunc_BooleanAND_ReturnValue5) == 0x00037E, "Member 'InventoryListBaseWidget_C_ExecuteUbergraph_InventoryListBaseWidget::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.OnAddScroll
// 0x0004 (0x0004 - 0x0000)
struct InventoryListBaseWidget_C_OnAddScroll final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_OnAddScroll) == 0x000004, "Wrong alignment on InventoryListBaseWidget_C_OnAddScroll");
static_assert(sizeof(InventoryListBaseWidget_C_OnAddScroll) == 0x000004, "Wrong size on InventoryListBaseWidget_C_OnAddScroll");
static_assert(offsetof(InventoryListBaseWidget_C_OnAddScroll, Scale) == 0x000000, "Member 'InventoryListBaseWidget_C_OnAddScroll::Scale' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct InventoryListBaseWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_Tick) == 0x000004, "Wrong alignment on InventoryListBaseWidget_C_Tick");
static_assert(sizeof(InventoryListBaseWidget_C_Tick) == 0x000038, "Wrong size on InventoryListBaseWidget_C_Tick");
static_assert(offsetof(InventoryListBaseWidget_C_Tick, MyGeometry) == 0x000000, "Member 'InventoryListBaseWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'InventoryListBaseWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct InventoryListBaseWidget_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_OnDragLeave) == 0x000008, "Wrong alignment on InventoryListBaseWidget_C_OnDragLeave");
static_assert(sizeof(InventoryListBaseWidget_C_OnDragLeave) == 0x000080, "Wrong size on InventoryListBaseWidget_C_OnDragLeave");
static_assert(offsetof(InventoryListBaseWidget_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'InventoryListBaseWidget_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_OnDragLeave, Operation) == 0x000078, "Member 'InventoryListBaseWidget_C_OnDragLeave::Operation' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct InventoryListBaseWidget_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_OnDragEnter) == 0x000008, "Wrong alignment on InventoryListBaseWidget_C_OnDragEnter");
static_assert(sizeof(InventoryListBaseWidget_C_OnDragEnter) == 0x0000B8, "Wrong size on InventoryListBaseWidget_C_OnDragEnter");
static_assert(offsetof(InventoryListBaseWidget_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'InventoryListBaseWidget_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'InventoryListBaseWidget_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_OnDragEnter, Operation) == 0x0000B0, "Member 'InventoryListBaseWidget_C_OnDragEnter::Operation' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.OnSlotFocus
// 0x0020 (0x0020 - 0x0000)
struct InventoryListBaseWidget_C_OnSlotFocus final
{
public:
	TScriptInterface<class ISlotInterface>        Slot_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> SlotContainer;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_OnSlotFocus) == 0x000008, "Wrong alignment on InventoryListBaseWidget_C_OnSlotFocus");
static_assert(sizeof(InventoryListBaseWidget_C_OnSlotFocus) == 0x000020, "Wrong size on InventoryListBaseWidget_C_OnSlotFocus");
static_assert(offsetof(InventoryListBaseWidget_C_OnSlotFocus, Slot_0) == 0x000000, "Member 'InventoryListBaseWidget_C_OnSlotFocus::Slot_0' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_OnSlotFocus, SlotContainer) == 0x000010, "Member 'InventoryListBaseWidget_C_OnSlotFocus::SlotContainer' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.CreateBackgroundSlots
// 0x0038 (0x0038 - 0x0000)
struct InventoryListBaseWidget_C_CreateBackgroundSlots final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemSlotWidget_C*                      CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable;                                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InventoryListBaseWidget_C_CreateBackgroundSlots) == 0x000008, "Wrong alignment on InventoryListBaseWidget_C_CreateBackgroundSlots");
static_assert(sizeof(InventoryListBaseWidget_C_CreateBackgroundSlots) == 0x000038, "Wrong size on InventoryListBaseWidget_C_CreateBackgroundSlots");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Create_ReturnValue) == 0x000018, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, m__int_Variable) == 0x000024, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::m__int_Variable' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_Max_ReturnValue) == 0x000030, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventoryListBaseWidget_C_CreateBackgroundSlots, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'InventoryListBaseWidget_C_CreateBackgroundSlots::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function InventoryListBaseWidget.InventoryListBaseWidget_C.RefreshList
// 0x0088 (0x0088 - 0x0000)
struct InventoryListBaseWidget_C_RefreshList final
{
public:
	class UObject*                                m__object_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> K2Node_DynamicCast_AsSlot_Container_Interface;     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TScriptInterface<class ISlotInterface>> CallFunc_GetAllSlots_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<TScriptInterface<class ISlotInterface>> m__interface_Variable;                             // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
