#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemSlotWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ItemSlotWidget.ItemSlotWidget_C.ExecuteUbergraph_ItemSlotWidget
// 0x0418 (0x0418 - 0x0000)
struct ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStackCount_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStackable_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x0070(0x0034)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x00A8(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0120(0x0078)(ConstParm)
	TScriptInterface<class ISlotInterface>        K2Node_ComponentBoundEvent_Slot;                   // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotWidgetBaseInterface_C> K2Node_DynamicCast_AsSlot_Widget_Base_Interface;   // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer;           // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem2;                    // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue2;      // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputA_ReturnValue;                       // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x1];                                      // 0x01F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue2;              // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputA_ReturnValue2;                      // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue2;                     // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputB_ReturnValue;                       // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_207[0x1];                                      // 0x0207(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventory*                             K2Node_DynamicCast_AsInventory;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue3;                     // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue3;              // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue4;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue4;              // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0220(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue5;              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue;                    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPopupButtonID                                K2Node_CustomEvent_ButtonID;                       // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer2;          // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem3;                    // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue3;      // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANearbyInteractiveItemExplorer*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x02C8(0x0010)(ZeroConstructor, ReferenceParm)
	class ANearbyInteractiveItemExplorer*         CallFunc_Array_Get_Item;                           // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_NotifyDropSlotOnOtherContainer_OtherContainer_CastInput; // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer3;          // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer4;          // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AInventory*                             K2Node_DynamicCast_AsInventory2;                   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventory*                             K2Node_DynamicCast_AsInventory3;                   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer5;          // 0x0338(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AInventory*                             K2Node_DynamicCast_AsInventory4;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x3];                                      // 0x0351(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue6;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget;       // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartSelfAttachmentPut_bResult;           // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem4;                    // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAttachableItem*                        K2Node_DynamicCast_AsAttachable_Item;              // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult;          // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult2;         // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38B[0x5];                                      // 0x038B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget2;      // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03A8(0x0008)()
	bool                                          CallFunc_IsFocus_ReturnValue5;                     // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult3;         // 0x03B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B2[0x6];                                      // 0x03B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget3;      // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue2;                   // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UItemToolTipWidget_Bp_C*                K2Node_DynamicCast_AsItem_Tool_Tip_Widget_Bp;      // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputB_ReturnValue2;                      // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventory*                             K2Node_DynamicCast_AsInventory5;                   // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget) == 0x000008, "Wrong alignment on ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget");
static_assert(sizeof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget) == 0x000418, "Wrong size on ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, EntryPoint) == 0x000000, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotItem_SlotItem) == 0x000008, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotItem_SlotItem' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000018, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetStackCount_ReturnValue) == 0x000034, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsStackable_ReturnValue) == 0x000038, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsStackable_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000039, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000050, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000060, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_Event_MyGeometry2) == 0x000070, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_Event_MouseEvent2) == 0x0000A8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_Event_MouseEvent) == 0x000120, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_ComponentBoundEvent_Slot) == 0x000198, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsSlot_Widget_Base_Interface) == 0x0001A8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsSlot_Widget_Base_Interface' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001C0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotContainer_SlotContainer) == 0x0001C8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotContainer_SlotContainer' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotItem_SlotItem2) == 0x0001D8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotItem_SlotItem2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Conv_InterfaceToObject_ReturnValue2) == 0x0001E8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Conv_InterfaceToObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsValid_ReturnValue2) == 0x0001F0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_InputA_ReturnValue) == 0x0001F1, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_InputA_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsFocus_ReturnValue) == 0x0001F2, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue) == 0x0001F4, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue2) == 0x0001F8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_InputA_ReturnValue2) == 0x0001FC, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_InputA_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000200, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000204, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsFocus_ReturnValue2) == 0x000205, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_InputB_ReturnValue) == 0x000206, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_InputB_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsInventory) == 0x000208, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsInventory' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess2) == 0x000210, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsFocus_ReturnValue3) == 0x000211, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsFocus_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue3) == 0x000214, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsFocus_ReturnValue4) == 0x000218, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsFocus_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue4) == 0x00021C, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_Event_MyGeometry) == 0x000220, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_Event_InDeltaTime) == 0x000254, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000258, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x00025C, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue5) == 0x000260, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x000264, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTslHUD_ReturnValue) == 0x000268, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTslHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000270, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsValid_ReturnValue3) == 0x000271, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CustomEvent_ButtonID) == 0x000272, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CustomEvent_ButtonID' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x000278, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotContainer_SlotContainer2) == 0x000288, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotContainer_SlotContainer2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotItem_SlotItem3) == 0x000298, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotItem_SlotItem3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Conv_InterfaceToObject_ReturnValue3) == 0x0002A8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Conv_InterfaceToObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate6) == 0x0002B0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsValid_ReturnValue4) == 0x0002C0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetAllActorsOfClass_OutActors) == 0x0002C8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Array_Get_Item) == 0x0002D8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_NotifyDropSlotOnOtherContainer_OtherContainer_CastInput) == 0x0002E0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_NotifyDropSlotOnOtherContainer_OtherContainer_CastInput' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0002F0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotContainer_SlotContainer3) == 0x0002F8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotContainer_SlotContainer3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotContainer_SlotContainer4) == 0x000308, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotContainer_SlotContainer4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsInventory2) == 0x000318, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsInventory2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess3) == 0x000320, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsInventory3) == 0x000328, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsInventory3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess4) == 0x000330, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotContainer_SlotContainer5) == 0x000338, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotContainer_SlotContainer5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsInventory4) == 0x000348, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsInventory4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess5) == 0x000350, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTimeSeconds_ReturnValue6) == 0x000354, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTimeSeconds_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue4) == 0x000358, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetInventoryWidget_InventoryWidget) == 0x000360, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetInventoryWidget_InventoryWidget' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000368, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_StartSelfAttachmentPut_bResult) == 0x000369, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_StartSelfAttachmentPut_bResult' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetSlotItem_SlotItem4) == 0x000370, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetSlotItem_SlotItem4' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsAttachable_Item) == 0x000380, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsAttachable_Item' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess6) == 0x000388, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsSelfAttachmentPutMode_bResult) == 0x000389, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsSelfAttachmentPutMode_bResult' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsSelfAttachmentPutMode_bResult2) == 0x00038A, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsSelfAttachmentPutMode_bResult2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_CreateDelegate_OutputDelegate7) == 0x000390, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetInventoryWidget_InventoryWidget2) == 0x0003A0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetInventoryWidget_InventoryWidget2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003A8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsFocus_ReturnValue5) == 0x0003B0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsFocus_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsSelfAttachmentPutMode_bResult3) == 0x0003B1, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsSelfAttachmentPutMode_bResult3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetInventoryWidget_InventoryWidget3) == 0x0003B8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetInventoryWidget_InventoryWidget3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetTslHUD_ReturnValue2) == 0x0003C0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetTslHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0003C8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_IsValid_ReturnValue5) == 0x0003D0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetHUD_ReturnValue) == 0x0003D8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsTsl_HUD) == 0x0003E0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess7) == 0x0003E8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_GetWidget_ReturnValue) == 0x0003F0, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsItem_Tool_Tip_Widget_Bp) == 0x0003F8, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsItem_Tool_Tip_Widget_Bp' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess8) == 0x000400, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, CallFunc_InputB_ReturnValue2) == 0x000401, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::CallFunc_InputB_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_AsInventory5) == 0x000408, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_AsInventory5' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget, K2Node_DynamicCast_bSuccess9) == 0x000410, "Member 'ItemSlotWidget_C_ExecuteUbergraph_ItemSlotWidget::K2Node_DynamicCast_bSuccess9' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.OnButtonClicked
// 0x0001 (0x0001 - 0x0000)
struct ItemSlotWidget_C_OnButtonClicked final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemSlotWidget_C_OnButtonClicked) == 0x000001, "Wrong alignment on ItemSlotWidget_C_OnButtonClicked");
static_assert(sizeof(ItemSlotWidget_C_OnButtonClicked) == 0x000001, "Wrong size on ItemSlotWidget_C_OnButtonClicked");
static_assert(offsetof(ItemSlotWidget_C_OnButtonClicked, ButtonID) == 0x000000, "Member 'ItemSlotWidget_C_OnButtonClicked::ButtonID' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct ItemSlotWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemSlotWidget_C_Tick) == 0x000004, "Wrong alignment on ItemSlotWidget_C_Tick");
static_assert(sizeof(ItemSlotWidget_C_Tick) == 0x000038, "Wrong size on ItemSlotWidget_C_Tick");
static_assert(offsetof(ItemSlotWidget_C_Tick, MyGeometry) == 0x000000, "Member 'ItemSlotWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'ItemSlotWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature final
{
public:
	TScriptInterface<class ISlotInterface>        Slot_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature) == 0x000008, "Wrong alignment on ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature");
static_assert(sizeof(ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature) == 0x000010, "Wrong size on ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature");
static_assert(offsetof(ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature, Slot_0) == 0x000000, "Member 'ItemSlotWidget_C_BndEvt__InnerItemSlotListWidget_K2Node_ComponentBoundEvent_0_OnChildSlotFocus__DelegateSignature::Slot_0' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct ItemSlotWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ItemSlotWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on ItemSlotWidget_C_OnMouseLeave");
static_assert(sizeof(ItemSlotWidget_C_OnMouseLeave) == 0x000078, "Wrong size on ItemSlotWidget_C_OnMouseLeave");
static_assert(offsetof(ItemSlotWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ItemSlotWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct ItemSlotWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ItemSlotWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on ItemSlotWidget_C_OnMouseEnter");
static_assert(sizeof(ItemSlotWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on ItemSlotWidget_C_OnMouseEnter");
static_assert(offsetof(ItemSlotWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ItemSlotWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ItemSlotWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function ItemSlotWidget.ItemSlotWidget_C.GetUseButtonVisibility
// 0x01A8 (0x01A8 - 0x0000)
struct ItemSlotWidget_C_GetUseButtonVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FName                                   m__name_Variable;                                  // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FName                                   m__name_Variable2;                                 // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FName                                   m__name_Variable3;                                 // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue3;              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   m__text_Variable;                                  // 0x0028(0x0018)()
	bool                                          m__bool_Variable2;                                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   m__text_Variable2;                                 // 0x0048(0x0018)()
	class UEquipableItem*                         K2Node_DynamicCast_AsEquipable_Item;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0070(0x0018)()
	bool                                          m__bool_Variable3;                                 // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         CallFunc_FindEquipPosition_ReturnValue;            // 0x00B0(0x0008)()
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x00C8(0x0018)()
	bool                                          CallFunc_IsUsableItemSlot_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachableItemSlot_return_node;         // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isPickupableDropItemSlot_return_value;    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachment_ReturnValue;                 // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IDroppedItemInterface> K2Node_DynamicCast_AsDropped_Item_Interface;       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_DynamicCast_AsItem;                         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  CallFunc_GetDroppedItem_ReturnValue;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipable_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue2;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue3;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FName>                           CallFunc_GetAvailableSlotActions_ReturnValue;      // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PickUpText;                                        // 0x0158(0x0018)(Edit)
	bool                                          bIsAttachment;                                     // 0x0170(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsEquipment;                                      // 0x0171(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDroppedItem;                                    // 0x0172(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x5];                                      // 0x0173(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  RefSlotItem;                                       // 0x0178(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FName>                           AvailableSlotActions;                              // 0x0180(0x0010)(Edit, ZeroConstructor)
	class FText                                   InteractionText;                                   // 0x0190(0x0018)(Edit)
};
static_assert(alignof(ItemSlotWidget_C_GetUseButtonVisibility) == 0x000008, "Wrong alignment on ItemSlotWidget_C_GetUseButtonVisibility");
static_assert(sizeof(ItemSlotWidget_C_GetUseButtonVisibility) == 0x0001A8, "Wrong size on ItemSlotWidget_C_GetUseButtonVisibility");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, ReturnValue) == 0x000000, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, m__name_Variable) == 0x000008, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::m__name_Variable' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, m__name_Variable2) == 0x000010, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::m__name_Variable2' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, m__name_Variable3) == 0x000018, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::m__name_Variable3' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, CallFunc_Array_Contains_ReturnValue) == 0x000020, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemSlotWidget_C_GetUseButtonVisibility, CallFunc_Array_Contains_ReturnValue2) == 0x000021, "Member 'ItemSlotWidget_C_GetUseButtonVisibility::CallFunc_Array_Contains_ReturnValue2' has a wrong offset!");
