#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyReceiverWidget_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KeyReceiverWidget_BP.KeyReceiverWidget_BP_C.GetBorderColorAndOpacity
// 0x0014 (0x0014 - 0x0000)
struct KeyReceiverWidget_BP_C_GetBorderColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKeyValid_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity) == 0x000004, "Wrong alignment on KeyReceiverWidget_BP_C_GetBorderColorAndOpacity");
static_assert(sizeof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity) == 0x000014, "Wrong size on KeyReceiverWidget_BP_C_GetBorderColorAndOpacity");
static_assert(offsetof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity, ReturnValue) == 0x000000, "Member 'KeyReceiverWidget_BP_C_GetBorderColorAndOpacity::ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'KeyReceiverWidget_BP_C_GetBorderColorAndOpacity::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity, CallFunc_IsKeyValid_ReturnValue) == 0x000011, "Member 'KeyReceiverWidget_BP_C_GetBorderColorAndOpacity::CallFunc_IsKeyValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyReceiverWidget_BP_C_GetBorderColorAndOpacity, CallFunc_BooleanAND_ReturnValue2) == 0x000012, "Member 'KeyReceiverWidget_BP_C_GetBorderColorAndOpacity::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

}

