#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickPopupWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function KickPopupWidget.KickPopupWidget_C.ExecuteUbergraph_KickPopupWidget
// 0x0048 (0x0048 - 0x0000)
struct KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPopupStyle                                   K2Node_Event_PopupStyle;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0020(0x0018)(ConstParm)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_Event_PressedDelegate;                      // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
};
static_assert(alignof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget) == 0x000008, "Wrong alignment on KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget");
static_assert(sizeof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget) == 0x000048, "Wrong size on KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget");
static_assert(offsetof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget, EntryPoint) == 0x000000, "Member 'KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget, K2Node_Event_PopupStyle) == 0x000018, "Member 'KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget::K2Node_Event_PopupStyle' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget, K2Node_Event_Message) == 0x000020, "Member 'KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget, K2Node_Event_PressedDelegate) == 0x000038, "Member 'KickPopupWidget_C_ExecuteUbergraph_KickPopupWidget::K2Node_Event_PressedDelegate' has a wrong offset!");

// Function KickPopupWidget.KickPopupWidget_C.SetPopup
// 0x0030 (0x0030 - 0x0000)
struct KickPopupWidget_C_SetPopup final
{
public:
	EPopupStyle                                   PopupStyle;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm)
	TDelegate<void(EPopupButtonID ButtonID)>      PressedDelegate;                                   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
};
static_assert(alignof(KickPopupWidget_C_SetPopup) == 0x000008, "Wrong alignment on KickPopupWidget_C_SetPopup");
static_assert(sizeof(KickPopupWidget_C_SetPopup) == 0x000030, "Wrong size on KickPopupWidget_C_SetPopup");
static_assert(offsetof(KickPopupWidget_C_SetPopup, PopupStyle) == 0x000000, "Member 'KickPopupWidget_C_SetPopup::PopupStyle' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_SetPopup, Message) == 0x000008, "Member 'KickPopupWidget_C_SetPopup::Message' has a wrong offset!");
static_assert(offsetof(KickPopupWidget_C_SetPopup, PressedDelegate) == 0x000020, "Member 'KickPopupWidget_C_SetPopup::PressedDelegate' has a wrong offset!");

}

