#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KickPopupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "TslGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KickPopupWidget.KickPopupWidget_C
// 0x0040 (0x0280 - 0x0240)
class UKickPopupWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CloseButton;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             KickQuestion;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                NoButton;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                OuterPopup;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                YesButton;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	UMulticastDelegateProperty_                   ButttonClick;                                      // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_KickPopupWidget(int32 EntryPoint);
	void Custom_Event_0();
	void Destruct();
	void Construct();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__NoButton_K2Node_ComponentBoundEvent_30_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__YesButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void SetPopup(EPopupStyle PopupStyle, const class FText& Message, const TDelegate<void(EPopupButtonID ButtonID)>& PressedDelegate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KickPopupWidget_C">();
	}
	static class UKickPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKickPopupWidget_C>();
	}
};
static_assert(alignof(UKickPopupWidget_C) == 0x000008, "Wrong alignment on UKickPopupWidget_C");
static_assert(sizeof(UKickPopupWidget_C) == 0x000280, "Wrong size on UKickPopupWidget_C");
static_assert(offsetof(UKickPopupWidget_C, UberGraphFrame) == 0x000240, "Member 'UKickPopupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, CloseButton) == 0x000248, "Member 'UKickPopupWidget_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, KickQuestion) == 0x000250, "Member 'UKickPopupWidget_C::KickQuestion' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, NoButton) == 0x000258, "Member 'UKickPopupWidget_C::NoButton' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, OuterPopup) == 0x000260, "Member 'UKickPopupWidget_C::OuterPopup' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, YesButton) == 0x000268, "Member 'UKickPopupWidget_C::YesButton' has a wrong offset!");
static_assert(offsetof(UKickPopupWidget_C, ButttonClick) == 0x000270, "Member 'UKickPopupWidget_C::ButttonClick' has a wrong offset!");

}

