#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillCountWidget

#include "Basic.hpp"

#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KillCountWidget.KillCountWidget_C
// 0x0030 (0x0338 - 0x0308)
class UKillCountWidget_C final : public UKillCountBaseWidget
{
public:
	class UWidgetAnimation*                       KillCountVanishing;                                // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       KillCountEmerging;                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Warning;                                           // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Increasing;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Decreasing;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Default;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillCountWidget_C">();
	}
	static class UKillCountWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillCountWidget_C>();
	}
};
static_assert(alignof(UKillCountWidget_C) == 0x000008, "Wrong alignment on UKillCountWidget_C");
static_assert(sizeof(UKillCountWidget_C) == 0x000338, "Wrong size on UKillCountWidget_C");
static_assert(offsetof(UKillCountWidget_C, KillCountVanishing) == 0x000308, "Member 'UKillCountWidget_C::KillCountVanishing' has a wrong offset!");
static_assert(offsetof(UKillCountWidget_C, KillCountEmerging) == 0x000310, "Member 'UKillCountWidget_C::KillCountEmerging' has a wrong offset!");
static_assert(offsetof(UKillCountWidget_C, Warning) == 0x000318, "Member 'UKillCountWidget_C::Warning' has a wrong offset!");
static_assert(offsetof(UKillCountWidget_C, Increasing) == 0x000320, "Member 'UKillCountWidget_C::Increasing' has a wrong offset!");
static_assert(offsetof(UKillCountWidget_C, Decreasing) == 0x000328, "Member 'UKillCountWidget_C::Decreasing' has a wrong offset!");
static_assert(offsetof(UKillCountWidget_C, Default) == 0x000330, "Member 'UKillCountWidget_C::Default' has a wrong offset!");

}

