#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillMessageWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KillMessageWidget.KillMessageWidget_C.ExecuteUbergraph_KillMessageWidget
// 0x0004 (0x0004 - 0x0000)
struct KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget) == 0x000004, "Wrong alignment on KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget");
static_assert(sizeof(KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget) == 0x000004, "Wrong size on KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget");
static_assert(offsetof(KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget, EntryPoint) == 0x000000, "Member 'KillMessageWidget_C_ExecuteUbergraph_KillMessageWidget::EntryPoint' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.IsKillerTeam
// 0x0028 (0x0028 - 0x0000)
struct KillMessageWidget_C_IsKillerTeam final
{
public:
	bool                                          IsTeam;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerState*                        K2Node_DynamicCast_AsTsl_Player_State;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_IsKillerTeam) == 0x000008, "Wrong alignment on KillMessageWidget_C_IsKillerTeam");
static_assert(sizeof(KillMessageWidget_C_IsKillerTeam) == 0x000028, "Wrong size on KillMessageWidget_C_IsKillerTeam");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, IsTeam) == 0x000000, "Member 'KillMessageWidget_C_IsKillerTeam::IsTeam' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'KillMessageWidget_C_IsKillerTeam::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, K2Node_DynamicCast_AsTsl_Player_State) == 0x000010, "Member 'KillMessageWidget_C_IsKillerTeam::K2Node_DynamicCast_AsTsl_Player_State' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KillMessageWidget_C_IsKillerTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, CallFunc_GetTeamNum_ReturnValue) == 0x00001C, "Member 'KillMessageWidget_C_IsKillerTeam::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsKillerTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'KillMessageWidget_C_IsKillerTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.IsVictimTeam
// 0x0028 (0x0028 - 0x0000)
struct KillMessageWidget_C_IsVictimTeam final
{
public:
	bool                                          IsTeam;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerState*                        K2Node_DynamicCast_AsTsl_Player_State;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_IsVictimTeam) == 0x000008, "Wrong alignment on KillMessageWidget_C_IsVictimTeam");
static_assert(sizeof(KillMessageWidget_C_IsVictimTeam) == 0x000028, "Wrong size on KillMessageWidget_C_IsVictimTeam");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, IsTeam) == 0x000000, "Member 'KillMessageWidget_C_IsVictimTeam::IsTeam' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'KillMessageWidget_C_IsVictimTeam::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, K2Node_DynamicCast_AsTsl_Player_State) == 0x000010, "Member 'KillMessageWidget_C_IsVictimTeam::K2Node_DynamicCast_AsTsl_Player_State' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KillMessageWidget_C_IsVictimTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, CallFunc_GetTeamNum_ReturnValue) == 0x00001C, "Member 'KillMessageWidget_C_IsVictimTeam::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_IsVictimTeam, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'KillMessageWidget_C_IsVictimTeam::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.InitializeKillMessageText
// 0x0010 (0x0010 - 0x0000)
struct KillMessageWidget_C_InitializeKillMessageText final
{
public:
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_InitializeKillMessageText) == 0x000008, "Wrong alignment on KillMessageWidget_C_InitializeKillMessageText");
static_assert(sizeof(KillMessageWidget_C_InitializeKillMessageText) == 0x000010, "Wrong size on KillMessageWidget_C_InitializeKillMessageText");
static_assert(offsetof(KillMessageWidget_C_InitializeKillMessageText, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_InitializeKillMessageText::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_InitializeKillMessageText, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'KillMessageWidget_C_InitializeKillMessageText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetFadeOutAnimation
// 0x0008 (0x0008 - 0x0000)
struct KillMessageWidget_C_GetFadeOutAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetFadeOutAnimation) == 0x000008, "Wrong alignment on KillMessageWidget_C_GetFadeOutAnimation");
static_assert(sizeof(KillMessageWidget_C_GetFadeOutAnimation) == 0x000008, "Wrong size on KillMessageWidget_C_GetFadeOutAnimation");
static_assert(offsetof(KillMessageWidget_C_GetFadeOutAnimation, Animation) == 0x000000, "Member 'KillMessageWidget_C_GetFadeOutAnimation::Animation' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct KillMessageWidget_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetFadeInAnimation) == 0x000008, "Wrong alignment on KillMessageWidget_C_GetFadeInAnimation");
static_assert(sizeof(KillMessageWidget_C_GetFadeInAnimation) == 0x000008, "Wrong size on KillMessageWidget_C_GetFadeInAnimation");
static_assert(offsetof(KillMessageWidget_C_GetFadeInAnimation, Animation) == 0x000000, "Member 'KillMessageWidget_C_GetFadeInAnimation::Animation' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.Get_Insert_Visibility_0
// 0x0005 (0x0005 - 0x0000)
struct KillMessageWidget_C_Get_Insert_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_Get_Insert_Visibility_0) == 0x000001, "Wrong alignment on KillMessageWidget_C_Get_Insert_Visibility_0");
static_assert(sizeof(KillMessageWidget_C_Get_Insert_Visibility_0) == 0x000005, "Wrong size on KillMessageWidget_C_Get_Insert_Visibility_0");
static_assert(offsetof(KillMessageWidget_C_Get_Insert_Visibility_0, ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_Get_Insert_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert_Visibility_0, m__bool_Variable) == 0x000001, "Member 'KillMessageWidget_C_Get_Insert_Visibility_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert_Visibility_0, m__byte_Variable) == 0x000002, "Member 'KillMessageWidget_C_Get_Insert_Visibility_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert_Visibility_0, m__byte_Variable2) == 0x000003, "Member 'KillMessageWidget_C_Get_Insert_Visibility_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert_Visibility_0, K2Node_Select_Default) == 0x000004, "Member 'KillMessageWidget_C_Get_Insert_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.Get_Insert2_Visibility_0
// 0x0005 (0x0005 - 0x0000)
struct KillMessageWidget_C_Get_Insert2_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_Get_Insert2_Visibility_0) == 0x000001, "Wrong alignment on KillMessageWidget_C_Get_Insert2_Visibility_0");
static_assert(sizeof(KillMessageWidget_C_Get_Insert2_Visibility_0) == 0x000005, "Wrong size on KillMessageWidget_C_Get_Insert2_Visibility_0");
static_assert(offsetof(KillMessageWidget_C_Get_Insert2_Visibility_0, ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_Get_Insert2_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert2_Visibility_0, m__bool_Variable) == 0x000001, "Member 'KillMessageWidget_C_Get_Insert2_Visibility_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert2_Visibility_0, m__byte_Variable) == 0x000002, "Member 'KillMessageWidget_C_Get_Insert2_Visibility_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert2_Visibility_0, m__byte_Variable2) == 0x000003, "Member 'KillMessageWidget_C_Get_Insert2_Visibility_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Insert2_Visibility_0, K2Node_Select_Default) == 0x000004, "Member 'KillMessageWidget_C_Get_Insert2_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.Get_Killer_Visibility_0
// 0x0005 (0x0005 - 0x0000)
struct KillMessageWidget_C_Get_Killer_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_Get_Killer_Visibility_0) == 0x000001, "Wrong alignment on KillMessageWidget_C_Get_Killer_Visibility_0");
static_assert(sizeof(KillMessageWidget_C_Get_Killer_Visibility_0) == 0x000005, "Wrong size on KillMessageWidget_C_Get_Killer_Visibility_0");
static_assert(offsetof(KillMessageWidget_C_Get_Killer_Visibility_0, ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_Get_Killer_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Killer_Visibility_0, m__bool_Variable) == 0x000001, "Member 'KillMessageWidget_C_Get_Killer_Visibility_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Killer_Visibility_0, m__byte_Variable) == 0x000002, "Member 'KillMessageWidget_C_Get_Killer_Visibility_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Killer_Visibility_0, m__byte_Variable2) == 0x000003, "Member 'KillMessageWidget_C_Get_Killer_Visibility_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_Killer_Visibility_0, K2Node_Select_Default) == 0x000004, "Member 'KillMessageWidget_C_Get_Killer_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetKillNum
// 0x0060 (0x0060 - 0x0000)
struct KillMessageWidget_C_GetKillNum final
{
public:
	int32                                         KillNum;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHudAlwaysOn_C*                         K2Node_DynamicCast_AsHud_Always_On;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslPlayerState*                        CallFunc_GetTslPlayerState_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetLastKillCount_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetKills_ReturnValue;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetKillNum) == 0x000008, "Wrong alignment on KillMessageWidget_C_GetKillNum");
static_assert(sizeof(KillMessageWidget_C_GetKillNum) == 0x000060, "Wrong size on KillMessageWidget_C_GetKillNum");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, KillNum) == 0x000000, "Member 'KillMessageWidget_C_GetKillNum::KillNum' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, K2Node_DynamicCast_AsTsl_HUD) == 0x000018, "Member 'KillMessageWidget_C_GetKillNum::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'KillMessageWidget_C_GetKillNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000028, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetWidget_ReturnValue) == 0x000030, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, K2Node_DynamicCast_AsHud_Always_On) == 0x000040, "Member 'KillMessageWidget_C_GetKillNum::K2Node_DynamicCast_AsHud_Always_On' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'KillMessageWidget_C_GetKillNum::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetTslPlayerState_ReturnValue) == 0x000050, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetTslPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetLastKillCount_ReturnValue) == 0x000058, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetLastKillCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetKillNum, CallFunc_GetKills_ReturnValue) == 0x00005C, "Member 'KillMessageWidget_C_GetKillNum::CallFunc_GetKills_ReturnValue' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetAlivePlayerNum
// 0x0020 (0x0020 - 0x0000)
struct KillMessageWidget_C_GetAlivePlayerNum final
{
public:
	int32                                         AlivePlayer_0;                                     // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslGameState*                          K2Node_DynamicCast_AsTsl_Game_State;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetAlivePlayerNum) == 0x000008, "Wrong alignment on KillMessageWidget_C_GetAlivePlayerNum");
static_assert(sizeof(KillMessageWidget_C_GetAlivePlayerNum) == 0x000020, "Wrong size on KillMessageWidget_C_GetAlivePlayerNum");
static_assert(offsetof(KillMessageWidget_C_GetAlivePlayerNum, AlivePlayer_0) == 0x000000, "Member 'KillMessageWidget_C_GetAlivePlayerNum::AlivePlayer_0' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetAlivePlayerNum, CallFunc_GetGameState_ReturnValue) == 0x000008, "Member 'KillMessageWidget_C_GetAlivePlayerNum::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetAlivePlayerNum, K2Node_DynamicCast_AsTsl_Game_State) == 0x000010, "Member 'KillMessageWidget_C_GetAlivePlayerNum::K2Node_DynamicCast_AsTsl_Game_State' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetAlivePlayerNum, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KillMessageWidget_C_GetAlivePlayerNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.Get_AlivePlayer_Text_0
// 0x0240 (0x0240 - 0x0000)
struct KillMessageWidget_C_Get_AlivePlayer_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   m__text_Variable;                                  // 0x0018(0x0018)()
	bool                                          m__bool_Variable;                                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00E8(0x0040)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0128(0x0040)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0188(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x01A0(0x0018)()
	bool                                          m__bool_Variable3;                                 // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x01C0(0x0028)()
	int32                                         CallFunc_GetNumStartTeam_NumStartTeam;             // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Select2_Default;                            // 0x01F8(0x0018)()
	class ATslPlayerState*                        K2Node_DynamicCast_AsTsl_Player_State;             // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0220(0x0018)()
	int32                                         CallFunc_GetTeamNum_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_Get_AlivePlayer_Text_0) == 0x000008, "Wrong alignment on KillMessageWidget_C_Get_AlivePlayer_Text_0");
static_assert(sizeof(KillMessageWidget_C_Get_AlivePlayer_Text_0) == 0x000240, "Wrong size on KillMessageWidget_C_Get_AlivePlayer_Text_0");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, m__text_Variable) == 0x000018, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::m__text_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, m__bool_Variable) == 0x000030, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, m__bool_Variable2) == 0x000031, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::m__bool_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeArray_Array) == 0x000098, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x0000C8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_BooleanOR_ReturnValue) == 0x0000C9, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_BooleanOR_ReturnValue2) == 0x0000CA, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D0, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeStruct_FormatArgumentData2) == 0x0000E8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeStruct_FormatArgumentData3) == 0x000128, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeArray_Array2) == 0x000168, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_MakeArray_Array3) == 0x000178, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Format_ReturnValue2) == 0x000188, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Format_ReturnValue3) == 0x0001A0, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Format_ReturnValue3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, m__bool_Variable3) == 0x0001B8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::m__bool_Variable3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_Select_Default) == 0x0001C0, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_GetNumStartTeam_NumStartTeam) == 0x0001E8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_GetNumStartTeam_NumStartTeam' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_Greater_IntInt_ReturnValue) == 0x0001EC, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001F0, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_Select2_Default) == 0x0001F8, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_DynamicCast_AsTsl_Player_State) == 0x000210, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_DynamicCast_AsTsl_Player_State' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_DynamicCast_bSuccess) == 0x000218, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, K2Node_Select3_Default) == 0x000220, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_GetTeamNum_ReturnValue) == 0x000238, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_GetTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x00023C, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_Get_AlivePlayer_Text_0, CallFunc_BooleanOR_ReturnValue3) == 0x00023D, "Member 'KillMessageWidget_C_Get_AlivePlayer_Text_0::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetTeamAlive
// 0x0020 (0x0020 - 0x0000)
struct KillMessageWidget_C_GetTeamAlive final
{
public:
	int32                                         Alive;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAliveTeamMemberCount_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetTeamAlive) == 0x000008, "Wrong alignment on KillMessageWidget_C_GetTeamAlive");
static_assert(sizeof(KillMessageWidget_C_GetTeamAlive) == 0x000020, "Wrong size on KillMessageWidget_C_GetTeamAlive");
static_assert(offsetof(KillMessageWidget_C_GetTeamAlive, Alive) == 0x000000, "Member 'KillMessageWidget_C_GetTeamAlive::Alive' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetTeamAlive, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'KillMessageWidget_C_GetTeamAlive::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetTeamAlive, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000010, "Member 'KillMessageWidget_C_GetTeamAlive::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetTeamAlive, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'KillMessageWidget_C_GetTeamAlive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetTeamAlive, CallFunc_GetAliveTeamMemberCount_ReturnValue) == 0x00001C, "Member 'KillMessageWidget_C_GetTeamAlive::CallFunc_GetAliveTeamMemberCount_ReturnValue' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.GetBrushColor_0
// 0x0048 (0x0048 - 0x0000)
struct KillMessageWidget_C_GetBrushColor_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           m__struct_Variable;                                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           m__struct_Variable2;                               // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KillMessageWidget_C_GetBrushColor_0) == 0x000004, "Wrong alignment on KillMessageWidget_C_GetBrushColor_0");
static_assert(sizeof(KillMessageWidget_C_GetBrushColor_0) == 0x000048, "Wrong size on KillMessageWidget_C_GetBrushColor_0");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, ReturnValue) == 0x000000, "Member 'KillMessageWidget_C_GetBrushColor_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, m__bool_Variable) == 0x000010, "Member 'KillMessageWidget_C_GetBrushColor_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, m__struct_Variable) == 0x000014, "Member 'KillMessageWidget_C_GetBrushColor_0::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, m__struct_Variable2) == 0x000024, "Member 'KillMessageWidget_C_GetBrushColor_0::m__struct_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, CallFunc_BooleanOR_ReturnValue) == 0x000034, "Member 'KillMessageWidget_C_GetBrushColor_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_GetBrushColor_0, K2Node_Select_Default) == 0x000038, "Member 'KillMessageWidget_C_GetBrushColor_0::K2Node_Select_Default' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.On_MyKills_Prepass_0
// 0x0190 (0x0190 - 0x0000)
struct KillMessageWidget_C_On_MyKills_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   m__text_Variable;                                  // 0x0010(0x0018)()
	bool                                          m__bool_Variable3;                                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKillerTeam_IsTeam;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetKillNum_KillNum;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNAND_ReturnValue;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)()
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00E0(0x0040)()
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0140(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0158(0x0018)()
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0178(0x0018)()
};
static_assert(alignof(KillMessageWidget_C_On_MyKills_Prepass_0) == 0x000008, "Wrong alignment on KillMessageWidget_C_On_MyKills_Prepass_0");
static_assert(sizeof(KillMessageWidget_C_On_MyKills_Prepass_0) == 0x000190, "Wrong size on KillMessageWidget_C_On_MyKills_Prepass_0");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, BoundWidget) == 0x000000, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__bool_Variable) == 0x000008, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__byte_Variable) == 0x000009, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__bool_Variable2) == 0x00000B, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__bool_Variable2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__text_Variable) == 0x000010, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__text_Variable' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, m__bool_Variable3) == 0x000028, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::m__bool_Variable3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_IsKillerTeam_IsTeam) == 0x000029, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_IsKillerTeam_IsTeam' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_GetKillNum_KillNum) == 0x00002C, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_GetKillNum_KillNum' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Not_PreBool_ReturnValue2) == 0x000032, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000034, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000035, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanNAND_ReturnValue) == 0x000036, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanNAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanOR_ReturnValue) == 0x000037, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanXOR_ReturnValue) == 0x000038, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue2) == 0x000039, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Not_PreBool_ReturnValue3) == 0x00003A, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue3) == 0x00003B, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue4) == 0x00003C, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue5) == 0x000058, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanOR_ReturnValue2) == 0x0000A0, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_MakeArray_Array) == 0x0000A8, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue6) == 0x0000B8, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanAND_ReturnValue7) == 0x0000D8, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_MakeStruct_FormatArgumentData2) == 0x0000E0, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanOR_ReturnValue3) == 0x000120, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_MakeArray_Array2) == 0x000128, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_BooleanOR_ReturnValue4) == 0x000138, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, CallFunc_Format_ReturnValue2) == 0x000140, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_Select_Default) == 0x000158, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_Select2_Default) == 0x000170, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(KillMessageWidget_C_On_MyKills_Prepass_0, K2Node_Select3_Default) == 0x000178, "Member 'KillMessageWidget_C_On_MyKills_Prepass_0::K2Node_Select3_Default' has a wrong offset!");

// Function KillMessageWidget.KillMessageWidget_C.On_AlivePlayer_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct KillMessageWidget_C_On_AlivePlayer_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
