#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyWebView

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function LobbyWebView.LobbyWebView_C.ExecuteUbergraph_LobbyWebView
// 0x0110 (0x0110 - 0x0000)
struct LobbyWebView_C_ExecuteUbergraph_LobbyWebView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UCoherentUIGTJSPayload*                 K2Node_CustomEvent_payload;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0030(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class UCoherentUIGTJSPayload* payload)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue2;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD2;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue3;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD3;                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetStartUrl_ReturnValue;                  // 0x00F0(0x0010)(ZeroConstructor)
	class UCoherentUIGTJSEvent*                   CallFunc_CreateJSEvent_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCoherentUIGTJSEvent*                   CallFunc_CreateJSEvent_ReturnValue2;               // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView) == 0x000008, "Wrong alignment on LobbyWebView_C_ExecuteUbergraph_LobbyWebView");
static_assert(sizeof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView) == 0x000110, "Wrong size on LobbyWebView_C_ExecuteUbergraph_LobbyWebView");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, EntryPoint) == 0x000000, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_CustomEvent_payload) == 0x000028, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_CustomEvent_payload' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_Event_MyGeometry) == 0x000030, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_Event_InDeltaTime) == 0x000064, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Array_Add_ReturnValue2) == 0x00006C, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Array_Add_ReturnValue3) == 0x000070, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000088, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Less_IntInt_ReturnValue) == 0x00008C, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_Greater_IntInt_ReturnValue) == 0x00008D, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetOwningPlayer_ReturnValue) == 0x000090, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetHUD_ReturnValue) == 0x000098, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_AsLobby_HUD) == 0x0000A0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_AsLobby_HUD' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000B0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetHUD_ReturnValue2) == 0x0000B8, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_AsLobby_HUD2) == 0x0000C0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_AsLobby_HUD2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetOwningPlayer_ReturnValue3) == 0x0000D0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetHUD_ReturnValue3) == 0x0000D8, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetHUD_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_AsLobby_HUD3) == 0x0000E0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_AsLobby_HUD3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, K2Node_DynamicCast_bSuccess3) == 0x0000E8, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_GetStartUrl_ReturnValue) == 0x0000F0, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_GetStartUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_CreateJSEvent_ReturnValue) == 0x000100, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_CreateJSEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_ExecuteUbergraph_LobbyWebView, CallFunc_CreateJSEvent_ReturnValue2) == 0x000108, "Member 'LobbyWebView_C_ExecuteUbergraph_LobbyWebView::CallFunc_CreateJSEvent_ReturnValue2' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct LobbyWebView_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_Tick) == 0x000004, "Wrong alignment on LobbyWebView_C_Tick");
static_assert(sizeof(LobbyWebView_C_Tick) == 0x000038, "Wrong size on LobbyWebView_C_Tick");
static_assert(offsetof(LobbyWebView_C_Tick, MyGeometry) == 0x000000, "Member 'LobbyWebView_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_Tick, InDeltaTime) == 0x000034, "Member 'LobbyWebView_C_Tick::InDeltaTime' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.JavaScriptEvent_이벤트_0
// 0x0008 (0x0008 - 0x0000)
struct LobbyWebView_C_JavaScriptEvent___________0 final
{
public:
	class UCoherentUIGTJSPayload*                 payload;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_JavaScriptEvent___________0) == 0x000008, "Wrong alignment on LobbyWebView_C_JavaScriptEvent___________0");
static_assert(sizeof(LobbyWebView_C_JavaScriptEvent___________0) == 0x000008, "Wrong size on LobbyWebView_C_JavaScriptEvent___________0");
static_assert(offsetof(LobbyWebView_C_JavaScriptEvent___________0, payload) == 0x000000, "Member 'LobbyWebView_C_JavaScriptEvent___________0::payload' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.WebViewLoad
// 0x0020 (0x0020 - 0x0000)
struct LobbyWebView_C_WebViewLoad final
{
public:
	int32                                         ViewIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor)
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_WebViewLoad) == 0x000008, "Wrong alignment on LobbyWebView_C_WebViewLoad");
static_assert(sizeof(LobbyWebView_C_WebViewLoad) == 0x000020, "Wrong size on LobbyWebView_C_WebViewLoad");
static_assert(offsetof(LobbyWebView_C_WebViewLoad, ViewIndex) == 0x000000, "Member 'LobbyWebView_C_WebViewLoad::ViewIndex' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewLoad, URL) == 0x000008, "Member 'LobbyWebView_C_WebViewLoad::URL' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewLoad, CallFunc_Array_Get_Item) == 0x000018, "Member 'LobbyWebView_C_WebViewLoad::CallFunc_Array_Get_Item' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.WebViewInputFocus
// 0x0038 (0x0038 - 0x0000)
struct LobbyWebView_C_WebViewInputFocus final
{
public:
	int32                                         ViewIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_WebViewInputFocus) == 0x000008, "Wrong alignment on LobbyWebView_C_WebViewInputFocus");
static_assert(sizeof(LobbyWebView_C_WebViewInputFocus) == 0x000038, "Wrong size on LobbyWebView_C_WebViewInputFocus");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, ViewIndex) == 0x000000, "Member 'LobbyWebView_C_WebViewInputFocus::ViewIndex' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, m__int_Array_Index_Variable) == 0x000004, "Member 'LobbyWebView_C_WebViewInputFocus::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, m__int_Loop_Counter_Variable) == 0x000008, "Member 'LobbyWebView_C_WebViewInputFocus::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_Array_Get_Item) == 0x000018, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_Array_Get_Item2) == 0x000020, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_GetVisibility_ReturnValue) == 0x000028, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'LobbyWebView_C_WebViewInputFocus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewInputFocus, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'LobbyWebView_C_WebViewInputFocus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.HandleEventFromWeb
// 0x0070 (0x0070 - 0x0000)
struct LobbyWebView_C_HandleEventFromWeb final
{
public:
	class UCoherentUIGTJSPayload*                 payload;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetString_ReturnValue;                    // 0x0010(0x0010)(ZeroConstructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetString_ReturnValue2;                   // 0x0028(0x0010)(ZeroConstructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInt32_ReturnValue;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetInt32_ReturnValue2;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBool_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInt32_ReturnValue3;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetInt32_ReturnValue4;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetString_ReturnValue3;                   // 0x0058(0x0010)(ZeroConstructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_HandleEventFromWeb) == 0x000008, "Wrong alignment on LobbyWebView_C_HandleEventFromWeb");
static_assert(sizeof(LobbyWebView_C_HandleEventFromWeb) == 0x000070, "Wrong size on LobbyWebView_C_HandleEventFromWeb");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, payload) == 0x000000, "Member 'LobbyWebView_C_HandleEventFromWeb::payload' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetString_ReturnValue) == 0x000010, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetHUD_ReturnValue) == 0x000020, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetString_ReturnValue2) == 0x000028, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, K2Node_DynamicCast_AsLobby_HUD) == 0x000038, "Member 'LobbyWebView_C_HandleEventFromWeb::K2Node_DynamicCast_AsLobby_HUD' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'LobbyWebView_C_HandleEventFromWeb::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetInt32_ReturnValue) == 0x000044, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetInt32_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetInt32_ReturnValue2) == 0x000048, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetInt32_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetBool_ReturnValue) == 0x00004C, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetInt32_ReturnValue3) == 0x000050, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetInt32_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetInt32_ReturnValue4) == 0x000054, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetInt32_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, CallFunc_GetString_ReturnValue3) == 0x000058, "Member 'LobbyWebView_C_HandleEventFromWeb::CallFunc_GetString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_HandleEventFromWeb, K2Node_SwitchString_CmpSuccess) == 0x000068, "Member 'LobbyWebView_C_HandleEventFromWeb::K2Node_SwitchString_CmpSuccess' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.WebViewShow
// 0x0018 (0x0018 - 0x0000)
struct LobbyWebView_C_WebViewShow final
{
public:
	int32                                         VeiwIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Visible;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_WebViewShow) == 0x000008, "Wrong alignment on LobbyWebView_C_WebViewShow");
static_assert(sizeof(LobbyWebView_C_WebViewShow) == 0x000018, "Wrong size on LobbyWebView_C_WebViewShow");
static_assert(offsetof(LobbyWebView_C_WebViewShow, VeiwIndex) == 0x000000, "Member 'LobbyWebView_C_WebViewShow::VeiwIndex' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewShow, Visible) == 0x000004, "Member 'LobbyWebView_C_WebViewShow::Visible' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewShow, CallFunc_Array_Get_Item) == 0x000008, "Member 'LobbyWebView_C_WebViewShow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewShow, CallFunc_GetVisibility_ReturnValue) == 0x000010, "Member 'LobbyWebView_C_WebViewShow::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewShow, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'LobbyWebView_C_WebViewShow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.WebViewUnload
// 0x0010 (0x0010 - 0x0000)
struct LobbyWebView_C_WebViewUnload final
{
public:
	int32                                         ViewIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_WebViewUnload) == 0x000008, "Wrong alignment on LobbyWebView_C_WebViewUnload");
static_assert(sizeof(LobbyWebView_C_WebViewUnload) == 0x000010, "Wrong size on LobbyWebView_C_WebViewUnload");
static_assert(offsetof(LobbyWebView_C_WebViewUnload, ViewIndex) == 0x000000, "Member 'LobbyWebView_C_WebViewUnload::ViewIndex' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewUnload, CallFunc_Array_Get_Item) == 0x000008, "Member 'LobbyWebView_C_WebViewUnload::CallFunc_Array_Get_Item' has a wrong offset!");

// Function LobbyWebView.LobbyWebView_C.WebViewBroadcast
// 0x0048 (0x0048 - 0x0000)
struct LobbyWebView_C_WebViewBroadcast final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor)
	class FString                                 Parameter;                                         // 0x0010(0x0010)(Parm, ZeroConstructor)
	int32                                         m__int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCoherentUIGTWidget*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTJSEvent*                   CallFunc_CreateJSEvent_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWebView_C_WebViewBroadcast) == 0x000008, "Wrong alignment on LobbyWebView_C_WebViewBroadcast");
static_assert(sizeof(LobbyWebView_C_WebViewBroadcast) == 0x000048, "Wrong size on LobbyWebView_C_WebViewBroadcast");
static_assert(offsetof(LobbyWebView_C_WebViewBroadcast, EventName) == 0x000000, "Member 'LobbyWebView_C_WebViewBroadcast::EventName' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewBroadcast, Parameter) == 0x000010, "Member 'LobbyWebView_C_WebViewBroadcast::Parameter' has a wrong offset!");
static_assert(offsetof(LobbyWebView_C_WebViewBroadcast, m__int_Array_Index_Variable) == 0x000020, "Member 'LobbyWebView_C_WebViewBroadcast::m__int_Array_Index_Variable' has a wrong offset!");
