#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyWebView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyWebView.LobbyWebView_C
// 0x0038 (0x0278 - 0x0240)
class ULobbyWebView_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCoherentUIGTWidget*                    WebView_0;                                         // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UCoherentUIGTWidget*                    WebView_1;                                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UCoherentUIGTWidget*                    WebView_2;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UCoherentUIGTWidget*>            ViewArray;                                         // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         TickForWebViewVisibilityChange;                    // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LobbyWebView(int32 EntryPoint);
	void PressBKey();
	void PressAKey();
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void BndEvt__WebView_2_K2Node_ComponentBoundEvent_548_UIGTReadyForBindingsSignature__DelegateSignature();
	void BndEvt__WebView_1_K2Node_ComponentBoundEvent_545_UIGTReadyForBindingsSignature__DelegateSignature();
	void JavaScriptEvent___________0(class UCoherentUIGTJSPayload* payload);
	void BndEvt__CoherentUIGTWidget_0_K2Node_ComponentBoundEvent_383_UIGTReadyForBindingsSignature__DelegateSignature();
	void WebViewLoad(int32 ViewIndex, const class FString& URL);
	void WebViewInputFocus(int32 ViewIndex);
	void HandleEventFromWeb(class UCoherentUIGTJSPayload* payload);
	void WebViewShow(int32 VeiwIndex, bool Visible);
	void WebViewUnload(int32 ViewIndex);
	void WebViewBroadcast(const class FString& EventName, const class FString& Parameter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyWebView_C">();
	}
	static class ULobbyWebView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyWebView_C>();
	}
};
static_assert(alignof(ULobbyWebView_C) == 0x000008, "Wrong alignment on ULobbyWebView_C");
static_assert(sizeof(ULobbyWebView_C) == 0x000278, "Wrong size on ULobbyWebView_C");
static_assert(offsetof(ULobbyWebView_C, UberGraphFrame) == 0x000240, "Member 'ULobbyWebView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyWebView_C, WebView_0) == 0x000248, "Member 'ULobbyWebView_C::WebView_0' has a wrong offset!");
static_assert(offsetof(ULobbyWebView_C, WebView_1) == 0x000250, "Member 'ULobbyWebView_C::WebView_1' has a wrong offset!");
static_assert(offsetof(ULobbyWebView_C, WebView_2) == 0x000258, "Member 'ULobbyWebView_C::WebView_2' has a wrong offset!");
static_assert(offsetof(ULobbyWebView_C, ViewArray) == 0x000260, "Member 'ULobbyWebView_C::ViewArray' has a wrong offset!");
static_assert(offsetof(ULobbyWebView_C, TickForWebViewVisibilityChange) == 0x000270, "Member 'ULobbyWebView_C::TickForWebViewVisibilityChange' has a wrong offset!");

}

