#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyVoiceChat

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LobbyVoiceChat.LobbyVoiceChat_C.ExecuteUbergraph_LobbyVoiceChat
// 0x0030 (0x0030 - 0x0000)
struct LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& UniqueId, bool bIsTeamChannel, bool bIsSpeaking, float Energy)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVivoxLobbyComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat) == 0x000008, "Wrong alignment on LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat");
static_assert(sizeof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat) == 0x000030, "Wrong size on LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat");
static_assert(offsetof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat, EntryPoint) == 0x000000, "Member 'LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'LobbyVoiceChat_C_ExecuteUbergraph_LobbyVoiceChat::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LobbyVoiceChat.LobbyVoiceChat_C.OnVoiceChatUpdated
// 0x0060 (0x0060 - 0x0000)
struct LobbyVoiceChat_C_OnVoiceChatUpdated final
{
public:
	class FString                                 UniqueId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor)
	bool                                          bIsTeamChannel;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsSpeaking;                                       // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Energy;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobbyCharacter*                        CallFunc_GetLobbyCharacter_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetNetId_ReturnValue;                     // 0x0048(0x0010)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyVoiceChat_C_OnVoiceChatUpdated) == 0x000008, "Wrong alignment on LobbyVoiceChat_C_OnVoiceChatUpdated");
static_assert(sizeof(LobbyVoiceChat_C_OnVoiceChatUpdated) == 0x000060, "Wrong size on LobbyVoiceChat_C_OnVoiceChatUpdated");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, UniqueId) == 0x000000, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::UniqueId' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, bIsTeamChannel) == 0x000010, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::bIsTeamChannel' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, bIsSpeaking) == 0x000011, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::bIsSpeaking' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, Energy) == 0x000014, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::Energy' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, m__bool_Variable) == 0x000018, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, m__byte_Variable) == 0x000019, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, m__byte_Variable2) == 0x00001A, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, K2Node_Select_Default) == 0x00001B, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, CallFunc_GetHUD_ReturnValue) == 0x000028, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, K2Node_DynamicCast_AsLobby_HUD) == 0x000030, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::K2Node_DynamicCast_AsLobby_HUD' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, CallFunc_GetLobbyCharacter_ReturnValue) == 0x000040, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::CallFunc_GetLobbyCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, CallFunc_GetNetId_ReturnValue) == 0x000048, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::CallFunc_GetNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyVoiceChat_C_OnVoiceChatUpdated, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000058, "Member 'LobbyVoiceChat_C_OnVoiceChatUpdated::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

}

