#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyWidgetMain

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyWidgetMain.LobbyWidgetMain_C.ExecuteUbergraph_LobbyWidgetMain
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FName                                   K2Node_Event_NewState;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FName                                   K2Node_Event_OldState;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain) == 0x000008, "Wrong alignment on LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain");
static_assert(sizeof(LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain) == 0x000018, "Wrong size on LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain");
static_assert(offsetof(LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain, EntryPoint) == 0x000000, "Member 'LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain, K2Node_Event_NewState) == 0x000008, "Member 'LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain, K2Node_Event_OldState) == 0x000010, "Member 'LobbyWidgetMain_C_ExecuteUbergraph_LobbyWidgetMain::K2Node_Event_OldState' has a wrong offset!");

// Function LobbyWidgetMain.LobbyWidgetMain_C.GameStateChanging
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LobbyWidgetMain_C_GameStateChanging final
{
public:
	struct FName                                   NewState;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FName                                   OldState;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LobbyWidgetMain_C_GameStateChanging) == 0x000008, "Wrong alignment on LobbyWidgetMain_C_GameStateChanging");
static_assert(sizeof(LobbyWidgetMain_C_GameStateChanging) == 0x000010, "Wrong size on LobbyWidgetMain_C_GameStateChanging");
static_assert(offsetof(LobbyWidgetMain_C_GameStateChanging, NewState) == 0x000000, "Member 'LobbyWidgetMain_C_GameStateChanging::NewState' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_GameStateChanging, OldState) == 0x000008, "Member 'LobbyWidgetMain_C_GameStateChanging::OldState' has a wrong offset!");

// Function LobbyWidgetMain.LobbyWidgetMain_C.SendGameStateChangingToWeb
// 0x0040 (0x0040 - 0x0000)
struct LobbyWidgetMain_C_SendGameStateChangingToWeb final
{
public:
	struct FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FName                                   InName2;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor)
	class UCoherentUIGTJSEvent*                   CallFunc_CreateJSEvent_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyForBindings_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0030(0x0010)(ZeroConstructor)
};
static_assert(alignof(LobbyWidgetMain_C_SendGameStateChangingToWeb) == 0x000008, "Wrong alignment on LobbyWidgetMain_C_SendGameStateChangingToWeb");
static_assert(sizeof(LobbyWidgetMain_C_SendGameStateChangingToWeb) == 0x000040, "Wrong size on LobbyWidgetMain_C_SendGameStateChangingToWeb");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, InName) == 0x000000, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::InName' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, InName2) == 0x000008, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::InName2' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, CallFunc_CreateJSEvent_ReturnValue) == 0x000020, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::CallFunc_CreateJSEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, CallFunc_IsReadyForBindings_ReturnValue) == 0x000028, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::CallFunc_IsReadyForBindings_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyWidgetMain_C_SendGameStateChangingToWeb, CallFunc_Conv_NameToString_ReturnValue2) == 0x000030, "Member 'LobbyWidgetMain_C_SendGameStateChangingToWeb::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");

}

