#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainLobbyHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainLobbyHUD.MainLobbyHUD_C
// 0x0078 (0x02B8 - 0x0240)
class UMainLobbyHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Quit;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_Reload;                                     // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_Setting;                                    // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ULobbyVoiceChat_C*                      NameTag_0;                                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ULobbyVoiceChat_C*                      NameTag_1;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ULobbyVoiceChat_C*                      NameTag_2;                                         // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ULobbyVoiceChat_C*                      NameTag_3;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UCanvasPanel*                           WebPopupCavas;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ALobbyHUD*                              HUD;                                               // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         ContinousReloadCount;                              // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              LastReload;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UWebPopup_C*>                    VisibleWebPopupArray;                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         NameTagHeight;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MainLobbyHUD(int32 EntryPoint);
	void Construct();
	void ShowWebPopup(const struct FWebPopupParam& Param);
	void BndEvt__Button_Quit_K2Node_ComponentBoundEvent_229_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Reload_K2Node_ComponentBoundEvent_210_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Setting_K2Node_ComponentBoundEvent_190_OnButtonClickedEvent__DelegateSignature();
	void InitializeHUD();
	void OnKey_SystemMenuOrEscape();
	void GetMainCoherentWidget(class UCoherentUIGTWidget** Browser);
	void OnReload();
	void On_HorizontalBox_90_Prepass_0(class UWidget* BoundWidget);
	void ShowWebPopupImpl(const struct FWebPopupParam& Param);
	void CanShowWebPopup(const class FString& PopupId, bool* Result);
	void AddWebPopup(class UWebPopup_C* Widget);
	void RemoveWebPopup(class UWebPopup_C* Widget);
	void CloseWebPopupByID(const class FString& WebPopupID);
	void On_NameTag_Prepass_0(class UWidget* BoundWidget);
	void OnCreateCharacter(int32 SlotIndex);
	void OnDestroyCharacter(int32 SlotIndex);
	void GetNameTagWidget(int32 SlotIndex, class ULobbyVoiceChat_C** Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainLobbyHUD_C">();
	}
	static class UMainLobbyHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainLobbyHUD_C>();
	}
};
static_assert(alignof(UMainLobbyHUD_C) == 0x000008, "Wrong alignment on UMainLobbyHUD_C");
static_assert(sizeof(UMainLobbyHUD_C) == 0x0002B8, "Wrong size on UMainLobbyHUD_C");
static_assert(offsetof(UMainLobbyHUD_C, UberGraphFrame) == 0x000240, "Member 'UMainLobbyHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, Button_Quit) == 0x000248, "Member 'UMainLobbyHUD_C::Button_Quit' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, Button_Reload) == 0x000250, "Member 'UMainLobbyHUD_C::Button_Reload' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, Button_Setting) == 0x000258, "Member 'UMainLobbyHUD_C::Button_Setting' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, NameTag_0) == 0x000260, "Member 'UMainLobbyHUD_C::NameTag_0' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, NameTag_1) == 0x000268, "Member 'UMainLobbyHUD_C::NameTag_1' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, NameTag_2) == 0x000270, "Member 'UMainLobbyHUD_C::NameTag_2' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, NameTag_3) == 0x000278, "Member 'UMainLobbyHUD_C::NameTag_3' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, WebPopupCavas) == 0x000280, "Member 'UMainLobbyHUD_C::WebPopupCavas' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, HUD) == 0x000288, "Member 'UMainLobbyHUD_C::HUD' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, ContinousReloadCount) == 0x000290, "Member 'UMainLobbyHUD_C::ContinousReloadCount' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, LastReload) == 0x000298, "Member 'UMainLobbyHUD_C::LastReload' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, VisibleWebPopupArray) == 0x0002A0, "Member 'UMainLobbyHUD_C::VisibleWebPopupArray' has a wrong offset!");
static_assert(offsetof(UMainLobbyHUD_C, NameTagHeight) == 0x0002B0, "Member 'UMainLobbyHUD_C::NameTagHeight' has a wrong offset!");

}

