#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainOptionWidget

#include "Basic.hpp"

#include "InputHookingWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainOptionWidget.MainOptionWidget_C
// 0x00B8 (0x0348 - 0x0290)
class UMainOptionWidget_C final : public UInputHookingWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOptionSettingsButotn_C*                ApplyButton;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionSettingsButotn_C*                CancelButton;                                      // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionSettingsButotn_C*                DefaultButton;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGameplayOptionWidget_BP_C*             GameOptionWidget_BP;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_0;                                           // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_5;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UKeyOptionWidget_BP_C*                  KeyOptionWidget_BP;                                // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionSettingsButotn_C*                OkButton;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionButton_C*                        OptionButton0;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionButton_C*                        OptionButton1;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionButton_C*                        OptionButton2;                                     // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionButton_C*                        OptionButton3;                                     // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         OptionButtonHorizontalBox;                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        OptionSwitch;                                      // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionTitleWidget_C*                   OptionTitleWidget;                                 // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UOptionSettingsButotn_C*                ResetButton;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class USoundOptionWidget_C*                   SoundOptionWidget;                                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UGraphicOptionWidget_C*                 VedioOptionWidget;                                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTslBaseOptionWidget*                   SelectedOption;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   DisplayOptoinText;                                 // 0x0330(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MainOptionWidget(int32 EntryPoint);
	void BndEvt__OptionButton3_K2Node_ComponentBoundEvent_144_OnClicked__DelegateSignature();
	void Destruct();
	void XBoxOnOk();
	void OnHiddenWidget();
	void BndEvt__ResetButton_K2Node_ComponentBoundEvent_433_OnButtonDown__DelegateSignature();
	void BndEvt__DefaultButton_K2Node_ComponentBoundEvent_403_OnButtonDown__DelegateSignature();
	void BndEvt__ApplyButton_K2Node_ComponentBoundEvent_362_OnButtonDown__DelegateSignature();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_344_OnButtonDown__DelegateSignature();
	void BndEvt__OptionSettingsButotn_K2Node_ComponentBoundEvent_253_OnButtonDown__DelegateSignature();
	void BndEvt__OptionButton_5_K2Node_ComponentBoundEvent_515_OnClicked__DelegateSignature();
	void BndEvt__OptionButton_4_K2Node_ComponentBoundEvent_487_OnClicked__DelegateSignature();
	void BndEvt__OptionButton_3_K2Node_ComponentBoundEvent_423_OnClicked__DelegateSignature();
	void Construct();
	bool IsApplyButtonEnabled();
	void CloseMainOption();
	void OnApply();
	void ChangeOption(int32 Index_0);
	void OnDefault();
	void OnReset();
	void ShowMessage(const class FText& Message);
	bool Get_OkButton_bIsEnabled_0();
	bool Get_ResetButton_bIsEnabled_0();
	void PopupButtonClicked(EPopupButtonID ButtonID);
	void ClearOptionButtonsColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainOptionWidget_C">();
	}
	static class UMainOptionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainOptionWidget_C>();
	}
};
static_assert(alignof(UMainOptionWidget_C) == 0x000008, "Wrong alignment on UMainOptionWidget_C");
static_assert(sizeof(UMainOptionWidget_C) == 0x000348, "Wrong size on UMainOptionWidget_C");
static_assert(offsetof(UMainOptionWidget_C, UberGraphFrame) == 0x000290, "Member 'UMainOptionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, ApplyButton) == 0x000298, "Member 'UMainOptionWidget_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, CancelButton) == 0x0002A0, "Member 'UMainOptionWidget_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, DefaultButton) == 0x0002A8, "Member 'UMainOptionWidget_C::DefaultButton' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, GameOptionWidget_BP) == 0x0002B0, "Member 'UMainOptionWidget_C::GameOptionWidget_BP' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, Image_0) == 0x0002B8, "Member 'UMainOptionWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, Image_5) == 0x0002C0, "Member 'UMainOptionWidget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, KeyOptionWidget_BP) == 0x0002C8, "Member 'UMainOptionWidget_C::KeyOptionWidget_BP' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OkButton) == 0x0002D0, "Member 'UMainOptionWidget_C::OkButton' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionButton0) == 0x0002D8, "Member 'UMainOptionWidget_C::OptionButton0' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionButton1) == 0x0002E0, "Member 'UMainOptionWidget_C::OptionButton1' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionButton2) == 0x0002E8, "Member 'UMainOptionWidget_C::OptionButton2' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionButton3) == 0x0002F0, "Member 'UMainOptionWidget_C::OptionButton3' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionButtonHorizontalBox) == 0x0002F8, "Member 'UMainOptionWidget_C::OptionButtonHorizontalBox' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionSwitch) == 0x000300, "Member 'UMainOptionWidget_C::OptionSwitch' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, OptionTitleWidget) == 0x000308, "Member 'UMainOptionWidget_C::OptionTitleWidget' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, ResetButton) == 0x000310, "Member 'UMainOptionWidget_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, SoundOptionWidget) == 0x000318, "Member 'UMainOptionWidget_C::SoundOptionWidget' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, VedioOptionWidget) == 0x000320, "Member 'UMainOptionWidget_C::VedioOptionWidget' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, SelectedOption) == 0x000328, "Member 'UMainOptionWidget_C::SelectedOption' has a wrong offset!");
static_assert(offsetof(UMainOptionWidget_C, DisplayOptoinText) == 0x000330, "Member 'UMainOptionWidget_C::DisplayOptoinText' has a wrong offset!");

}

