#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainLobbyHUD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MainLobbyHUD.MainLobbyHUD_C.ExecuteUbergraph_MainLobbyHUD
// 0x0068 (0x0068 - 0x0000)
struct MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslPlayerController*                   CallFunc_GetOwningTslPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FWebPopupParam                         K2Node_Event_Param;                                // 0x0010(0x0038)(ConstParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyHUD*                              K2Node_DynamicCast_AsLobby_HUD;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD) == 0x000008, "Wrong alignment on MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD");
static_assert(sizeof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD) == 0x000068, "Wrong size on MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, EntryPoint) == 0x000000, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, CallFunc_GetOwningTslPlayerController_ReturnValue) == 0x000008, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::CallFunc_GetOwningTslPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, K2Node_Event_Param) == 0x000010, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::K2Node_Event_Param' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, CallFunc_GetHUD_ReturnValue) == 0x000050, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, K2Node_DynamicCast_AsLobby_HUD) == 0x000058, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::K2Node_DynamicCast_AsLobby_HUD' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'MainLobbyHUD_C_ExecuteUbergraph_MainLobbyHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.ShowWebPopup
// 0x0038 (0x0038 - 0x0000)
struct MainLobbyHUD_C_ShowWebPopup final
{
public:
	struct FWebPopupParam                         Param;                                             // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MainLobbyHUD_C_ShowWebPopup) == 0x000008, "Wrong alignment on MainLobbyHUD_C_ShowWebPopup");
static_assert(sizeof(MainLobbyHUD_C_ShowWebPopup) == 0x000038, "Wrong size on MainLobbyHUD_C_ShowWebPopup");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopup, Param) == 0x000000, "Member 'MainLobbyHUD_C_ShowWebPopup::Param' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.InitializeHUD
// 0x0078 (0x0078 - 0x0000)
struct MainLobbyHUD_C_InitializeHUD final
{
public:
	struct FTslWidgetConfig                       K2Node_MakeStruct_TslWidgetConfig;                 // 0x0000(0x0010)()
	struct FTslWidgetConfig                       K2Node_MakeStruct_TslWidgetConfig2;                // 0x0010(0x0010)()
	struct FTslWidgetConfig                       K2Node_MakeStruct_TslWidgetConfig3;                // 0x0020(0x0010)()
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 SlotIndex)>              K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UTslGameInstance*                       K2Node_DynamicCast_AsTsl_Game_Instance;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseLobbyWidget_ReturnValue;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_InitializeHUD) == 0x000008, "Wrong alignment on MainLobbyHUD_C_InitializeHUD");
static_assert(sizeof(MainLobbyHUD_C_InitializeHUD) == 0x000078, "Wrong size on MainLobbyHUD_C_InitializeHUD");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_MakeStruct_TslWidgetConfig) == 0x000000, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_MakeStruct_TslWidgetConfig' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_MakeStruct_TslWidgetConfig2) == 0x000010, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_MakeStruct_TslWidgetConfig2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_MakeStruct_TslWidgetConfig3) == 0x000020, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_MakeStruct_TslWidgetConfig3' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, CallFunc_GetGameInstance_ReturnValue) == 0x000050, "Member 'MainLobbyHUD_C_InitializeHUD::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_CreateDelegate_OutputDelegate3) == 0x000058, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_DynamicCast_AsTsl_Game_Instance) == 0x000068, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_DynamicCast_AsTsl_Game_Instance' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'MainLobbyHUD_C_InitializeHUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_InitializeHUD, CallFunc_UseLobbyWidget_ReturnValue) == 0x000071, "Member 'MainLobbyHUD_C_InitializeHUD::CallFunc_UseLobbyWidget_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.OnKey_SystemMenuOrEscape
// 0x0001 (0x0001 - 0x0000)
struct MainLobbyHUD_C_OnKey_SystemMenuOrEscape final
{
public:
	bool                                          CallFunc_HideWidgetByEscape_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_OnKey_SystemMenuOrEscape) == 0x000001, "Wrong alignment on MainLobbyHUD_C_OnKey_SystemMenuOrEscape");
static_assert(sizeof(MainLobbyHUD_C_OnKey_SystemMenuOrEscape) == 0x000001, "Wrong size on MainLobbyHUD_C_OnKey_SystemMenuOrEscape");
static_assert(offsetof(MainLobbyHUD_C_OnKey_SystemMenuOrEscape, CallFunc_HideWidgetByEscape_ReturnValue) == 0x000000, "Member 'MainLobbyHUD_C_OnKey_SystemMenuOrEscape::CallFunc_HideWidgetByEscape_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.GetMainCoherentWidget
// 0x0020 (0x0020 - 0x0000)
struct MainLobbyHUD_C_GetMainCoherentWidget final
{
public:
	class UCoherentUIGTWidget*                    Browser;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetWidget_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULobbyWebView_C*                        K2Node_DynamicCast_AsLobby_Web_View;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_GetMainCoherentWidget) == 0x000008, "Wrong alignment on MainLobbyHUD_C_GetMainCoherentWidget");
static_assert(sizeof(MainLobbyHUD_C_GetMainCoherentWidget) == 0x000020, "Wrong size on MainLobbyHUD_C_GetMainCoherentWidget");
static_assert(offsetof(MainLobbyHUD_C_GetMainCoherentWidget, Browser) == 0x000000, "Member 'MainLobbyHUD_C_GetMainCoherentWidget::Browser' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_GetMainCoherentWidget, CallFunc_GetWidget_ReturnValue) == 0x000008, "Member 'MainLobbyHUD_C_GetMainCoherentWidget::CallFunc_GetWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_GetMainCoherentWidget, K2Node_DynamicCast_AsLobby_Web_View) == 0x000010, "Member 'MainLobbyHUD_C_GetMainCoherentWidget::K2Node_DynamicCast_AsLobby_Web_View' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_GetMainCoherentWidget, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MainLobbyHUD_C_GetMainCoherentWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.OnReload
// 0x0060 (0x0060 - 0x0000)
struct MainLobbyHUD_C_OnReload final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTWidget*                    CallFunc_GetMainCoherentWidget_Browser;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetStartUrl_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor)
	struct FDateTime                              CallFunc_Now_ReturnValue2;                         // 0x0030(0x0008)(ZeroConstructor)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0038(0x0008)(ZeroConstructor)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCoherentUIGTWidget*                    CallFunc_GetMainCoherentWidget_Browser2;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_OnReload) == 0x000008, "Wrong alignment on MainLobbyHUD_C_OnReload");
static_assert(sizeof(MainLobbyHUD_C_OnReload) == 0x000060, "Wrong size on MainLobbyHUD_C_OnReload");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_GetMainCoherentWidget_Browser) == 0x000008, "Member 'MainLobbyHUD_C_OnReload::CallFunc_GetMainCoherentWidget_Browser' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_GetStartUrl_ReturnValue) == 0x000010, "Member 'MainLobbyHUD_C_OnReload::CallFunc_GetStartUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'MainLobbyHUD_C_OnReload::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Now_ReturnValue) == 0x000028, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Now_ReturnValue2) == 0x000030, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Now_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000038, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_GetTotalSeconds_ReturnValue) == 0x000040, "Member 'MainLobbyHUD_C_OnReload::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Less_FloatFloat_ReturnValue) == 0x000044, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Percent_IntInt_ReturnValue) == 0x000048, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'MainLobbyHUD_C_OnReload::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_Greater_IntInt_ReturnValue) == 0x00004D, "Member 'MainLobbyHUD_C_OnReload::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_GetMainCoherentWidget_Browser2) == 0x000050, "Member 'MainLobbyHUD_C_OnReload::CallFunc_GetMainCoherentWidget_Browser2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnReload, CallFunc_IsValid_ReturnValue2) == 0x000058, "Member 'MainLobbyHUD_C_OnReload::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.On_HorizontalBox_90_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0) == 0x000008, "Wrong alignment on MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0");
static_assert(sizeof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0) == 0x000010, "Wrong size on MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, BoundWidget) == 0x000000, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, m__bool_Variable) == 0x000008, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, m__byte_Variable) == 0x000009, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, CallFunc_IsXBoxOnePlatform_NewParam) == 0x00000B, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0, K2Node_Select_Default) == 0x00000C, "Member 'MainLobbyHUD_C_On_HorizontalBox_90_Prepass_0::K2Node_Select_Default' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.ShowWebPopupImpl
// 0x00D8 (0x00D8 - 0x0000)
struct MainLobbyHUD_C_ShowWebPopupImpl final
{
public:
	struct FWebPopupParam                         Param;                                             // 0x0000(0x0038)(Parm)
	TDelegate<void(class UWebPopup_C* Widget)>    K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0070(0x0010)()
	bool                                          CallFunc_CanShowWebPopup_Result;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWebPopup_C*                            CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0098(0x0010)()
	struct FAnchorData                            K2Node_MakeStruct_AnchorData;                      // 0x00A8(0x0028)()
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_ShowWebPopupImpl) == 0x000008, "Wrong alignment on MainLobbyHUD_C_ShowWebPopupImpl");
static_assert(sizeof(MainLobbyHUD_C_ShowWebPopupImpl) == 0x0000D8, "Wrong size on MainLobbyHUD_C_ShowWebPopupImpl");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, Param) == 0x000000, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::Param' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000048, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00005C, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_MakeVector2D_ReturnValue) == 0x000060, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_MakeVector2D_ReturnValue2) == 0x000068, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, K2Node_MakeStruct_Anchors) == 0x000070, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_CanShowWebPopup_Result) == 0x000080, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_CanShowWebPopup_Result' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_Create_ReturnValue) == 0x000090, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, K2Node_MakeStruct_Margin) == 0x000098, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, K2Node_MakeStruct_AnchorData) == 0x0000A8, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::K2Node_MakeStruct_AnchorData' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_ShowWebPopupImpl, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000D0, "Member 'MainLobbyHUD_C_ShowWebPopupImpl::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.CanShowWebPopup
// 0x0030 (0x0030 - 0x0000)
struct MainLobbyHUD_C_CanShowWebPopup final
{
public:
	class FString                                 PopupId;                                           // 0x0000(0x0010)(Parm, ZeroConstructor)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWebPopup_C*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_CanShowWebPopup) == 0x000008, "Wrong alignment on MainLobbyHUD_C_CanShowWebPopup");
static_assert(sizeof(MainLobbyHUD_C_CanShowWebPopup) == 0x000030, "Wrong size on MainLobbyHUD_C_CanShowWebPopup");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, PopupId) == 0x000000, "Member 'MainLobbyHUD_C_CanShowWebPopup::PopupId' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, Result) == 0x000010, "Member 'MainLobbyHUD_C_CanShowWebPopup::Result' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000011, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, m__int_Array_Index_Variable) == 0x000014, "Member 'MainLobbyHUD_C_CanShowWebPopup::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, m__int_Loop_Counter_Variable) == 0x000018, "Member 'MainLobbyHUD_C_CanShowWebPopup::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_Array_Get_Item) == 0x000020, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CanShowWebPopup, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x00002D, "Member 'MainLobbyHUD_C_CanShowWebPopup::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.AddWebPopup
// 0x0010 (0x0010 - 0x0000)
struct MainLobbyHUD_C_AddWebPopup final
{
public:
	class UWebPopup_C*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_AddWebPopup) == 0x000008, "Wrong alignment on MainLobbyHUD_C_AddWebPopup");
static_assert(sizeof(MainLobbyHUD_C_AddWebPopup) == 0x000010, "Wrong size on MainLobbyHUD_C_AddWebPopup");
static_assert(offsetof(MainLobbyHUD_C_AddWebPopup, Widget) == 0x000000, "Member 'MainLobbyHUD_C_AddWebPopup::Widget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_AddWebPopup, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'MainLobbyHUD_C_AddWebPopup::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.RemoveWebPopup
// 0x0010 (0x0010 - 0x0000)
struct MainLobbyHUD_C_RemoveWebPopup final
{
public:
	class UWebPopup_C*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_RemoveWebPopup) == 0x000008, "Wrong alignment on MainLobbyHUD_C_RemoveWebPopup");
static_assert(sizeof(MainLobbyHUD_C_RemoveWebPopup) == 0x000010, "Wrong size on MainLobbyHUD_C_RemoveWebPopup");
static_assert(offsetof(MainLobbyHUD_C_RemoveWebPopup, Widget) == 0x000000, "Member 'MainLobbyHUD_C_RemoveWebPopup::Widget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_RemoveWebPopup, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'MainLobbyHUD_C_RemoveWebPopup::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.CloseWebPopupByID
// 0x0030 (0x0030 - 0x0000)
struct MainLobbyHUD_C_CloseWebPopupByID final
{
public:
	class FString                                 WebPopupID;                                        // 0x0000(0x0010)(Parm, ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_True_if_break_was_hit_Variable;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWebPopup_C*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_CloseWebPopupByID) == 0x000008, "Wrong alignment on MainLobbyHUD_C_CloseWebPopupByID");
static_assert(sizeof(MainLobbyHUD_C_CloseWebPopupByID) == 0x000030, "Wrong size on MainLobbyHUD_C_CloseWebPopupByID");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, WebPopupID) == 0x000000, "Member 'MainLobbyHUD_C_CloseWebPopupByID::WebPopupID' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000010, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, m__bool_True_if_break_was_hit_Variable) == 0x000011, "Member 'MainLobbyHUD_C_CloseWebPopupByID::m__bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, m__int_Array_Index_Variable) == 0x000014, "Member 'MainLobbyHUD_C_CloseWebPopupByID::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, m__int_Loop_Counter_Variable) == 0x000018, "Member 'MainLobbyHUD_C_CloseWebPopupByID::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_Array_Get_Item) == 0x000020, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_CloseWebPopupByID, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x00002E, "Member 'MainLobbyHUD_C_CloseWebPopupByID::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.On_NameTag_Prepass_0
// 0x0098 (0x0098 - 0x0000)
struct MainLobbyHUD_C_On_NameTag_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULobbyVoiceChat_C*                      K2Node_DynamicCast_AsLobby_Voice_Chat;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALobbyCharacter*                        CallFunc_GetLobbyCharacter_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetLobbyCharacterNum_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_On_NameTag_Prepass_0) == 0x000008, "Wrong alignment on MainLobbyHUD_C_On_NameTag_Prepass_0");
static_assert(sizeof(MainLobbyHUD_C_On_NameTag_Prepass_0) == 0x000098, "Wrong size on MainLobbyHUD_C_On_NameTag_Prepass_0");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, BoundWidget) == 0x000000, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, K2Node_DynamicCast_AsLobby_Voice_Chat) == 0x000008, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::K2Node_DynamicCast_AsLobby_Voice_Chat' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_GetDesiredSize_ReturnValue) == 0x000020, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector2D_X) == 0x000028, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_GetLobbyCharacter_ReturnValue) == 0x000038, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_GetLobbyCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_GetLobbyCharacterNum_ReturnValue) == 0x000040, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_GetLobbyCharacterNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_Greater_IntInt_ReturnValue) == 0x000045, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_GetSocketLocation_ReturnValue) == 0x000050, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector_X) == 0x00005C, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector_Y) == 0x000060, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector_Z) == 0x000064, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_Add_FloatFloat_ReturnValue) == 0x000068, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x000078, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000080, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector2D_X2) == 0x000084, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_BreakVector2D_Y2) == 0x000088, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_On_NameTag_Prepass_0, CallFunc_MakeVector2D_ReturnValue) == 0x000090, "Member 'MainLobbyHUD_C_On_NameTag_Prepass_0::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.OnCreateCharacter
// 0x0048 (0x0048 - 0x0000)
struct MainLobbyHUD_C_OnCreateCharacter final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyVoiceChat_C*                      CallFunc_GetNameTagWidget_Widget;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ALobbyCharacter*                        CallFunc_GetLobbyCharacter_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNickName_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(MainLobbyHUD_C_OnCreateCharacter) == 0x000008, "Wrong alignment on MainLobbyHUD_C_OnCreateCharacter");
static_assert(sizeof(MainLobbyHUD_C_OnCreateCharacter) == 0x000048, "Wrong size on MainLobbyHUD_C_OnCreateCharacter");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, SlotIndex) == 0x000000, "Member 'MainLobbyHUD_C_OnCreateCharacter::SlotIndex' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_GetNameTagWidget_Widget) == 0x000008, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_GetNameTagWidget_Widget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_GetLobbyCharacter_ReturnValue) == 0x000010, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_GetLobbyCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_GetNickName_ReturnValue) == 0x000020, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_GetNickName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnCreateCharacter, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'MainLobbyHUD_C_OnCreateCharacter::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.OnDestroyCharacter
// 0x0018 (0x0018 - 0x0000)
struct MainLobbyHUD_C_OnDestroyCharacter final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyVoiceChat_C*                      CallFunc_GetNameTagWidget_Widget;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_OnDestroyCharacter) == 0x000008, "Wrong alignment on MainLobbyHUD_C_OnDestroyCharacter");
static_assert(sizeof(MainLobbyHUD_C_OnDestroyCharacter) == 0x000018, "Wrong size on MainLobbyHUD_C_OnDestroyCharacter");
static_assert(offsetof(MainLobbyHUD_C_OnDestroyCharacter, SlotIndex) == 0x000000, "Member 'MainLobbyHUD_C_OnDestroyCharacter::SlotIndex' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnDestroyCharacter, CallFunc_GetNameTagWidget_Widget) == 0x000008, "Member 'MainLobbyHUD_C_OnDestroyCharacter::CallFunc_GetNameTagWidget_Widget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_OnDestroyCharacter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MainLobbyHUD_C_OnDestroyCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainLobbyHUD.MainLobbyHUD_C.GetNameTagWidget
// 0x0018 (0x0018 - 0x0000)
struct MainLobbyHUD_C_GetNameTagWidget final
{
public:
	int32                                         SlotIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyVoiceChat_C*                      Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainLobbyHUD_C_GetNameTagWidget) == 0x000008, "Wrong alignment on MainLobbyHUD_C_GetNameTagWidget");
static_assert(sizeof(MainLobbyHUD_C_GetNameTagWidget) == 0x000018, "Wrong size on MainLobbyHUD_C_GetNameTagWidget");
static_assert(offsetof(MainLobbyHUD_C_GetNameTagWidget, SlotIndex) == 0x000000, "Member 'MainLobbyHUD_C_GetNameTagWidget::SlotIndex' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_GetNameTagWidget, Widget) == 0x000008, "Member 'MainLobbyHUD_C_GetNameTagWidget::Widget' has a wrong offset!");
static_assert(offsetof(MainLobbyHUD_C_GetNameTagWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'MainLobbyHUD_C_GetNameTagWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

