#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainOptionWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function MainOptionWidget.MainOptionWidget_C.ExecuteUbergraph_MainOptionWidget
// 0x0080 (0x0080 - 0x0000)
struct MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UOptionButton_C*                        K2Node_DynamicCast_AsOption_Button;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslBaseOptionWidget*                   K2Node_DynamicCast_AsTsl_Base_Option_Widget;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableApply_ReturnValue;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HideWidgetByEscape_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget) == 0x000008, "Wrong alignment on MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget");
static_assert(sizeof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget) == 0x000080, "Wrong size on MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, EntryPoint) == 0x000000, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000028, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000038, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_AsOption_Button) == 0x000040, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_AsOption_Button' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_AsTsl_Base_Option_Widget) == 0x000050, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_AsTsl_Base_Option_Widget' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_IsEnableApply_ReturnValue) == 0x000059, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_IsEnableApply_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_GetHUD_ReturnValue) == 0x000068, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_AsTsl_HUD) == 0x000070, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, K2Node_DynamicCast_bSuccess3) == 0x000078, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget, CallFunc_HideWidgetByEscape_ReturnValue) == 0x000079, "Member 'MainOptionWidget_C_ExecuteUbergraph_MainOptionWidget::CallFunc_HideWidgetByEscape_ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.IsApplyButtonEnabled
// 0x0007 (0x0007 - 0x0000)
struct MainOptionWidget_C_IsApplyButtonEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsKeyUp_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableApply_ReturnValue;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChanged_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_IsApplyButtonEnabled) == 0x000001, "Wrong alignment on MainOptionWidget_C_IsApplyButtonEnabled");
static_assert(sizeof(MainOptionWidget_C_IsApplyButtonEnabled) == 0x000007, "Wrong size on MainOptionWidget_C_IsApplyButtonEnabled");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_IsKeyUp_ReturnValue) == 0x000001, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_IsKeyUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_IsEnableApply_ReturnValue) == 0x000002, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_IsEnableApply_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_IsChanged_ReturnValue) == 0x000003, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_IsChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_IsApplyButtonEnabled, CallFunc_BooleanAND_ReturnValue2) == 0x000006, "Member 'MainOptionWidget_C_IsApplyButtonEnabled::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.CloseMainOption
// 0x0020 (0x0020 - 0x0000)
struct MainOptionWidget_C_CloseMainOption final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_CloseMainOption) == 0x000008, "Wrong alignment on MainOptionWidget_C_CloseMainOption");
static_assert(sizeof(MainOptionWidget_C_CloseMainOption) == 0x000020, "Wrong size on MainOptionWidget_C_CloseMainOption");
static_assert(offsetof(MainOptionWidget_C_CloseMainOption, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_CloseMainOption::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_CloseMainOption, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'MainOptionWidget_C_CloseMainOption::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_CloseMainOption, K2Node_DynamicCast_AsTsl_HUD) == 0x000010, "Member 'MainOptionWidget_C_CloseMainOption::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_CloseMainOption, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MainOptionWidget_C_CloseMainOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.OnApply
// 0x0001 (0x0001 - 0x0000)
struct MainOptionWidget_C_OnApply final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_OnApply) == 0x000001, "Wrong alignment on MainOptionWidget_C_OnApply");
static_assert(sizeof(MainOptionWidget_C_OnApply) == 0x000001, "Wrong size on MainOptionWidget_C_OnApply");
static_assert(offsetof(MainOptionWidget_C_OnApply, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_OnApply::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.ChangeOption
// 0x0020 (0x0020 - 0x0000)
struct MainOptionWidget_C_ChangeOption final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslBaseOptionWidget*                   K2Node_DynamicCast_AsTsl_Base_Option_Widget;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_ChangeOption) == 0x000008, "Wrong alignment on MainOptionWidget_C_ChangeOption");
static_assert(sizeof(MainOptionWidget_C_ChangeOption) == 0x000020, "Wrong size on MainOptionWidget_C_ChangeOption");
static_assert(offsetof(MainOptionWidget_C_ChangeOption, Index_0) == 0x000000, "Member 'MainOptionWidget_C_ChangeOption::Index_0' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ChangeOption, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000008, "Member 'MainOptionWidget_C_ChangeOption::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ChangeOption, K2Node_DynamicCast_AsTsl_Base_Option_Widget) == 0x000010, "Member 'MainOptionWidget_C_ChangeOption::K2Node_DynamicCast_AsTsl_Base_Option_Widget' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ChangeOption, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MainOptionWidget_C_ChangeOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.OnDefault
// 0x0001 (0x0001 - 0x0000)
struct MainOptionWidget_C_OnDefault final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_OnDefault) == 0x000001, "Wrong alignment on MainOptionWidget_C_OnDefault");
static_assert(sizeof(MainOptionWidget_C_OnDefault) == 0x000001, "Wrong size on MainOptionWidget_C_OnDefault");
static_assert(offsetof(MainOptionWidget_C_OnDefault, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_OnDefault::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.OnReset
// 0x0001 (0x0001 - 0x0000)
struct MainOptionWidget_C_OnReset final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_OnReset) == 0x000001, "Wrong alignment on MainOptionWidget_C_OnReset");
static_assert(sizeof(MainOptionWidget_C_OnReset) == 0x000001, "Wrong size on MainOptionWidget_C_OnReset");
static_assert(offsetof(MainOptionWidget_C_OnReset, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_OnReset::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.ShowMessage
// 0x0048 (0x0048 - 0x0000)
struct MainOptionWidget_C_ShowMessage final
{
public:
	class FText                                   Message;                                           // 0x0000(0x0018)(Parm)
	TDelegate<void(EPopupButtonID ButtonID)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_ShowMessage) == 0x000008, "Wrong alignment on MainOptionWidget_C_ShowMessage");
static_assert(sizeof(MainOptionWidget_C_ShowMessage) == 0x000048, "Wrong size on MainOptionWidget_C_ShowMessage");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, Message) == 0x000000, "Member 'MainOptionWidget_C_ShowMessage::Message' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'MainOptionWidget_C_ShowMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'MainOptionWidget_C_ShowMessage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, CallFunc_GetHUD_ReturnValue) == 0x000030, "Member 'MainOptionWidget_C_ShowMessage::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, K2Node_DynamicCast_AsTsl_HUD) == 0x000038, "Member 'MainOptionWidget_C_ShowMessage::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ShowMessage, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'MainOptionWidget_C_ShowMessage::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.Get_OkButton_bIsEnabled_0
// 0x0001 (0x0001 - 0x0000)
struct MainOptionWidget_C_Get_OkButton_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_Get_OkButton_bIsEnabled_0) == 0x000001, "Wrong alignment on MainOptionWidget_C_Get_OkButton_bIsEnabled_0");
static_assert(sizeof(MainOptionWidget_C_Get_OkButton_bIsEnabled_0) == 0x000001, "Wrong size on MainOptionWidget_C_Get_OkButton_bIsEnabled_0");
static_assert(offsetof(MainOptionWidget_C_Get_OkButton_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_Get_OkButton_bIsEnabled_0::ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.Get_ResetButton_bIsEnabled_0
// 0x0002 (0x0002 - 0x0000)
struct MainOptionWidget_C_Get_ResetButton_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChanged_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_Get_ResetButton_bIsEnabled_0) == 0x000001, "Wrong alignment on MainOptionWidget_C_Get_ResetButton_bIsEnabled_0");
static_assert(sizeof(MainOptionWidget_C_Get_ResetButton_bIsEnabled_0) == 0x000002, "Wrong size on MainOptionWidget_C_Get_ResetButton_bIsEnabled_0");
static_assert(offsetof(MainOptionWidget_C_Get_ResetButton_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'MainOptionWidget_C_Get_ResetButton_bIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_Get_ResetButton_bIsEnabled_0, CallFunc_IsChanged_ReturnValue) == 0x000001, "Member 'MainOptionWidget_C_Get_ResetButton_bIsEnabled_0::CallFunc_IsChanged_ReturnValue' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.PopupButtonClicked
// 0x0030 (0x0030 - 0x0000)
struct MainOptionWidget_C_PopupButtonClicked final
{
public:
	EPopupButtonID                                ButtonID;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_PopupButtonClicked) == 0x000008, "Wrong alignment on MainOptionWidget_C_PopupButtonClicked");
static_assert(sizeof(MainOptionWidget_C_PopupButtonClicked) == 0x000030, "Wrong size on MainOptionWidget_C_PopupButtonClicked");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, ButtonID) == 0x000000, "Member 'MainOptionWidget_C_PopupButtonClicked::ButtonID' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'MainOptionWidget_C_PopupButtonClicked::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'MainOptionWidget_C_PopupButtonClicked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, CallFunc_GetHUD_ReturnValue) == 0x000018, "Member 'MainOptionWidget_C_PopupButtonClicked::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, K2Node_DynamicCast_AsTsl_HUD) == 0x000020, "Member 'MainOptionWidget_C_PopupButtonClicked::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_PopupButtonClicked, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MainOptionWidget_C_PopupButtonClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MainOptionWidget.MainOptionWidget_C.ClearOptionButtonsColors
// 0x0028 (0x0028 - 0x0000)
struct MainOptionWidget_C_ClearOptionButtonsColors final
{
public:
	int32                                         m__int_Variable;                                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionButton_C*                        K2Node_DynamicCast_AsOption_Button;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainOptionWidget_C_ClearOptionButtonsColors) == 0x000008, "Wrong alignment on MainOptionWidget_C_ClearOptionButtonsColors");
static_assert(sizeof(MainOptionWidget_C_ClearOptionButtonsColors) == 0x000028, "Wrong size on MainOptionWidget_C_ClearOptionButtonsColors");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, m__int_Variable) == 0x000000, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::m__int_Variable' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, K2Node_DynamicCast_AsOption_Button) == 0x000018, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::K2Node_DynamicCast_AsOption_Button' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000021, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainOptionWidget_C_ClearOptionButtonsColors, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'MainOptionWidget_C_ClearOptionButtonsColors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

