#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeleeWeaponStudio

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeleeWeaponStudio.MeleeWeaponStudio_C.ExecuteUbergraph_MeleeWeaponStudio
// 0x0018 (0x0018 - 0x0000)
struct MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_Event_Item;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSameMesh_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio) == 0x000008, "Wrong alignment on MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio");
static_assert(sizeof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio) == 0x000018, "Wrong size on MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio");
static_assert(offsetof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio, EntryPoint) == 0x000000, "Member 'MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio::EntryPoint' has a wrong offset!");
static_assert(offsetof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio, K2Node_Event_Item) == 0x000008, "Member 'MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio, CallFunc_IsSameMesh_ReturnValue) == 0x000011, "Member 'MeleeWeaponStudio_C_ExecuteUbergraph_MeleeWeaponStudio::CallFunc_IsSameMesh_ReturnValue' has a wrong offset!");

// Function MeleeWeaponStudio.MeleeWeaponStudio_C.SetItem
// 0x0008 (0x0008 - 0x0000)
struct MeleeWeaponStudio_C_SetItem final
{
public:
	class UItem*                                  Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MeleeWeaponStudio_C_SetItem) == 0x000008, "Wrong alignment on MeleeWeaponStudio_C_SetItem");
static_assert(sizeof(MeleeWeaponStudio_C_SetItem) == 0x000008, "Wrong size on MeleeWeaponStudio_C_SetItem");
static_assert(offsetof(MeleeWeaponStudio_C_SetItem, Item) == 0x000000, "Member 'MeleeWeaponStudio_C_SetItem::Item' has a wrong offset!");

// Function MeleeWeaponStudio.MeleeWeaponStudio_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) MeleeWeaponStudio_C_UserConstructionScript final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MeleeWeaponStudio_C_UserConstructionScript) == 0x000008, "Wrong alignment on MeleeWeaponStudio_C_UserConstructionScript");
static_assert(sizeof(MeleeWeaponStudio_C_UserConstructionScript) == 0x000010, "Wrong size on MeleeWeaponStudio_C_UserConstructionScript");
static_assert(offsetof(MeleeWeaponStudio_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'MeleeWeaponStudio_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

