#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniMapWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniMapWidget.MiniMapWidget_C
// 0x0020 (0x0260 - 0x0240)
class UMiniMapWidget_C final : public UUserWidget
{
public:
	class UImage*                                 Image_482;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMapGridWidget_C*                       MapGridWidget;                                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	struct FVector2D                              ViewSize;                                          // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          Character;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnPrepass_0(class UWidget* BoundWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniMapWidget_C">();
	}
	static class UMiniMapWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniMapWidget_C>();
	}
};
static_assert(alignof(UMiniMapWidget_C) == 0x000008, "Wrong alignment on UMiniMapWidget_C");
static_assert(sizeof(UMiniMapWidget_C) == 0x000260, "Wrong size on UMiniMapWidget_C");
static_assert(offsetof(UMiniMapWidget_C, Image_482) == 0x000240, "Member 'UMiniMapWidget_C::Image_482' has a wrong offset!");
static_assert(offsetof(UMiniMapWidget_C, MapGridWidget) == 0x000248, "Member 'UMiniMapWidget_C::MapGridWidget' has a wrong offset!");
static_assert(offsetof(UMiniMapWidget_C, ViewSize) == 0x000250, "Member 'UMiniMapWidget_C::ViewSize' has a wrong offset!");
static_assert(offsetof(UMiniMapWidget_C, Character) == 0x000258, "Member 'UMiniMapWidget_C::Character' has a wrong offset!");

}

