#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewCastingBarWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function NewCastingBarWidget.NewCastingBarWidget_C.ExecuteUbergraph_NewCastingBarWidget
// 0x0070 (0x0070 - 0x0000)
struct NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCastingProgressBarPercent_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningTslCharacter_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCasting_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancelCast_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget) == 0x000008, "Wrong alignment on NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget");
static_assert(sizeof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget) == 0x000070, "Wrong size on NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, EntryPoint) == 0x000000, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, K2Node_Event_InDeltaTime) == 0x000038, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_GetCastingProgressBarPercent_ReturnValue) == 0x000048, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_GetCastingProgressBarPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_GetOwningTslCharacter_ReturnValue) == 0x000060, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_GetOwningTslCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_IsCasting_ReturnValue) == 0x000068, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_IsCasting_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_IsValid_ReturnValue2) == 0x000069, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget, CallFunc_CancelCast_ReturnValue) == 0x00006A, "Member 'NewCastingBarWidget_C_ExecuteUbergraph_NewCastingBarWidget::CallFunc_CancelCast_ReturnValue' has a wrong offset!");

// Function NewCastingBarWidget.NewCastingBarWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct NewCastingBarWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewCastingBarWidget_C_Tick) == 0x000004, "Wrong alignment on NewCastingBarWidget_C_Tick");
static_assert(sizeof(NewCastingBarWidget_C_Tick) == 0x000038, "Wrong size on NewCastingBarWidget_C_Tick");
static_assert(offsetof(NewCastingBarWidget_C_Tick, MyGeometry) == 0x000000, "Member 'NewCastingBarWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'NewCastingBarWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function NewCastingBarWidget.NewCastingBarWidget_C.GetCastingProgressBarPercent
// 0x0070 (0x0070 - 0x0000)
struct NewCastingBarWidget_C_GetCastingProgressBarPercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOtherCastTime_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetOtherElapsedCastTime_ReturnValue;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGroggying_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpectating_ReturnValue;                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCastComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UCastComponent*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedCastTime_ReturnValue;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTotalCastTime_ReturnValue;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue2;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMin_ReturnValue2;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewCastingBarWidget_C_GetCastingProgressBarPercent) == 0x000008, "Wrong alignment on NewCastingBarWidget_C_GetCastingProgressBarPercent");
static_assert(sizeof(NewCastingBarWidget_C_GetCastingProgressBarPercent) == 0x000070, "Wrong size on NewCastingBarWidget_C_GetCastingProgressBarPercent");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, ReturnValue) == 0x000000, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000010, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000018, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetOtherCastTime_ReturnValue) == 0x000024, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetOtherCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetOtherElapsedCastTime_ReturnValue) == 0x000028, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetOtherElapsedCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_IsGroggying_ReturnValue) == 0x00002C, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_IsGroggying_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000030, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_IsSpectating_ReturnValue) == 0x000034, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_IsSpectating_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_FMin_ReturnValue) == 0x000038, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_BooleanOR_ReturnValue) == 0x00003C, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetComponentsByClass_ReturnValue) == 0x000040, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_Array_Get_Item) == 0x000050, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_IsValid_ReturnValue2) == 0x00005C, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_Greater_IntInt_ReturnValue) == 0x00005D, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetElapsedCastTime_ReturnValue) == 0x000060, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetElapsedCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_GetTotalCastTime_ReturnValue) == 0x000064, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_GetTotalCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_SafeDivide_FloatFloat_ReturnValue2) == 0x000068, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_SafeDivide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingProgressBarPercent, CallFunc_FMin_ReturnValue2) == 0x00006C, "Member 'NewCastingBarWidget_C_GetCastingProgressBarPercent::CallFunc_FMin_ReturnValue2' has a wrong offset!");

// Function NewCastingBarWidget.NewCastingBarWidget_C.GetCastingNameText
// 0x0068 (0x0068 - 0x0000)
struct NewCastingBarWidget_C_GetCastingNameText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UCastComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCastComponent*                         CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCastName_ReturnValue;                  // 0x0048(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewCastingBarWidget_C_GetCastingNameText) == 0x000008, "Wrong alignment on NewCastingBarWidget_C_GetCastingNameText");
static_assert(sizeof(NewCastingBarWidget_C_GetCastingNameText) == 0x000068, "Wrong size on NewCastingBarWidget_C_GetCastingNameText");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, ReturnValue) == 0x000000, "Member 'NewCastingBarWidget_C_GetCastingNameText::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000018, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_GetComponentsByClass_ReturnValue) == 0x000020, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_Array_Get_Item) == 0x000038, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_GetCastName_ReturnValue) == 0x000048, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_GetCastName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetCastingNameText, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'NewCastingBarWidget_C_GetCastingNameText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function NewCastingBarWidget.NewCastingBarWidget_C.GetRemainingCastTime
// 0x00B0 (0x00B0 - 0x0000)
struct NewCastingBarWidget_C_GetRemainingCastTime final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOtherElapsedCastTime_ReturnValue;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetOtherCastTime_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGroggying_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpectating_ReturnValue;                 // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0048(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCastComponent*>                 CallFunc_GetComponentsByClass_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UCastComponent*                         CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTotalCastTime_ReturnValue;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetElapsedCastTime_ReturnValue;           // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue2;            // 0x0098(0x0018)()
};
static_assert(alignof(NewCastingBarWidget_C_GetRemainingCastTime) == 0x000008, "Wrong alignment on NewCastingBarWidget_C_GetRemainingCastTime");
static_assert(sizeof(NewCastingBarWidget_C_GetRemainingCastTime) == 0x0000B0, "Wrong size on NewCastingBarWidget_C_GetRemainingCastTime");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, ReturnValue) == 0x000000, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000020, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000028, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetOtherElapsedCastTime_ReturnValue) == 0x000034, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetOtherElapsedCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetOtherCastTime_ReturnValue) == 0x000038, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetOtherCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_IsGroggying_ReturnValue) == 0x00003C, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_IsGroggying_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_IsSpectating_ReturnValue) == 0x000044, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_IsSpectating_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Conv_FloatToText_ReturnValue) == 0x000048, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_BooleanOR_ReturnValue) == 0x000060, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetComponentsByClass_ReturnValue) == 0x000068, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Array_Get_Item) == 0x000078, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_IsValid_ReturnValue2) == 0x000084, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Greater_IntInt_ReturnValue) == 0x000085, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetTotalCastTime_ReturnValue) == 0x000088, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetTotalCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_GetElapsedCastTime_ReturnValue) == 0x00008C, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_GetElapsedCastTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000090, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_GetRemainingCastTime, CallFunc_Conv_FloatToText_ReturnValue2) == 0x000098, "Member 'NewCastingBarWidget_C_GetRemainingCastTime::CallFunc_Conv_FloatToText_ReturnValue2' has a wrong offset!");

// Function NewCastingBarWidget.NewCastingBarWidget_C.On_CastingBarCanvas_Prepass_0
// 0x0028 (0x0028 - 0x0000)
struct NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable3;                                 // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWidgetShow_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                TslHUD;                                            // 0x0020(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0) == 0x000008, "Wrong alignment on NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0");
static_assert(sizeof(NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0) == 0x000028, "Wrong size on NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0");
static_assert(offsetof(NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0, BoundWidget) == 0x000000, "Member 'NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0, m__byte_Variable) == 0x000008, "Member 'NewCastingBarWidget_C_On_CastingBarCanvas_Prepass_0::m__byte_Variable' has a wrong offset!");
