#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewCastingBarWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewCastingBarWidget.NewCastingBarWidget_C
// 0x0028 (0x0268 - 0x0240)
class UNewCastingBarWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCastingBarInfoTextWidget_C*            CastingBarInfoText;                                // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 CircleProgress;                                    // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_0;                                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMaterialInstanceDynamic*               CircleProgressMaterial;                            // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NewCastingBarWidget(int32 EntryPoint);
	void OnInteract();
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	float GetCastingProgressBarPercent();
	class FText GetCastingNameText();
	class FText GetRemainingCastTime();
	void On_CastingBarCanvas_Prepass_0(class UWidget* BoundWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewCastingBarWidget_C">();
	}
	static class UNewCastingBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewCastingBarWidget_C>();
	}
};
static_assert(alignof(UNewCastingBarWidget_C) == 0x000008, "Wrong alignment on UNewCastingBarWidget_C");
static_assert(sizeof(UNewCastingBarWidget_C) == 0x000268, "Wrong size on UNewCastingBarWidget_C");
static_assert(offsetof(UNewCastingBarWidget_C, UberGraphFrame) == 0x000240, "Member 'UNewCastingBarWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewCastingBarWidget_C, CastingBarInfoText) == 0x000248, "Member 'UNewCastingBarWidget_C::CastingBarInfoText' has a wrong offset!");
static_assert(offsetof(UNewCastingBarWidget_C, CircleProgress) == 0x000250, "Member 'UNewCastingBarWidget_C::CircleProgress' has a wrong offset!");
static_assert(offsetof(UNewCastingBarWidget_C, Image_0) == 0x000258, "Member 'UNewCastingBarWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UNewCastingBarWidget_C, CircleProgressMaterial) == 0x000260, "Member 'UNewCastingBarWidget_C::CircleProgressMaterial' has a wrong offset!");

}

