#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewMatchResultWidget

#include "Basic.hpp"

#include "InputHookingWidget_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewMatchResultWidget.NewMatchResultWidget_C
// 0x0268 (0x04F8 - 0x0290)
class UNewMatchResultWidget_C final : public UInputHookingWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ObserverMatchResultContentBoxEmerging;             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ReportButtonVanishing;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ReportButtonEmerging;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       DetailScoreLayerEmerging;                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       BigRankBoxEmerging;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       SpectatimgButtonVanishing;                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       SpectatimgButtonEmerging;                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       ResultEmerging;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UHorizontalBox*                         BigRankBox;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 BROLogo;                                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_0;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_1;                                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                ButtonLobby;                                       // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                ButtonReport;                                      // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                ButtonSpectator;                                   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                DetailScoreLayer;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             FinalRankText;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_0;                                           // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_1;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             KillCountPlayersText;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             KillCountText;                                     // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        MatchResultExitButtonSwitcher;                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UScrollBox*                             OtherScrollSizeBox;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             PlayerNameText;                                    // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             RankBPTitleText;                                   // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             RankText;                                          // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             RankTitleText;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             ResultMsgText;                                     // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             RewardPointsTotal;                                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVerticalBox*                           VerticalBox_1;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class ATslGameState*                          refTSLGameState;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ATslPlayerState*                        refTSLPlayerState;                                 // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   PlayerName;                                        // 0x03A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Rank;                                              // 0x03B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KillCount;                                         // 0x03D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RewardTotal;                                       // 0x03E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   WinRating;                                         // 0x0400(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   KillRating;                                        // 0x0418(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TotalPlayerCount;                                  // 0x0430(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RewardRank;                                        // 0x0448(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RewardKill;                                        // 0x0460(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RewardHit;                                         // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ResultMessage;                                     // 0x0490(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PlayerText;                                        // 0x04A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsSpectatingButtonVanishing;                      // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bISBigRankBoxVanishing;                            // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDetailScoreLayerVanishing;                      // 0x04C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsResultLayerVanishing;                           // 0x04C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isTeamPlaySession;                                 // 0x04C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RankNum;                                           // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsGameOver;                                       // 0x04CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CD[0x3];                                      // 0x04CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AddedTeamList;                                     // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObserverMatchResultNameGroupWidget_C*> PlayerMatchResultGroup;                            // 0x04E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LastPlayerInfoNums;                                // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsReportButtonVanishing;                          // 0x04F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_NewMatchResultWidget(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__ButtonReport_K2Node_ComponentBoundEvent_29_OnButtonClickedEvent__DelegateSignature();
	void XBoxOnOk();
	void Custom_Event_0();
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_19_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonLobby_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ButtonSpectator_K2Node_ComponentBoundEvent_65_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void ShowLobbyPopup();
	void OnHiddenWidget();
	void OnActionInput();
	void GoToLobby(EPopupButtonID ButtonID);
	void On_ButtonSpectator_Prepass_0(class UWidget* BoundWidget);
	void SetResultDefaultValues();
	void On_BigRankBox_Prepass_0(class UWidget* BoundWidget);
	void On_DetailScoreLayer_Prepass_0(class UWidget* BoundWidget);
	void On_MatchResultWindow_Prepass_0(class UWidget* BoundWidget);
	void SetReferences();
	void SetResultScoreValues();
	void IsGameOver(bool* return_value);
	void UpdateObserverMatchResult();
	void On_ButtonReportPrepass_0(class UWidget* BoundWidget);
	void GetTslPlayerState(class ATslPlayerState** PlayerState);
	void GetTslGameState(class ATslGameState** TslGameState);
	void GetAliveTeamMemberCount(int32* Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewMatchResultWidget_C">();
	}
	static class UNewMatchResultWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewMatchResultWidget_C>();
	}
};
static_assert(alignof(UNewMatchResultWidget_C) == 0x000008, "Wrong alignment on UNewMatchResultWidget_C");
static_assert(sizeof(UNewMatchResultWidget_C) == 0x0004F8, "Wrong size on UNewMatchResultWidget_C");
static_assert(offsetof(UNewMatchResultWidget_C, UberGraphFrame) == 0x000290, "Member 'UNewMatchResultWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ObserverMatchResultContentBoxEmerging) == 0x000298, "Member 'UNewMatchResultWidget_C::ObserverMatchResultContentBoxEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ReportButtonVanishing) == 0x0002A0, "Member 'UNewMatchResultWidget_C::ReportButtonVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ReportButtonEmerging) == 0x0002A8, "Member 'UNewMatchResultWidget_C::ReportButtonEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, DetailScoreLayerEmerging) == 0x0002B0, "Member 'UNewMatchResultWidget_C::DetailScoreLayerEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, BigRankBoxEmerging) == 0x0002B8, "Member 'UNewMatchResultWidget_C::BigRankBoxEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, SpectatimgButtonVanishing) == 0x0002C0, "Member 'UNewMatchResultWidget_C::SpectatimgButtonVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, SpectatimgButtonEmerging) == 0x0002C8, "Member 'UNewMatchResultWidget_C::SpectatimgButtonEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ResultEmerging) == 0x0002D0, "Member 'UNewMatchResultWidget_C::ResultEmerging' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, BigRankBox) == 0x0002D8, "Member 'UNewMatchResultWidget_C::BigRankBox' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, BROLogo) == 0x0002E0, "Member 'UNewMatchResultWidget_C::BROLogo' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, Button_0) == 0x0002E8, "Member 'UNewMatchResultWidget_C::Button_0' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, Button_1) == 0x0002F0, "Member 'UNewMatchResultWidget_C::Button_1' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ButtonLobby) == 0x0002F8, "Member 'UNewMatchResultWidget_C::ButtonLobby' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ButtonReport) == 0x000300, "Member 'UNewMatchResultWidget_C::ButtonReport' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ButtonSpectator) == 0x000308, "Member 'UNewMatchResultWidget_C::ButtonSpectator' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, DetailScoreLayer) == 0x000310, "Member 'UNewMatchResultWidget_C::DetailScoreLayer' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, FinalRankText) == 0x000318, "Member 'UNewMatchResultWidget_C::FinalRankText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, Image_0) == 0x000320, "Member 'UNewMatchResultWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, Image_1) == 0x000328, "Member 'UNewMatchResultWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, KillCountPlayersText) == 0x000330, "Member 'UNewMatchResultWidget_C::KillCountPlayersText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, KillCountText) == 0x000338, "Member 'UNewMatchResultWidget_C::KillCountText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, MatchResultExitButtonSwitcher) == 0x000340, "Member 'UNewMatchResultWidget_C::MatchResultExitButtonSwitcher' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, OtherScrollSizeBox) == 0x000348, "Member 'UNewMatchResultWidget_C::OtherScrollSizeBox' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, PlayerNameText) == 0x000350, "Member 'UNewMatchResultWidget_C::PlayerNameText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RankBPTitleText) == 0x000358, "Member 'UNewMatchResultWidget_C::RankBPTitleText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RankText) == 0x000360, "Member 'UNewMatchResultWidget_C::RankText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RankTitleText) == 0x000368, "Member 'UNewMatchResultWidget_C::RankTitleText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ResultMsgText) == 0x000370, "Member 'UNewMatchResultWidget_C::ResultMsgText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RewardPointsTotal) == 0x000378, "Member 'UNewMatchResultWidget_C::RewardPointsTotal' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, VerticalBox_1) == 0x000380, "Member 'UNewMatchResultWidget_C::VerticalBox_1' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, WidgetSwitcher_0) == 0x000388, "Member 'UNewMatchResultWidget_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, refTSLGameState) == 0x000390, "Member 'UNewMatchResultWidget_C::refTSLGameState' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, refTSLPlayerState) == 0x000398, "Member 'UNewMatchResultWidget_C::refTSLPlayerState' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, PlayerName) == 0x0003A0, "Member 'UNewMatchResultWidget_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, Rank) == 0x0003B8, "Member 'UNewMatchResultWidget_C::Rank' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, KillCount) == 0x0003D0, "Member 'UNewMatchResultWidget_C::KillCount' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RewardTotal) == 0x0003E8, "Member 'UNewMatchResultWidget_C::RewardTotal' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, WinRating) == 0x000400, "Member 'UNewMatchResultWidget_C::WinRating' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, KillRating) == 0x000418, "Member 'UNewMatchResultWidget_C::KillRating' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, TotalPlayerCount) == 0x000430, "Member 'UNewMatchResultWidget_C::TotalPlayerCount' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RewardRank) == 0x000448, "Member 'UNewMatchResultWidget_C::RewardRank' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RewardKill) == 0x000460, "Member 'UNewMatchResultWidget_C::RewardKill' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RewardHit) == 0x000478, "Member 'UNewMatchResultWidget_C::RewardHit' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, ResultMessage) == 0x000490, "Member 'UNewMatchResultWidget_C::ResultMessage' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, PlayerText) == 0x0004A8, "Member 'UNewMatchResultWidget_C::PlayerText' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bIsSpectatingButtonVanishing) == 0x0004C0, "Member 'UNewMatchResultWidget_C::bIsSpectatingButtonVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bISBigRankBoxVanishing) == 0x0004C1, "Member 'UNewMatchResultWidget_C::bISBigRankBoxVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bIsDetailScoreLayerVanishing) == 0x0004C2, "Member 'UNewMatchResultWidget_C::bIsDetailScoreLayerVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bIsResultLayerVanishing) == 0x0004C3, "Member 'UNewMatchResultWidget_C::bIsResultLayerVanishing' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, isTeamPlaySession) == 0x0004C4, "Member 'UNewMatchResultWidget_C::isTeamPlaySession' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, RankNum) == 0x0004C8, "Member 'UNewMatchResultWidget_C::RankNum' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bIsGameOver) == 0x0004CC, "Member 'UNewMatchResultWidget_C::bIsGameOver' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, AddedTeamList) == 0x0004D0, "Member 'UNewMatchResultWidget_C::AddedTeamList' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, PlayerMatchResultGroup) == 0x0004E0, "Member 'UNewMatchResultWidget_C::PlayerMatchResultGroup' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, LastPlayerInfoNums) == 0x0004F0, "Member 'UNewMatchResultWidget_C::LastPlayerInfoNums' has a wrong offset!");
static_assert(offsetof(UNewMatchResultWidget_C, bIsReportButtonVanishing) == 0x0004F4, "Member 'UNewMatchResultWidget_C::bIsReportButtonVanishing' has a wrong offset!");

}

