#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewSystemMessageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NewSystemMessageWidget.NewSystemMessageWidget_C
// 0x00A8 (0x02E8 - 0x0240)
class UNewSystemMessageWidget_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SystemMessageFadeOut;                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       SystemMessageFadeIn;                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOut2;                                          // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             TextBlock_144;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   Message;                                           // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	ETextJustify                                  TextAlignment;                                     // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            TextColor;                                         // 0x0298(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         TextSize;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         Duration;                                          // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bUseFadeIn;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EndMessage;                                        // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkAudioEvent*                          Sound;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_NewSystemMessageWidget(int32 EntryPoint);
	void Construct();
	void InitializeMessage();
	void OnFadeInFinished();
	void OnFadeOutFinished();
	void StartFadeOut();
	void SetTextSize(class UTextBlock* TextBlock);
	void GetFadeInAnimation(class UWidgetAnimation** Animation);
	void GetFadeOutAnimation(class UWidgetAnimation** Animation);
	void StartFadeIn(class UWidgetAnimation* Animation, float Time);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NewSystemMessageWidget_C">();
	}
	static class UNewSystemMessageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewSystemMessageWidget_C>();
	}
};
static_assert(alignof(UNewSystemMessageWidget_C) == 0x000008, "Wrong alignment on UNewSystemMessageWidget_C");
static_assert(sizeof(UNewSystemMessageWidget_C) == 0x0002E8, "Wrong size on UNewSystemMessageWidget_C");
static_assert(offsetof(UNewSystemMessageWidget_C, UberGraphFrame) == 0x000240, "Member 'UNewSystemMessageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, SystemMessageFadeOut) == 0x000248, "Member 'UNewSystemMessageWidget_C::SystemMessageFadeOut' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, SystemMessageFadeIn) == 0x000250, "Member 'UNewSystemMessageWidget_C::SystemMessageFadeIn' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, FadeOut2) == 0x000258, "Member 'UNewSystemMessageWidget_C::FadeOut2' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, FadeIn) == 0x000260, "Member 'UNewSystemMessageWidget_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, FadeOut) == 0x000268, "Member 'UNewSystemMessageWidget_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, TextBlock_144) == 0x000270, "Member 'UNewSystemMessageWidget_C::TextBlock_144' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, Message) == 0x000278, "Member 'UNewSystemMessageWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, TextAlignment) == 0x000290, "Member 'UNewSystemMessageWidget_C::TextAlignment' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, TextColor) == 0x000298, "Member 'UNewSystemMessageWidget_C::TextColor' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, TextSize) == 0x0002C0, "Member 'UNewSystemMessageWidget_C::TextSize' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, Duration) == 0x0002C4, "Member 'UNewSystemMessageWidget_C::Duration' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, bUseFadeIn) == 0x0002C8, "Member 'UNewSystemMessageWidget_C::bUseFadeIn' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, EndMessage) == 0x0002D0, "Member 'UNewSystemMessageWidget_C::EndMessage' has a wrong offset!");
static_assert(offsetof(UNewSystemMessageWidget_C, Sound) == 0x0002E0, "Member 'UNewSystemMessageWidget_C::Sound' has a wrong offset!");

}

