#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewSystemMessageWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.ExecuteUbergraph_NewSystemMessageWidget
// 0x0020 (0x0020 - 0x0000)
struct NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         m__float_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_Animation;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget");
static_assert(sizeof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget) == 0x000020, "Wrong size on NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, EntryPoint) == 0x000000, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, m__float_Variable) == 0x000004, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::m__float_Variable' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, CallFunc_GetFadeInAnimation_Animation) == 0x000008, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::CallFunc_GetFadeInAnimation_Animation' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, m__bool_Variable) == 0x000010, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, CallFunc_GetEndTime_ReturnValue) == 0x000014, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget, K2Node_Select_Default) == 0x000018, "Member 'NewSystemMessageWidget_C_ExecuteUbergraph_NewSystemMessageWidget::K2Node_Select_Default' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.InitializeMessage
// 0x00A8 (0x00A8 - 0x0000)
struct NewSystemMessageWidget_C_InitializeMessage final
{
public:
	class UWidgetAnimation*                       CallFunc_GetFadeOutAnimation_Animation;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_Animation;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0040(0x0068)()
};
static_assert(alignof(NewSystemMessageWidget_C_InitializeMessage) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_InitializeMessage");
static_assert(sizeof(NewSystemMessageWidget_C_InitializeMessage) == 0x0000A8, "Wrong size on NewSystemMessageWidget_C_InitializeMessage");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, CallFunc_GetFadeOutAnimation_Animation) == 0x000000, "Member 'NewSystemMessageWidget_C_InitializeMessage::CallFunc_GetFadeOutAnimation_Animation' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'NewSystemMessageWidget_C_InitializeMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, CallFunc_GetFadeInAnimation_Animation) == 0x000010, "Member 'NewSystemMessageWidget_C_InitializeMessage::CallFunc_GetFadeInAnimation_Animation' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, CallFunc_IsValid_ReturnValue2) == 0x000018, "Member 'NewSystemMessageWidget_C_InitializeMessage::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'NewSystemMessageWidget_C_InitializeMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'NewSystemMessageWidget_C_InitializeMessage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_InitializeMessage, K2Node_MakeStruct_SlateFontInfo) == 0x000040, "Member 'NewSystemMessageWidget_C_InitializeMessage::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.OnFadeInFinished
// 0x0008 (0x0008 - 0x0000)
struct NewSystemMessageWidget_C_OnFadeInFinished final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)()
};
static_assert(alignof(NewSystemMessageWidget_C_OnFadeInFinished) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_OnFadeInFinished");
static_assert(sizeof(NewSystemMessageWidget_C_OnFadeInFinished) == 0x000008, "Wrong size on NewSystemMessageWidget_C_OnFadeInFinished");
static_assert(offsetof(NewSystemMessageWidget_C_OnFadeInFinished, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'NewSystemMessageWidget_C_OnFadeInFinished::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.StartFadeOut
// 0x0010 (0x0010 - 0x0000)
struct NewSystemMessageWidget_C_StartFadeOut final
{
public:
	class UWidgetAnimation*                       CallFunc_GetFadeOutAnimation_Animation;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewSystemMessageWidget_C_StartFadeOut) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_StartFadeOut");
static_assert(sizeof(NewSystemMessageWidget_C_StartFadeOut) == 0x000010, "Wrong size on NewSystemMessageWidget_C_StartFadeOut");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeOut, CallFunc_GetFadeOutAnimation_Animation) == 0x000000, "Member 'NewSystemMessageWidget_C_StartFadeOut::CallFunc_GetFadeOutAnimation_Animation' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeOut, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'NewSystemMessageWidget_C_StartFadeOut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeOut, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000009, "Member 'NewSystemMessageWidget_C_StartFadeOut::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.SetTextSize
// 0x0070 (0x0070 - 0x0000)
struct NewSystemMessageWidget_C_SetTextSize final
{
public:
	class UTextBlock*                             TextBlock;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0068)()
};
static_assert(alignof(NewSystemMessageWidget_C_SetTextSize) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_SetTextSize");
static_assert(sizeof(NewSystemMessageWidget_C_SetTextSize) == 0x000070, "Wrong size on NewSystemMessageWidget_C_SetTextSize");
static_assert(offsetof(NewSystemMessageWidget_C_SetTextSize, TextBlock) == 0x000000, "Member 'NewSystemMessageWidget_C_SetTextSize::TextBlock' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_SetTextSize, K2Node_MakeStruct_SlateFontInfo) == 0x000008, "Member 'NewSystemMessageWidget_C_SetTextSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct NewSystemMessageWidget_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewSystemMessageWidget_C_GetFadeInAnimation) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_GetFadeInAnimation");
static_assert(sizeof(NewSystemMessageWidget_C_GetFadeInAnimation) == 0x000008, "Wrong size on NewSystemMessageWidget_C_GetFadeInAnimation");
static_assert(offsetof(NewSystemMessageWidget_C_GetFadeInAnimation, Animation) == 0x000000, "Member 'NewSystemMessageWidget_C_GetFadeInAnimation::Animation' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.GetFadeOutAnimation
// 0x0008 (0x0008 - 0x0000)
struct NewSystemMessageWidget_C_GetFadeOutAnimation final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewSystemMessageWidget_C_GetFadeOutAnimation) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_GetFadeOutAnimation");
static_assert(sizeof(NewSystemMessageWidget_C_GetFadeOutAnimation) == 0x000008, "Wrong size on NewSystemMessageWidget_C_GetFadeOutAnimation");
static_assert(offsetof(NewSystemMessageWidget_C_GetFadeOutAnimation, Animation) == 0x000000, "Member 'NewSystemMessageWidget_C_GetFadeOutAnimation::Animation' has a wrong offset!");

// Function NewSystemMessageWidget.NewSystemMessageWidget_C.StartFadeIn
// 0x0030 (0x0030 - 0x0000)
struct NewSystemMessageWidget_C_StartFadeIn final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Time;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_GetAkComponent_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewSystemMessageWidget_C_StartFadeIn) == 0x000008, "Wrong alignment on NewSystemMessageWidget_C_StartFadeIn");
static_assert(sizeof(NewSystemMessageWidget_C_StartFadeIn) == 0x000030, "Wrong size on NewSystemMessageWidget_C_StartFadeIn");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, Animation) == 0x000000, "Member 'NewSystemMessageWidget_C_StartFadeIn::Animation' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, Time) == 0x000008, "Member 'NewSystemMessageWidget_C_StartFadeIn::Time' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000010, "Member 'NewSystemMessageWidget_C_StartFadeIn::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'NewSystemMessageWidget_C_StartFadeIn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'NewSystemMessageWidget_C_StartFadeIn::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, CallFunc_GetAkComponent_ReturnValue) == 0x000020, "Member 'NewSystemMessageWidget_C_StartFadeIn::CallFunc_GetAkComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewSystemMessageWidget_C_StartFadeIn, CallFunc_PostAkEvent_ReturnValue) == 0x000028, "Member 'NewSystemMessageWidget_C_StartFadeIn::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");

}

