#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewWorldMapWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function NewWorldMapWidget.NewWorldMapWidget_C.ExecuteUbergraph_NewWorldMapWidget
// 0x0320 (0x0320 - 0x0000)
struct NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m__float_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              m__struct_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable3;                                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Variable;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable2;                                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable4;                                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslPlayerController*                   CallFunc_GetOwningTslPlayerController_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Has_Been_Initd_Variable;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReplaying_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetLocalMousePosition_ReturnValue;        // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_UCtoMC_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   CallFunc_GetOwningTslPlayerController_ReturnValue2; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   CallFunc_GetOwningTslPlayerController_ReturnValue3; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPad;                         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetWidgetSize_ReturnValue;                // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable5;                                 // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetWidgetPosition_ReturnValue;            // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         m__object_Variable;                                // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_NEW_OutHit;               // 0x00E8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_NEW_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_173[0x1];                                      // 0x0173(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue2;                // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetAlignment_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetMapSize_MapSize;                       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_ClampPositionByWidgetSize_UC_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetWheelUpAlignment_Alignment;            // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_IsClosed_Variable;                         // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue2;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue2;            // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue2;        // 0x0254(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue3;                // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X4;                         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y4;                         // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetMapSize_MapSize2;                      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X5;                         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y5;                         // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue4;                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetMapSize_MapSize3;                      // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X6;                         // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y6;                         // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue5;                // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetMapSize_MapSize4;                      // 0x02AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select3_Default;                            // 0x02B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue2;   // 0x02C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue6;                // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Scale;                                // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPadGuidePos_UC_ReturnValue;            // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X7;                         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y7;                         // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetWidgetSize_ReturnValue2;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLastInputGamepad_ReturnValue;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X8;                         // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y8;                         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select4_Default;                            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x030C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select5_Default;                            // 0x0314(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget) == 0x000008, "Wrong alignment on NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget");
static_assert(sizeof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget) == 0x000320, "Wrong size on NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, EntryPoint) == 0x000000, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Variable) == 0x000004, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__float_Variable) == 0x000008, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__float_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Variable2) == 0x00000C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Variable2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__struct_Variable) == 0x000010, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Variable3) == 0x000018, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Variable3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__int_Variable) == 0x00001C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__int_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__int_Variable2) == 0x000020, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__int_Variable2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Variable4) == 0x000024, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Variable4' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetOwningTslPlayerController_ReturnValue) == 0x000028, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetOwningTslPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Has_Been_Initd_Variable) == 0x000030, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_IsReplaying_ReturnValue) == 0x000032, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_IsReplaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetLocalMousePosition_ReturnValue) == 0x000034, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetLocalMousePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00003C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_UCtoMC_ReturnValue) == 0x000048, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_UCtoMC_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetOwningTslPlayerController_ReturnValue2) == 0x000050, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetOwningTslPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X) == 0x000058, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y) == 0x00005C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetOwningTslPlayerController_ReturnValue3) == 0x000060, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetOwningTslPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000074, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Event_MyGeometry) == 0x000080, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Event_InDeltaTime) == 0x0000B4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_CustomEvent_bIsPad) == 0x0000B8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_CustomEvent_bIsPad' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetWidgetSize_ReturnValue) == 0x0000BC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetWidgetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue) == 0x0000C4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_Variable5) == 0x0000C8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_Variable5' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetWidgetPosition_ReturnValue) == 0x0000CC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__object_Variable) == 0x0000D8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__object_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_LineTraceSingle_NEW_OutHit) == 0x0000E8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_LineTraceSingle_NEW_OutHit' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_LineTraceSingle_NEW_ReturnValue) == 0x000170, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_LineTraceSingle_NEW_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_bBlockingHit) == 0x000171, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_bInitialOverlap) == 0x000172, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_Time) == 0x000174, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_ImpactPoint) == 0x000184, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_ImpactNormal) == 0x00019C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_PhysMat) == 0x0001A8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_HitActor) == 0x0001B0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_HitComponent) == 0x0001B8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_HitBoneName) == 0x0001C0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_HitItem) == 0x0001C8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_FaceIndex) == 0x0001CC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_TraceStart) == 0x0001D0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakHitResult_TraceEnd) == 0x0001DC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Add_VectorVector_ReturnValue) == 0x0001E8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue2) == 0x0001F4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetAlignment_ReturnValue) == 0x0001F8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetAlignment_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetMapSize_MapSize) == 0x000200, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetMapSize_MapSize' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_ClampPositionByWidgetSize_UC_ReturnValue) == 0x000208, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_ClampPositionByWidgetSize_UC_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000210, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X2) == 0x000214, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y2) == 0x000218, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetWheelUpAlignment_Alignment) == 0x00021C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetWheelUpAlignment_Alignment' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Array_Add_ReturnValue) == 0x000224, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetViewportSize_ReturnValue) == 0x000228, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetViewportSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetViewportScale_ReturnValue) == 0x000230, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetViewportScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, m__bool_IsClosed_Variable) == 0x000234, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::m__bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000238, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X3) == 0x000240, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y3) == 0x000244, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetViewportSize_ReturnValue2) == 0x000248, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetViewportSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetViewportScale_ReturnValue2) == 0x000250, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetViewportScale_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Divide_Vector2DFloat_ReturnValue2) == 0x000254, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Divide_Vector2DFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue3) == 0x00025C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X4) == 0x000260, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X4' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y4) == 0x000264, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y4' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetMapSize_MapSize2) == 0x000268, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetMapSize_MapSize2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X5) == 0x000270, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X5' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y5) == 0x000274, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y5' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue4) == 0x000278, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue4' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00027C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetMapSize_MapSize3) == 0x000280, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetMapSize_MapSize3' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X6) == 0x000288, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X6' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y6) == 0x00028C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y6' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Select_Default) == 0x000290, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000298, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Select2_Default) == 0x00029C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue5) == 0x0002A0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue5' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_MakeVector2D_ReturnValue) == 0x0002A4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetMapSize_MapSize4) == 0x0002AC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetMapSize_MapSize4' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Select3_Default) == 0x0002B4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0002BC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Subtract_Vector2DVector2D_ReturnValue2) == 0x0002C4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Subtract_Vector2DVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetZoomLevel_ReturnValue6) == 0x0002CC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetZoomLevel_ReturnValue6' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Event_Scale) == 0x0002D0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Event_Scale' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_IsXBoxOnePlatform_NewParam) == 0x0002D4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetPadGuidePos_UC_ReturnValue) == 0x0002D8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetPadGuidePos_UC_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X7) == 0x0002E0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X7' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y7) == 0x0002E4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y7' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_GetWidgetSize_ReturnValue2) == 0x0002E8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_GetWidgetSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_IsLastInputGamepad_ReturnValue) == 0x0002F0, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_IsLastInputGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_X8) == 0x0002F4, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_X8' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BreakVector2D_Y8) == 0x0002F8, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BreakVector2D_Y8' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_BooleanOR_ReturnValue) == 0x0002FC, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000300, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000304, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Select4_Default) == 0x000308, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, CallFunc_MakeVector2D_ReturnValue2) == 0x00030C, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget, K2Node_Select5_Default) == 0x000314, "Member 'NewWorldMapWidget_C_ExecuteUbergraph_NewWorldMapWidget::K2Node_Select5_Default' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.OnInputAxis
// 0x0004 (0x0004 - 0x0000)
struct NewWorldMapWidget_C_OnInputAxis final
{
public:
	float                                         Scale;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_OnInputAxis) == 0x000004, "Wrong alignment on NewWorldMapWidget_C_OnInputAxis");
static_assert(sizeof(NewWorldMapWidget_C_OnInputAxis) == 0x000004, "Wrong size on NewWorldMapWidget_C_OnInputAxis");
static_assert(offsetof(NewWorldMapWidget_C_OnInputAxis, Scale) == 0x000000, "Member 'NewWorldMapWidget_C_OnInputAxis::Scale' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.StartChangeMapSize
// 0x0001 (0x0001 - 0x0000)
struct NewWorldMapWidget_C_StartChangeMapSize final
{
public:
	bool                                          bIsPad;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_StartChangeMapSize) == 0x000001, "Wrong alignment on NewWorldMapWidget_C_StartChangeMapSize");
static_assert(sizeof(NewWorldMapWidget_C_StartChangeMapSize) == 0x000001, "Wrong size on NewWorldMapWidget_C_StartChangeMapSize");
static_assert(offsetof(NewWorldMapWidget_C_StartChangeMapSize, bIsPad) == 0x000000, "Member 'NewWorldMapWidget_C_StartChangeMapSize::bIsPad' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct NewWorldMapWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_Tick) == 0x000004, "Wrong alignment on NewWorldMapWidget_C_Tick");
static_assert(sizeof(NewWorldMapWidget_C_Tick) == 0x000038, "Wrong size on NewWorldMapWidget_C_Tick");
static_assert(offsetof(NewWorldMapWidget_C_Tick, MyGeometry) == 0x000000, "Member 'NewWorldMapWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'NewWorldMapWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.UpdateZoom
// 0x0018 (0x0018 - 0x0000)
struct NewWorldMapWidget_C_UpdateZoom final
{
public:
	float                                         ZoomOffset;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomLevel_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomRange_ZoomMin;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetZoomRange_ZoomMax;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_UpdateZoom) == 0x000004, "Wrong alignment on NewWorldMapWidget_C_UpdateZoom");
static_assert(sizeof(NewWorldMapWidget_C_UpdateZoom) == 0x000018, "Wrong size on NewWorldMapWidget_C_UpdateZoom");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, ZoomOffset) == 0x000000, "Member 'NewWorldMapWidget_C_UpdateZoom::ZoomOffset' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, CallFunc_GetZoomLevel_ReturnValue) == 0x000004, "Member 'NewWorldMapWidget_C_UpdateZoom::CallFunc_GetZoomLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, CallFunc_GetZoomRange_ZoomMin) == 0x000008, "Member 'NewWorldMapWidget_C_UpdateZoom::CallFunc_GetZoomRange_ZoomMin' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, CallFunc_GetZoomRange_ZoomMax) == 0x00000C, "Member 'NewWorldMapWidget_C_UpdateZoom::CallFunc_GetZoomRange_ZoomMax' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'NewWorldMapWidget_C_UpdateZoom::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateZoom, CallFunc_FClamp_ReturnValue) == 0x000014, "Member 'NewWorldMapWidget_C_UpdateZoom::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.OnMouseWheel
// 0x0200 (0x0200 - 0x0000)
struct NewWorldMapWidget_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00A8)()
};
static_assert(alignof(NewWorldMapWidget_C_OnMouseWheel) == 0x000008, "Wrong alignment on NewWorldMapWidget_C_OnMouseWheel");
static_assert(sizeof(NewWorldMapWidget_C_OnMouseWheel) == 0x000200, "Wrong size on NewWorldMapWidget_C_OnMouseWheel");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'NewWorldMapWidget_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'NewWorldMapWidget_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseWheel, ReturnValue) == 0x0000B0, "Member 'NewWorldMapWidget_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseWheel, CallFunc_Unhandled_ReturnValue) == 0x000158, "Member 'NewWorldMapWidget_C_OnMouseWheel::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.UpdateMap
// 0x0030 (0x0030 - 0x0000)
struct NewWorldMapWidget_C_UpdateMap final
{
public:
	struct FVector2D                              MapSize;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetWidgetSize_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_UpdateMap) == 0x000008, "Wrong alignment on NewWorldMapWidget_C_UpdateMap");
static_assert(sizeof(NewWorldMapWidget_C_UpdateMap) == 0x000030, "Wrong size on NewWorldMapWidget_C_UpdateMap");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, MapSize) == 0x000000, "Member 'NewWorldMapWidget_C_UpdateMap::MapSize' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_BreakVector2D_X) == 0x000008, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_BreakVector2D_Y) == 0x00000C, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_GetWidgetSize_ReturnValue) == 0x000010, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_GetWidgetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_BreakVector2D_X2) == 0x000018, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_BreakVector2D_Y2) == 0x00001C, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x000021, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_UpdateMap, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'NewWorldMapWidget_C_UpdateMap::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.InitializeWorldMap
// 0x000C (0x000C - 0x0000)
struct NewWorldMapWidget_C_InitializeWorldMap final
{
public:
	float                                         CallFunc_GetZoomLevel_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetMapSize_MapSize;                       // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewWorldMapWidget_C_InitializeWorldMap) == 0x000004, "Wrong alignment on NewWorldMapWidget_C_InitializeWorldMap");
static_assert(sizeof(NewWorldMapWidget_C_InitializeWorldMap) == 0x00000C, "Wrong size on NewWorldMapWidget_C_InitializeWorldMap");
static_assert(offsetof(NewWorldMapWidget_C_InitializeWorldMap, CallFunc_GetZoomLevel_ReturnValue) == 0x000000, "Member 'NewWorldMapWidget_C_InitializeWorldMap::CallFunc_GetZoomLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_InitializeWorldMap, CallFunc_GetMapSize_MapSize) == 0x000004, "Member 'NewWorldMapWidget_C_InitializeWorldMap::CallFunc_GetMapSize_MapSize' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.OnMouseButtonDown
// 0x0200 (0x0200 - 0x0000)
struct NewWorldMapWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00A8)()
};
static_assert(alignof(NewWorldMapWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on NewWorldMapWidget_C_OnMouseButtonDown");
static_assert(sizeof(NewWorldMapWidget_C_OnMouseButtonDown) == 0x000200, "Wrong size on NewWorldMapWidget_C_OnMouseButtonDown");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'NewWorldMapWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'NewWorldMapWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'NewWorldMapWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(NewWorldMapWidget_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000158, "Member 'NewWorldMapWidget_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function NewWorldMapWidget.NewWorldMapWidget_C.OnMouseMove
// 0x0200 (0x0200 - 0x0000)
struct NewWorldMapWidget_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0158(0x00A8)()
};
static_assert(alignof(NewWorldMapWidget_C_OnMouseMove) == 0x000008, "Wrong alignment on NewWorldMapWidget_C_OnMouseMove");
