#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Niagara_structs.hpp"
#include "MovieScene_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Niagara.NiagaraActor
// 0x0008 (0x03A8 - 0x03A0)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x03A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
static_assert(alignof(ANiagaraActor) == 0x000008, "Wrong alignment on ANiagaraActor");
static_assert(sizeof(ANiagaraActor) == 0x0003A8, "Wrong size on ANiagaraActor");
static_assert(offsetof(ANiagaraActor, NiagaraComponent) == 0x0003A0, "Member 'ANiagaraActor::NiagaraComponent' has a wrong offset!");

// Class Niagara.NiagaraComponent
// 0x0010 (0x06E0 - 0x06D0)
class UNiagaraComponent final : public UPrimitiveComponent
{
public:
	class UNiagaraEffect*                         Asset;                                             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6D0[0x10];                                     // 0x06D0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
static_assert(alignof(UNiagaraComponent) == 0x000010, "Wrong alignment on UNiagaraComponent");
static_assert(sizeof(UNiagaraComponent) == 0x0006E0, "Wrong size on UNiagaraComponent");
static_assert(offsetof(UNiagaraComponent, Asset) == 0x0006C8, "Member 'UNiagaraComponent::Asset' has a wrong offset!");

// Class Niagara.NiagaraScript
// 0x00A8 (0x00D0 - 0x0028)
class UNiagaraScript final : public UObject
{
public:
	TArray<uint8>                                 ByteCode;                                          // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraScriptConstantData             ConstantData;                                      // 0x0038(0x0060)(NativeAccessSpecifierPublic)
	TArray<struct FNiagaraVariableInfo>           Attributes;                                        // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetProperties>      EventReceivers;                                    // 0x00A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraDataSetProperties>      EventGenerators;                                   // 0x00B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FNiagaraScriptUsageInfo                Usage;                                             // 0x00C8(0x0001)(NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraScript">();
	}
	static class UNiagaraScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScript>();
	}
};
static_assert(alignof(UNiagaraScript) == 0x000008, "Wrong alignment on UNiagaraScript");
static_assert(sizeof(UNiagaraScript) == 0x0000D0, "Wrong size on UNiagaraScript");
static_assert(offsetof(UNiagaraScript, ByteCode) == 0x000028, "Member 'UNiagaraScript::ByteCode' has a wrong offset!");
static_assert(offsetof(UNiagaraScript, ConstantData) == 0x000038, "Member 'UNiagaraScript::ConstantData' has a wrong offset!");
static_assert(offsetof(UNiagaraScript, Attributes) == 0x000098, "Member 'UNiagaraScript::Attributes' has a wrong offset!");
static_assert(offsetof(UNiagaraScript, EventReceivers) == 0x0000A8, "Member 'UNiagaraScript::EventReceivers' has a wrong offset!");
static_assert(offsetof(UNiagaraScript, EventGenerators) == 0x0000B8, "Member 'UNiagaraScript::EventGenerators' has a wrong offset!");
static_assert(offsetof(UNiagaraScript, Usage) == 0x0000C8, "Member 'UNiagaraScript::Usage' has a wrong offset!");

// Class Niagara.NiagaraEmitterProperties
// 0x00F0 (0x0118 - 0x0028)
class UNiagaraEmitterProperties final : public UObject
{
public:
	class FString                                 EmitterName;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnRate;                                         // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterial*                              Material;                                          // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEmitterRenderModuleType                      RenderModuleType;                                  // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraEffectRendererProperties*       RendererProperties;                                // 0x0058(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoops;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraEmitterScriptProperties        UpdateScriptProps;                                 // 0x0068(0x0058)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FNiagaraEmitterScriptProperties        SpawnScriptProps;                                  // 0x00C0(0x0058)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraEmitterProperties">();
	}
	static class UNiagaraEmitterProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEmitterProperties>();
	}
};
static_assert(alignof(UNiagaraEmitterProperties) == 0x000008, "Wrong alignment on UNiagaraEmitterProperties");
static_assert(sizeof(UNiagaraEmitterProperties) == 0x000118, "Wrong size on UNiagaraEmitterProperties");
static_assert(offsetof(UNiagaraEmitterProperties, EmitterName) == 0x000028, "Member 'UNiagaraEmitterProperties::EmitterName' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, bIsEnabled) == 0x000038, "Member 'UNiagaraEmitterProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, SpawnRate) == 0x00003C, "Member 'UNiagaraEmitterProperties::SpawnRate' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, Material) == 0x000040, "Member 'UNiagaraEmitterProperties::Material' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, RenderModuleType) == 0x000048, "Member 'UNiagaraEmitterProperties::RenderModuleType' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, StartTime) == 0x00004C, "Member 'UNiagaraEmitterProperties::StartTime' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, EndTime) == 0x000050, "Member 'UNiagaraEmitterProperties::EndTime' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, RendererProperties) == 0x000058, "Member 'UNiagaraEmitterProperties::RendererProperties' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, NumLoops) == 0x000060, "Member 'UNiagaraEmitterProperties::NumLoops' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, UpdateScriptProps) == 0x000068, "Member 'UNiagaraEmitterProperties::UpdateScriptProps' has a wrong offset!");
static_assert(offsetof(UNiagaraEmitterProperties, SpawnScriptProps) == 0x0000C0, "Member 'UNiagaraEmitterProperties::SpawnScriptProps' has a wrong offset!");

// Class Niagara.NiagaraEffect
// 0x0010 (0x0038 - 0x0028)
class UNiagaraEffect final : public UObject
{
public:
	TArray<class UNiagaraEmitterProperties*>      EmitterProps;                                      // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraEffect">();
	}
	static class UNiagaraEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEffect>();
	}
};
static_assert(alignof(UNiagaraEffect) == 0x000008, "Wrong alignment on UNiagaraEffect");
static_assert(sizeof(UNiagaraEffect) == 0x000038, "Wrong size on UNiagaraEffect");
static_assert(offsetof(UNiagaraEffect, EmitterProps) == 0x000028, "Member 'UNiagaraEffect::EmitterProps' has a wrong offset!");

// Class Niagara.NiagaraEffectRendererProperties
// 0x0008 (0x0030 - 0x0028)
class UNiagaraEffectRendererProperties : public UObject
{
public:
	struct FName                                   dummy;                                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraEffectRendererProperties">();
	}
	static class UNiagaraEffectRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEffectRendererProperties>();
	}
};
static_assert(alignof(UNiagaraEffectRendererProperties) == 0x000008, "Wrong alignment on UNiagaraEffectRendererProperties");
static_assert(sizeof(UNiagaraEffectRendererProperties) == 0x000030, "Wrong size on UNiagaraEffectRendererProperties");
static_assert(offsetof(UNiagaraEffectRendererProperties, dummy) == 0x000028, "Member 'UNiagaraEffectRendererProperties::dummy' has a wrong offset!");

// Class Niagara.NiagaraMeshRendererProperties
// 0x0008 (0x0038 - 0x0030)
class UNiagaraMeshRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	class UStaticMesh*                            ParticleMesh;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraMeshRendererProperties">();
	}
	static class UNiagaraMeshRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraMeshRendererProperties>();
	}
};
static_assert(alignof(UNiagaraMeshRendererProperties) == 0x000008, "Wrong alignment on UNiagaraMeshRendererProperties");
static_assert(sizeof(UNiagaraMeshRendererProperties) == 0x000038, "Wrong size on UNiagaraMeshRendererProperties");
static_assert(offsetof(UNiagaraMeshRendererProperties, ParticleMesh) == 0x000030, "Member 'UNiagaraMeshRendererProperties::ParticleMesh' has a wrong offset!");

// Class Niagara.NiagaraRibbonRendererProperties
// 0x0000 (0x0030 - 0x0030)
class UNiagaraRibbonRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRibbonRendererProperties">();
	}
	static class UNiagaraRibbonRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRibbonRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRibbonRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRibbonRendererProperties");
static_assert(sizeof(UNiagaraRibbonRendererProperties) == 0x000030, "Wrong size on UNiagaraRibbonRendererProperties");

// Class Niagara.NiagaraSpriteRendererProperties
// 0x0010 (0x0040 - 0x0030)
class UNiagaraSpriteRendererProperties final : public UNiagaraEffectRendererProperties
{
public:
	struct FVector2D                              SubImageInfo;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bBVelocityAligned;                                 // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraSpriteRendererProperties">();
	}
	static class UNiagaraSpriteRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSpriteRendererProperties>();
	}
};
static_assert(alignof(UNiagaraSpriteRendererProperties) == 0x000008, "Wrong alignment on UNiagaraSpriteRendererProperties");
static_assert(sizeof(UNiagaraSpriteRendererProperties) == 0x000040, "Wrong size on UNiagaraSpriteRendererProperties");
static_assert(offsetof(UNiagaraSpriteRendererProperties, SubImageInfo) == 0x000030, "Member 'UNiagaraSpriteRendererProperties::SubImageInfo' has a wrong offset!");
static_assert(offsetof(UNiagaraSpriteRendererProperties, bBVelocityAligned) == 0x000038, "Member 'UNiagaraSpriteRendererProperties::bBVelocityAligned' has a wrong offset!");

// Class Niagara.NiagaraEventReceiverEmitterAction
// 0x0000 (0x0028 - 0x0028)
class UNiagaraEventReceiverEmitterAction : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraEventReceiverEmitterAction">();
	}
	static class UNiagaraEventReceiverEmitterAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction>();
	}
};
static_assert(alignof(UNiagaraEventReceiverEmitterAction) == 0x000008, "Wrong alignment on UNiagaraEventReceiverEmitterAction");
static_assert(sizeof(UNiagaraEventReceiverEmitterAction) == 0x000028, "Wrong size on UNiagaraEventReceiverEmitterAction");

// Class Niagara.NiagaraEventReceiverEmitterAction_SpawnParticles
// 0x0008 (0x0030 - 0x0028)
class UNiagaraEventReceiverEmitterAction_SpawnParticles final : public UNiagaraEventReceiverEmitterAction
{
public:
	uint32                                        NumParticles;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraEventReceiverEmitterAction_SpawnParticles">();
	}
	static class UNiagaraEventReceiverEmitterAction_SpawnParticles* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraEventReceiverEmitterAction_SpawnParticles>();
	}
};
static_assert(alignof(UNiagaraEventReceiverEmitterAction_SpawnParticles) == 0x000008, "Wrong alignment on UNiagaraEventReceiverEmitterAction_SpawnParticles");
static_assert(sizeof(UNiagaraEventReceiverEmitterAction_SpawnParticles) == 0x000030, "Wrong size on UNiagaraEventReceiverEmitterAction_SpawnParticles");
static_assert(offsetof(UNiagaraEventReceiverEmitterAction_SpawnParticles, NumParticles) == 0x000028, "Member 'UNiagaraEventReceiverEmitterAction_SpawnParticles::NumParticles' has a wrong offset!");

// Class Niagara.NiagaraFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetUpdateScriptConstant(class UNiagaraComponent* Component, struct FName EmitterName, struct FName ConstantName, const struct FVector& Value);
	static class UNiagaraComponent* SpawnEffectAtLocation(class UObject* WorldContextObject, class UNiagaraEffect* EffectTemplate, const struct FVector& Location, const struct FRotator& Rotation, bool bAutoDestroy);
	static class UNiagaraComponent* SpawnEffectAttached(class UNiagaraEffect* EffectTemplate, class USceneComponent* AttachToComponent, struct FName AttachPointName, const struct FVector& Location, const struct FRotator& Rotation, EAttachLocation LocationType, bool bAutoDestroy);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraFunctionLibrary">();
	}
	static class UNiagaraFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraFunctionLibrary>();
	}
};
static_assert(alignof(UNiagaraFunctionLibrary) == 0x000008, "Wrong alignment on UNiagaraFunctionLibrary");
static_assert(sizeof(UNiagaraFunctionLibrary) == 0x000028, "Wrong size on UNiagaraFunctionLibrary");

// Class Niagara.NiagaraScriptSourceBase
// 0x0020 (0x0048 - 0x0028)
class UNiagaraScriptSourceBase final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraScriptSourceBase">();
	}
	static class UNiagaraScriptSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraScriptSourceBase>();
	}
};
static_assert(alignof(UNiagaraScriptSourceBase) == 0x000008, "Wrong alignment on UNiagaraScriptSourceBase");
static_assert(sizeof(UNiagaraScriptSourceBase) == 0x000048, "Wrong size on UNiagaraScriptSourceBase");

// Class Niagara.NiagaraSequence
// 0x0008 (0x0030 - 0x0028)
class UNiagaraSequence final : public UMovieSceneSequence
{
public:
	class UMovieScene*                            MovieScene;                                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraSequence">();
	}
	static class UNiagaraSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSequence>();
	}
};
static_assert(alignof(UNiagaraSequence) == 0x000008, "Wrong alignment on UNiagaraSequence");
static_assert(sizeof(UNiagaraSequence) == 0x000030, "Wrong size on UNiagaraSequence");
static_assert(offsetof(UNiagaraSequence, MovieScene) == 0x000028, "Member 'UNiagaraSequence::MovieScene' has a wrong offset!");

}

