#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObserverMatchResultNameGroupWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.AddPlayerMatchResultInfo
// 0x0030 (0x0030 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo final
{
public:
	struct FTslPlayerMatchResultInfo              NewItem;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObserverMatchResultNameWidget_C*       NewLocalVar_0;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo) == 0x000030, "Wrong size on ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo, NewItem) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo::NewItem' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo, NewLocalVar_0) == 0x000028, "Member 'ObserverMatchResultNameGroupWidget_C_AddPlayerMatchResultInfo::NewLocalVar_0' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.Get_TextBlock_4_Text_0
// 0x0080 (0x0080 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0) == 0x000080, "Wrong size on ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0, ReturnValue) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0, K2Node_MakeArray_Array) == 0x000058, "Member 'ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0, CallFunc_Format_ReturnValue) == 0x000068, "Member 'ObserverMatchResultNameGroupWidget_C_Get_TextBlock_4_Text_0::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_SoloOrDuo_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0) == 0x000010, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, m__bool_Variable) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, m__byte_Variable) == 0x000009, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0, K2Node_Select_Default) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_On_SoloOrDuo_Prepass_0::K2Node_Select_Default' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_Squad_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0) == 0x000010, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, m__bool_Variable) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, m__byte_Variable) == 0x000009, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0, K2Node_Select_Default) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_On_Squad_Prepass_0::K2Node_Select_Default' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_Hexa_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0) == 0x000010, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, m__bool_Variable) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, m__byte_Variable) == 0x000009, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0, K2Node_Select_Default) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_On_Hexa_Prepass_0::K2Node_Select_Default' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_Octa_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0) == 0x000010, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, m__bool_Variable) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, m__byte_Variable) == 0x000009, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, m__byte_Variable2) == 0x00000A, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, CallFunc_BooleanOR_ReturnValue) == 0x00000B, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0, K2Node_Select_Default) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_On_Octa_Prepass_0::K2Node_Select_Default' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_GroupLayer_Prepass_0
// 0x0010 (0x0010 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0) == 0x000010, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_GroupLayer_Prepass_0::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.SetSmall
// 0x0001 (0x0001 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_SetSmall final
{
public:
	bool                                          bSmall_0;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_SetSmall) == 0x000001, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_SetSmall");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_SetSmall) == 0x000001, "Wrong size on ObserverMatchResultNameGroupWidget_C_SetSmall");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_SetSmall, bSmall_0) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_SetSmall::bSmall_0' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.On_TextBlock_4_Prepass_0
// 0x0080 (0x0080 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Variable;                                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable2;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0018(0x0068)()
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0) == 0x000008, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0) == 0x000080, "Wrong size on ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, BoundWidget) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, m__bool_Variable) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, m__int_Variable) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::m__int_Variable' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, m__int_Variable2) == 0x000010, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::m__int_Variable2' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, K2Node_Select_Default) == 0x000014, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0, K2Node_MakeStruct_SlateFontInfo) == 0x000018, "Member 'ObserverMatchResultNameGroupWidget_C_On_TextBlock_4_Prepass_0::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function ObserverMatchResultNameGroupWidget.ObserverMatchResultNameGroupWidget_C.GetLineCount
// 0x0014 (0x0014 - 0x0000)
struct ObserverMatchResultNameGroupWidget_C_GetLineCount final
{
public:
	int32                                         LineCount;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObserverMatchResultNameGroupWidget_C_GetLineCount) == 0x000004, "Wrong alignment on ObserverMatchResultNameGroupWidget_C_GetLineCount");
static_assert(sizeof(ObserverMatchResultNameGroupWidget_C_GetLineCount) == 0x000014, "Wrong size on ObserverMatchResultNameGroupWidget_C_GetLineCount");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_GetLineCount, LineCount) == 0x000000, "Member 'ObserverMatchResultNameGroupWidget_C_GetLineCount::LineCount' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_GetLineCount, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'ObserverMatchResultNameGroupWidget_C_GetLineCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_GetLineCount, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'ObserverMatchResultNameGroupWidget_C_GetLineCount::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_GetLineCount, CallFunc_Percent_IntInt_ReturnValue) == 0x00000C, "Member 'ObserverMatchResultNameGroupWidget_C_GetLineCount::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObserverMatchResultNameGroupWidget_C_GetLineCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ObserverMatchResultNameGroupWidget_C_GetLineCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

