#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionButton.OptionButton_C
// 0x0038 (0x0278 - 0x0240)
class UOptionButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_1;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   DisplayButtonText;                                 // 0x0250(0x0018)(Edit, BlueprintVisible)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_OptionButton(int32 EntryPoint);
	void BndEvt__Button_1_K2Node_ComponentBoundEvent_103_OnButtonClickedEvent__DelegateSignature();
	class FText GetText_0();
	void SetButtonBgColor(const struct FLinearColor& InBackgroundColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionButton_C">();
	}
	static class UOptionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionButton_C>();
	}
};
static_assert(alignof(UOptionButton_C) == 0x000008, "Wrong alignment on UOptionButton_C");
static_assert(sizeof(UOptionButton_C) == 0x000278, "Wrong size on UOptionButton_C");
static_assert(offsetof(UOptionButton_C, UberGraphFrame) == 0x000240, "Member 'UOptionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionButton_C, Button_1) == 0x000248, "Member 'UOptionButton_C::Button_1' has a wrong offset!");
static_assert(offsetof(UOptionButton_C, DisplayButtonText) == 0x000250, "Member 'UOptionButton_C::DisplayButtonText' has a wrong offset!");
static_assert(offsetof(UOptionButton_C, OnClicked) == 0x000268, "Member 'UOptionButton_C::OnClicked' has a wrong offset!");

}

