#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionSettingsButotn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionSettingsButotn.OptionSettingsButotn_C
// 0x0038 (0x0278 - 0x0240)
class UOptionSettingsButotn_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   ButtonDisplayText;                                 // 0x0250(0x0018)(Edit, BlueprintVisible)
	UMulticastDelegateProperty_                   OnButtonDown;                                      // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_OptionSettingsButotn(int32 EntryPoint);
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_20_OnButtonClickedEvent__DelegateSignature();
	struct FSlateColor GetColorAndOpacity_0();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionSettingsButotn_C">();
	}
	static class UOptionSettingsButotn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionSettingsButotn_C>();
	}
};
static_assert(alignof(UOptionSettingsButotn_C) == 0x000008, "Wrong alignment on UOptionSettingsButotn_C");
static_assert(sizeof(UOptionSettingsButotn_C) == 0x000278, "Wrong size on UOptionSettingsButotn_C");
static_assert(offsetof(UOptionSettingsButotn_C, UberGraphFrame) == 0x000240, "Member 'UOptionSettingsButotn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionSettingsButotn_C, Button_0) == 0x000248, "Member 'UOptionSettingsButotn_C::Button_0' has a wrong offset!");
static_assert(offsetof(UOptionSettingsButotn_C, ButtonDisplayText) == 0x000250, "Member 'UOptionSettingsButotn_C::ButtonDisplayText' has a wrong offset!");
static_assert(offsetof(UOptionSettingsButotn_C, OnButtonDown) == 0x000268, "Member 'UOptionSettingsButotn_C::OnButtonDown' has a wrong offset!");

}

