#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionSettingsButotn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function OptionSettingsButotn.OptionSettingsButotn_C.ExecuteUbergraph_OptionSettingsButotn
// 0x0004 (0x0004 - 0x0000)
struct OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn) == 0x000004, "Wrong alignment on OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn");
static_assert(sizeof(OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn) == 0x000004, "Wrong size on OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn");
static_assert(offsetof(OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn, EntryPoint) == 0x000000, "Member 'OptionSettingsButotn_C_ExecuteUbergraph_OptionSettingsButotn::EntryPoint' has a wrong offset!");

// Function OptionSettingsButotn.OptionSettingsButotn_C.GetColorAndOpacity_0
// 0x0080 (0x0080 - 0x0000)
struct OptionSettingsButotn_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0050(0x0028)()
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressed_ReturnValue;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OptionSettingsButotn_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on OptionSettingsButotn_C_GetColorAndOpacity_0");
static_assert(sizeof(OptionSettingsButotn_C_GetColorAndOpacity_0) == 0x000080, "Wrong size on OptionSettingsButotn_C_GetColorAndOpacity_0");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor2) == 0x000050, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, CallFunc_IsHovered_ReturnValue) == 0x000078, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, CallFunc_IsPressed_ReturnValue) == 0x000079, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::CallFunc_IsPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(OptionSettingsButotn_C_GetColorAndOpacity_0, CallFunc_BooleanOR_ReturnValue) == 0x00007A, "Member 'OptionSettingsButotn_C_GetColorAndOpacity_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function OptionSettingsButotn.OptionSettingsButotn_C.GetText_0
// 0x0018 (0x0018 - 0x0000)
struct OptionSettingsButotn_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(OptionSettingsButotn_C_GetText_0) == 0x000008, "Wrong alignment on OptionSettingsButotn_C_GetText_0");
static_assert(sizeof(OptionSettingsButotn_C_GetText_0) == 0x000018, "Wrong size on OptionSettingsButotn_C_GetText_0");
static_assert(offsetof(OptionSettingsButotn_C_GetText_0, ReturnValue) == 0x000000, "Member 'OptionSettingsButotn_C_GetText_0::ReturnValue' has a wrong offset!");

}

