#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Boat_Drive_Bubbles_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_Boat_Drive_Bubbles_BP.P_Boat_Drive_Bubbles_BP_C.ExecuteUbergraph_P_Boat_Drive_Bubbles_BP
// 0x00D0 (0x00D0 - 0x0000)
struct P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0040(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP) == 0x000010, "Wrong alignment on P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP");
static_assert(sizeof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP) == 0x0000D0, "Wrong size on P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, EntryPoint) == 0x000000, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000004, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, CallFunc_MakeVector_ReturnValue2) == 0x00002C, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000040, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP, K2Node_MakeArray_Array) == 0x0000C0, "Member 'P_Boat_Drive_Bubbles_BP_C_ExecuteUbergraph_P_Boat_Drive_Bubbles_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

