#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Boat_FrontDrive_FoamLeft_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_Boat_FrontDrive_FoamLeft_BP.P_Boat_FrontDrive_FoamLeft_BP_C.ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP
// 0x03E0 (0x03E0 - 0x0000)
struct P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0050(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00F0(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue10;        // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue3;             // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0190(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0210(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue4;             // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue5;             // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x02D0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x0350(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03D0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP) == 0x000010, "Wrong alignment on P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP");
static_assert(sizeof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP) == 0x0003E0, "Wrong size on P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, EntryPoint) == 0x000000, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000004, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000010, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000014, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000018, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x00001C, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MapRangeClamped_ReturnValue2) == 0x000020, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MapRangeClamped_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000024, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x000028, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MakeVector_ReturnValue) == 0x00002C, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MakeVector_ReturnValue2) == 0x000038, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000050, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x0000D0, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue9) == 0x0000D4, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MakeVector_ReturnValue3) == 0x0000D8, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MakeVector_ReturnValue4) == 0x0000E4, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x0000F0, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_FloatFloat_ReturnValue10) == 0x000170, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MapRangeClamped_ReturnValue3) == 0x000174, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MapRangeClamped_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MakeVector_ReturnValue5) == 0x000178, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000190, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam4) == 0x000210, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MapRangeClamped_ReturnValue4) == 0x000290, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MapRangeClamped_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_MapRangeClamped_ReturnValue5) == 0x000294, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_MapRangeClamped_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000298, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0002A4, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x0002B0, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, CallFunc_Multiply_VectorFloat_ReturnValue4) == 0x0002BC, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::CallFunc_Multiply_VectorFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam5) == 0x0002D0, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeStruct_ParticleSysParam6) == 0x000350, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP, K2Node_MakeArray_Array) == 0x0003D0, "Member 'P_Boat_FrontDrive_FoamLeft_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamLeft_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

