#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Boat_FrontDrive_FoamRight_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_Boat_FrontDrive_FoamRight_BP.P_Boat_FrontDrive_FoamRight_BP_C.ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP
// 0x03D0 (0x03D0 - 0x0000)
struct P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0030(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue2;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue3;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00C0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0170(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue10;        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue4;             // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue5;                  // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0210(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue5;             // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x02A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue4;        // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x0340(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x03C0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP) == 0x000010, "Wrong alignment on P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP");
static_assert(sizeof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP) == 0x0003D0, "Wrong size on P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, EntryPoint) == 0x000000, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000004, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000010, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000014, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000018, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MakeVector_ReturnValue) == 0x00001C, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x000028, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000030, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x0000B0, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MapRangeClamped_ReturnValue2) == 0x0000B4, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MapRangeClamped_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MapRangeClamped_ReturnValue3) == 0x0000B8, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MapRangeClamped_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x0000BC, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x0000C0, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MakeVector_ReturnValue2) == 0x000140, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x00014C, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue9) == 0x000150, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MakeVector_ReturnValue3) == 0x000154, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MakeVector_ReturnValue4) == 0x000160, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000170, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_FloatFloat_ReturnValue10) == 0x0001F0, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MapRangeClamped_ReturnValue4) == 0x0001F4, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MapRangeClamped_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MakeVector_ReturnValue5) == 0x0001F8, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MakeVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000204, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam4) == 0x000210, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x000290, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_MapRangeClamped_ReturnValue5) == 0x00029C, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_MapRangeClamped_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam5) == 0x0002A0, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_VectorFloat_ReturnValue3) == 0x000320, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_VectorFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, CallFunc_Multiply_VectorFloat_ReturnValue4) == 0x00032C, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::CallFunc_Multiply_VectorFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeStruct_ParticleSysParam6) == 0x000340, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP, K2Node_MakeArray_Array) == 0x0003C0, "Member 'P_Boat_FrontDrive_FoamRight_BP_C_ExecuteUbergraph_P_Boat_FrontDrive_FoamRight_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

