#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Boat_Drive_Foam_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function P_Boat_Drive_Foam_BP.P_Boat_Drive_Foam_BP_C.ExecuteUbergraph_P_Boat_Drive_Foam_BP
// 0x01F0 (0x01F0 - 0x0000)
struct P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0020(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FMax_ReturnValue2;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0160(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP) == 0x000010, "Wrong alignment on P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP");
static_assert(sizeof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP) == 0x0001F0, "Wrong size on P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, EntryPoint) == 0x000000, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000004, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000020, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A0, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000A4, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_FMax_ReturnValue) == 0x0000A8, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_FMax_ReturnValue2) == 0x0000AC, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_FMax_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_MakeVector_ReturnValue2) == 0x0000BC, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, CallFunc_MakeVector_ReturnValue3) == 0x0000C8, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x0000E0, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000160, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP, K2Node_MakeArray_Array) == 0x0001E0, "Member 'P_Boat_Drive_Foam_BP_C_ExecuteUbergraph_P_Boat_Drive_Foam_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

