#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_MotoAccel_Dirt_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function P_MotoAccel_Dirt_BP.P_MotoAccel_Dirt_BP_C.ExecuteUbergraph_P_MotoAccel_Dirt_BP
// 0x0140 (0x0140 - 0x0000)
struct P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue2;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00B0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP) == 0x000010, "Wrong alignment on P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP");
static_assert(sizeof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP) == 0x000140, "Wrong size on P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, EntryPoint) == 0x000000, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000004, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, CallFunc_GetParticleParamter_ReturnValue2) == 0x000008, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::CallFunc_GetParticleParamter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, CallFunc_Abs_ReturnValue) == 0x00000C, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00009C, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x0000B0, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP, K2Node_MakeArray_Array) == 0x000130, "Member 'P_MotoAccel_Dirt_BP_C_ExecuteUbergraph_P_MotoAccel_Dirt_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

