#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Moto_Damaged_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_Moto_Damaged_BP.P_Moto_Damaged_BP_C.ExecuteUbergraph_P_Moto_Damaged_BP
// 0x0A70 (0x0A70 - 0x0000)
struct P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x00A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0120(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x01A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x0220(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x02A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam7;               // 0x0320(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam8;               // 0x03A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam9;               // 0x0420(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam10;              // 0x04A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam11;              // 0x0520(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam12;              // 0x05A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam13;              // 0x0620(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam14;              // 0x06A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam15;              // 0x0720(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam16;              // 0x07A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam17;              // 0x0820(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam18;              // 0x08A0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam19;              // 0x0920(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam20;              // 0x09A0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0A20(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array2;                           // 0x0A30(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array3;                           // 0x0A40(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array4;                           // 0x0A50(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array5;                           // 0x0A60(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP) == 0x000010, "Wrong alignment on P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP");
static_assert(sizeof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP) == 0x000A70, "Wrong size on P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, EntryPoint) == 0x000000, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000090, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000095, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000096, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, CallFunc_Less_FloatFloat_ReturnValue3) == 0x000097, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x0000A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000120, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam4) == 0x0001A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam5) == 0x000220, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam6) == 0x0002A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam7) == 0x000320, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam7' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam8) == 0x0003A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam8' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam9) == 0x000420, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam9' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam10) == 0x0004A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam10' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam11) == 0x000520, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam11' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam12) == 0x0005A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam12' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam13) == 0x000620, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam13' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam14) == 0x0006A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam14' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam15) == 0x000720, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam15' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam16) == 0x0007A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam16' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam17) == 0x000820, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam17' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam18) == 0x0008A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam18' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam19) == 0x000920, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam19' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeStruct_ParticleSysParam20) == 0x0009A0, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeStruct_ParticleSysParam20' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeArray_Array) == 0x000A20, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeArray_Array2) == 0x000A30, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeArray_Array3) == 0x000A40, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeArray_Array4) == 0x000A50, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP, K2Node_MakeArray_Array5) == 0x000A60, "Member 'P_Moto_Damaged_BP_C_ExecuteUbergraph_P_Moto_Damaged_BP::K2Node_MakeArray_Array5' has a wrong offset!");

}

