#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_Vehicle_Muffler_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_Vehicle_Muffler_BP.P_Vehicle_Muffler_BP_C.ExecuteUbergraph_P_Vehicle_Muffler_BP
// 0x0240 (0x0240 - 0x0000)
struct P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x0090(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0120(0x0080)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0xE];                                      // 0x01A2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_Select_Default;                             // 0x01B0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0230(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP) == 0x000010, "Wrong alignment on P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP");
static_assert(sizeof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP) == 0x000240, "Wrong size on P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, EntryPoint) == 0x000000, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, m__bool_Variable) == 0x000004, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x000090, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000110, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, CallFunc_MapRangeClamped_ReturnValue) == 0x000114, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000118, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000120, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001A0, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, CallFunc_BooleanOR_ReturnValue) == 0x0001A1, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, K2Node_Select_Default) == 0x0001B0, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP, K2Node_MakeArray_Array) == 0x000230, "Member 'P_Vehicle_Muffler_BP_C_ExecuteUbergraph_P_Vehicle_Muffler_BP::K2Node_MakeArray_Array' has a wrong offset!");

}

