#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_VehicleImpact_Vehicle_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_VehicleImpact_Vehicle_BP.P_VehicleImpact_Vehicle_BP_C.ExecuteUbergraph_P_VehicleImpact_Vehicle_BP
// 0x0990 (0x0990 - 0x0000)
struct P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x0090(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0110(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0190(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x0210(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x0290(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam7;               // 0x0310(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam8;               // 0x0390(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam9;               // 0x0410(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam10;              // 0x0490(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x0510(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array2;                           // 0x0520(0x0010)(ZeroConstructor, ReferenceParm)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam11;              // 0x0530(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam12;              // 0x05B0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array3;                           // 0x0630(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array4;                           // 0x0640(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_654[0xC];                                      // 0x0654(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam13;              // 0x0660(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam14;              // 0x06E0(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam15;              // 0x0760(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array5;                           // 0x07E0(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetParticleParamter_ReturnValue2;         // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x07F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x07F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x07F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue4;             // 0x07F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue5;             // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam16;              // 0x0800(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam17;              // 0x0880(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam18;              // 0x0900(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array6;                           // 0x0980(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP) == 0x000010, "Wrong alignment on P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP");
static_assert(sizeof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP) == 0x000990, "Wrong size on P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, EntryPoint) == 0x000000, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x000090, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000110, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam4) == 0x000190, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam5) == 0x000210, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam6) == 0x000290, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam7) == 0x000310, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam7' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam8) == 0x000390, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam8' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam9) == 0x000410, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam9' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam10) == 0x000490, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam10' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array) == 0x000510, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array2) == 0x000520, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam11) == 0x000530, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam11' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam12) == 0x0005B0, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam12' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array3) == 0x000630, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array4) == 0x000640, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000650, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam13) == 0x000660, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam13' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam14) == 0x0006E0, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam14' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam15) == 0x000760, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam15' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array5) == 0x0007E0, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array5' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_GetParticleParamter_ReturnValue2) == 0x0007F0, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_GetParticleParamter_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x0007F4, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_Less_FloatFloat_ReturnValue2) == 0x0007F5, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_Less_FloatFloat_ReturnValue3) == 0x0007F6, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_Less_FloatFloat_ReturnValue4) == 0x0007F7, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_Less_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, CallFunc_Less_FloatFloat_ReturnValue5) == 0x0007F8, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::CallFunc_Less_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam16) == 0x000800, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam16' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam17) == 0x000880, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam17' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeStruct_ParticleSysParam18) == 0x000900, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeStruct_ParticleSysParam18' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP, K2Node_MakeArray_Array6) == 0x000980, "Member 'P_VehicleImpact_Vehicle_BP_C_ExecuteUbergraph_P_VehicleImpact_Vehicle_BP::K2Node_MakeArray_Array6' has a wrong offset!");

}

