#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P_VehicleImpact_Wood_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P_VehicleImpact_Wood_BP.P_VehicleImpact_Wood_BP_C.ExecuteUbergraph_P_VehicleImpact_Wood_BP
// 0x0470 (0x0470 - 0x0000)
struct P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam;                // 0x0010(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam2;               // 0x0090(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam3;               // 0x0110(0x0080)(IsPlainOldData, NoDestructor)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam4;               // 0x0190(0x0080)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetParticleParamter_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_217[0x9];                                      // 0x0217(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam5;               // 0x0220(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array;                            // 0x02A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam6;               // 0x02B0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array2;                           // 0x0330(0x0010)(ZeroConstructor, ReferenceParm)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam7;               // 0x0340(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array3;                           // 0x03C0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FParticleSysParam                      K2Node_MakeStruct_ParticleSysParam8;               // 0x03D0(0x0080)(IsPlainOldData, NoDestructor)
	TArray<struct FParticleSysParam>              K2Node_MakeArray_Array4;                           // 0x0450(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_GetParticleParamter_ReturnValue2;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP) == 0x000010, "Wrong alignment on P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP");
static_assert(sizeof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP) == 0x000470, "Wrong size on P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, EntryPoint) == 0x000000, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam) == 0x000010, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam2) == 0x000090, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam3) == 0x000110, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam4) == 0x000190, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam4' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, CallFunc_GetParticleParamter_ReturnValue) == 0x000210, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::CallFunc_GetParticleParamter_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000214, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, CallFunc_Less_FloatFloat_ReturnValue2) == 0x000215, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, CallFunc_Less_FloatFloat_ReturnValue3) == 0x000216, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam5) == 0x000220, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam5' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeArray_Array) == 0x0002A0, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam6) == 0x0002B0, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam6' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeArray_Array2) == 0x000330, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam7) == 0x000340, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam7' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeArray_Array3) == 0x0003C0, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeStruct_ParticleSysParam8) == 0x0003D0, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeStruct_ParticleSysParam8' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, K2Node_MakeArray_Array4) == 0x000450, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP, CallFunc_GetParticleParamter_ReturnValue2) == 0x000460, "Member 'P_VehicleImpact_Wood_BP_C_ExecuteUbergraph_P_VehicleImpact_Wood_BP::CallFunc_GetParticleParamter_ReturnValue2' has a wrong offset!");

}

