#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParachutePlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ParachutePlayer.ParachutePlayer_C.ExecuteUbergraph_ParachutePlayer
// 0x0850 (0x0850 - 0x0000)
struct ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue2;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDriven_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReleased_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue2;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Has_Been_Initd_Variable;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00D0(0x0040)()
	class ATslCharacter*                          CallFunc_GetDriver_ReturnValue;                    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue2;            // 0x0138(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0150(0x0040)()
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue3;            // 0x0198(0x0018)()
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x01B8(0x0040)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetAltitudeFromFloor_ReturnValue;         // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue4;            // 0x0200(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0218(0x0040)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue5;            // 0x0260(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x0278(0x0040)()
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_IsClosed_Variable;                         // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentVelocity_ReturnValue;         // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_Event_Other;                                // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0318(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X2;                           // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y2;                           // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z2;                           // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          K2Node_DynamicCast_AsTsl_Character;                // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_LessLess_VectorRotator_ReturnValue;       // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X3;                           // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y3;                           // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z3;                           // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize2D_ReturnValue2;                     // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue5;         // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue6;           // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue7;           // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Round_ReturnValue2;                       // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue6;            // 0x04A0(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData7;             // 0x04C0(0x0040)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue8;           // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue7;            // 0x0508(0x0018)()
	float                                         CallFunc_FClamp_ReturnValue3;                      // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData8;             // 0x0528(0x0040)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue8;            // 0x0568(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue6;         // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData9;             // 0x0588(0x0040)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue9;            // 0x05C8(0x0018)()
	float                                         CallFunc_NormalizeToRange_ReturnValue2;            // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData10;            // 0x05E8(0x0040)()
	float                                         CallFunc_FClamp_ReturnValue4;                      // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue5;                      // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue7;         // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue8;         // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue9;         // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue10;           // 0x0640(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue11;           // 0x0658(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData11;            // 0x0670(0x0040)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData12;            // 0x06B0(0x0040)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x06F0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0700(0x0018)()
	struct FVector                                CallFunc_GetVelocity_ReturnValue2;                 // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Has_Been_Initd_Variable2;                  // 0x0724(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0728(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue10;        // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_IsClosed_Variable2;                        // 0x073C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue3;                 // 0x0750(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue3;             // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x076C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X4;                           // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Y4;                           // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_Z4;                           // 0x0780(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetBaseAimRotation_ReturnValue;           // 0x0784(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue4;             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue5;             // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue6;             // 0x07AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x07B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue6;                      // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x07C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x3];                                      // 0x0849(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer) == 0x000008, "Wrong alignment on ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer");
static_assert(sizeof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer) == 0x000850, "Wrong size on ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, EntryPoint) == 0x000000, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_MapRangeClamped_ReturnValue) == 0x000004, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_MapRangeClamped_ReturnValue2) == 0x000008, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_MapRangeClamped_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_IsDriven_ReturnValue) == 0x00000C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_IsDriven_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_IsReleased_ReturnValue) == 0x00000D, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_IsReleased_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_SelectFloat_ReturnValue) == 0x000010, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_X) == 0x000020, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Y) == 0x000024, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Z) == 0x000028, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue) == 0x000040, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetPlayerController_ReturnValue) == 0x000098, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetPlayerController_ReturnValue2) == 0x0000A0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetControlRotation_ReturnValue) == 0x0000A8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakRotator_Roll) == 0x0000B4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakRotator_Pitch) == 0x0000B8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakRotator_Yaw) == 0x0000BC, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000C0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_EndPlayReason) == 0x0000C4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_FClamp_ReturnValue2) == 0x0000C8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_FClamp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, m__bool_Has_Been_Initd_Variable) == 0x0000CC, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::m__bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData2) == 0x0000D0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetDriver_ReturnValue) == 0x000110, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetDriver_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00011C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_VSize2D_ReturnValue) == 0x000124, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_IsLocallyControlled_ReturnValue) == 0x000128, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x00012C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue2) == 0x000138, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData3) == 0x000150, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BooleanAND_ReturnValue2) == 0x000190, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000194, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue3) == 0x000198, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_SelectFloat_ReturnValue2) == 0x0001B0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData4) == 0x0001B8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001F8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetAltitudeFromFloor_ReturnValue) == 0x0001FC, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetAltitudeFromFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue4) == 0x000200, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData5) == 0x000218, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData5' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x000258, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00025C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue5) == 0x000260, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData6) == 0x000278, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData6' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0002B8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, m__bool_IsClosed_Variable) == 0x0002C4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::m__bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetComponentVelocity_ReturnValue) == 0x0002C8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetComponentVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_MyComp) == 0x0002D8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_Other) == 0x0002E0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_OtherComp) == 0x0002E8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_bSelfMoved) == 0x0002F0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_HitLocation) == 0x0002F4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_HitNormal) == 0x000300, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_NormalImpulse) == 0x00030C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_Event_Hit) == 0x000318, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_X2) == 0x0003A0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Y2) == 0x0003A4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Z2) == 0x0003A8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_bBlockingHit) == 0x0003AC, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003AD, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_Time) == 0x0003B0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_Location) == 0x0003B4, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_ImpactPoint) == 0x0003C0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_Normal) == 0x0003CC, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_ImpactNormal) == 0x0003D8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_PhysMat) == 0x0003E8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_HitActor) == 0x0003F0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_HitComponent) == 0x0003F8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_HitBoneName) == 0x000400, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_HitItem) == 0x000408, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_FaceIndex) == 0x00040C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_TraceStart) == 0x000410, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakHitResult_TraceEnd) == 0x00041C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000428, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_DynamicCast_AsTsl_Character) == 0x000430, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_DynamicCast_AsTsl_Character' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_DynamicCast_bSuccess) == 0x000438, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetVelocity_ReturnValue) == 0x00043C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000448, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_VSize_ReturnValue) == 0x000454, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_LessLess_VectorRotator_ReturnValue) == 0x000458, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_LessLess_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000464, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_X3) == 0x000468, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Y3) == 0x00046C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_BreakVector_Z3) == 0x000470, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000474, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_MakeVector2D_ReturnValue2) == 0x000478, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue5) == 0x000480, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_VSize2D_ReturnValue2) == 0x000484, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_VSize2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Round_ReturnValue) == 0x000488, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue5) == 0x00048C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000490, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue6) == 0x000494, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue7) == 0x000498, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Round_ReturnValue2) == 0x00049C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Round_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue6) == 0x0004A0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0004B8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData7) == 0x0004C0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData7' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Divide_FloatFloat_ReturnValue8) == 0x000500, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Divide_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_NormalizeToRange_ReturnValue) == 0x000504, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue7) == 0x000508, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_FClamp_ReturnValue3) == 0x000520, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_FClamp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData8) == 0x000528, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData8' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue8) == 0x000568, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue6) == 0x000580, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData9) == 0x000588, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData9' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue9) == 0x0005C8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue9' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_NormalizeToRange_ReturnValue2) == 0x0005E0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_NormalizeToRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData10) == 0x0005E8, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData10' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_FClamp_ReturnValue4) == 0x000628, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_FClamp_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_FClamp_ReturnValue5) == 0x00062C, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_FClamp_ReturnValue5' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue7) == 0x000630, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue8) == 0x000634, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Multiply_FloatFloat_ReturnValue9) == 0x000638, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Multiply_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue10) == 0x000640, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue10' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Conv_FloatToText_ReturnValue11) == 0x000658, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Conv_FloatToText_ReturnValue11' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData11) == 0x000670, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData11' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeStruct_FormatArgumentData12) == 0x0006B0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeStruct_FormatArgumentData12' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, K2Node_MakeArray_Array) == 0x0006F0, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Format_ReturnValue) == 0x000700, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_GetVelocity_ReturnValue2) == 0x000718, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_GetVelocity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, m__bool_Has_Been_Initd_Variable2) == 0x000724, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::m__bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000728, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer, CallFunc_Dot_VectorVector_ReturnValue) == 0x000734, "Member 'ParachutePlayer_C_ExecuteUbergraph_ParachutePlayer::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
