#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerGroupWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerGroupWidget.PlayerGroupWidget_C
// 0x0038 (0x0278 - 0x0240)
class UPlayerGroupWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PlayerList;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                PlayerListBG;                                      // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	TArray<class UPlayerInfoWidget_C*>            PlayerInfoWidgetList;                              // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bSelect;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               BGMaterial;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlayerGroupWidget(int32 EntryPoint);
	void Construct();
	void AddPlayerWidget(class UPlayerInfoWidget_C* PlayerInfo);
	void Clear();
	void On_PlayerListBorder_Prepass_0(class UWidget* BoundWidget);
	void On_PlayerListBG_Prepass_0(class UWidget* BoundWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerGroupWidget_C">();
	}
	static class UPlayerGroupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerGroupWidget_C>();
	}
};
static_assert(alignof(UPlayerGroupWidget_C) == 0x000008, "Wrong alignment on UPlayerGroupWidget_C");
static_assert(sizeof(UPlayerGroupWidget_C) == 0x000278, "Wrong size on UPlayerGroupWidget_C");
static_assert(offsetof(UPlayerGroupWidget_C, UberGraphFrame) == 0x000240, "Member 'UPlayerGroupWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerGroupWidget_C, PlayerList) == 0x000248, "Member 'UPlayerGroupWidget_C::PlayerList' has a wrong offset!");
static_assert(offsetof(UPlayerGroupWidget_C, PlayerListBG) == 0x000250, "Member 'UPlayerGroupWidget_C::PlayerListBG' has a wrong offset!");
static_assert(offsetof(UPlayerGroupWidget_C, PlayerInfoWidgetList) == 0x000258, "Member 'UPlayerGroupWidget_C::PlayerInfoWidgetList' has a wrong offset!");
static_assert(offsetof(UPlayerGroupWidget_C, bSelect) == 0x000268, "Member 'UPlayerGroupWidget_C::bSelect' has a wrong offset!");
static_assert(offsetof(UPlayerGroupWidget_C, BGMaterial) == 0x000270, "Member 'UPlayerGroupWidget_C::BGMaterial' has a wrong offset!");

}

