#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualityComboBox

#include "Basic.hpp"

#include "ComboBoxOption_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function QualityComboBox.QualityComboBox_C.ExecuteUbergraph_QualityComboBox
// 0x0020 (0x0020 - 0x0000)
struct QualityComboBox_C_ExecuteUbergraph_QualityComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0008(0x0010)(ZeroConstructor)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_ExecuteUbergraph_QualityComboBox) == 0x000008, "Wrong alignment on QualityComboBox_C_ExecuteUbergraph_QualityComboBox");
static_assert(sizeof(QualityComboBox_C_ExecuteUbergraph_QualityComboBox) == 0x000020, "Wrong size on QualityComboBox_C_ExecuteUbergraph_QualityComboBox");
static_assert(offsetof(QualityComboBox_C_ExecuteUbergraph_QualityComboBox, EntryPoint) == 0x000000, "Member 'QualityComboBox_C_ExecuteUbergraph_QualityComboBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_ExecuteUbergraph_QualityComboBox, K2Node_ComponentBoundEvent_SelectedItem) == 0x000008, "Member 'QualityComboBox_C_ExecuteUbergraph_QualityComboBox::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_ExecuteUbergraph_QualityComboBox, K2Node_ComponentBoundEvent_SelectionType) == 0x000018, "Member 'QualityComboBox_C_ExecuteUbergraph_QualityComboBox::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(Parm, ZeroConstructor)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'QualityComboBox_C_BndEvt__ComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.AddOption
// 0x0058 (0x0058 - 0x0000)
struct QualityComboBox_C_AddOption final
{
public:
	class FString                                 OptionName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor)
	class FText                                   DisplayOptionName;                                 // 0x0010(0x0018)(Parm)
	struct FComboBoxOption                        K2Node_MakeStruct_ComboBoxOption;                  // 0x0028(0x0028)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_AddOption) == 0x000008, "Wrong alignment on QualityComboBox_C_AddOption");
static_assert(sizeof(QualityComboBox_C_AddOption) == 0x000058, "Wrong size on QualityComboBox_C_AddOption");
static_assert(offsetof(QualityComboBox_C_AddOption, OptionName) == 0x000000, "Member 'QualityComboBox_C_AddOption::OptionName' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_AddOption, DisplayOptionName) == 0x000010, "Member 'QualityComboBox_C_AddOption::DisplayOptionName' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_AddOption, K2Node_MakeStruct_ComboBoxOption) == 0x000028, "Member 'QualityComboBox_C_AddOption::K2Node_MakeStruct_ComboBoxOption' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_AddOption, CallFunc_Array_AddUnique_ReturnValue) == 0x000050, "Member 'QualityComboBox_C_AddOption::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.SetSelectedOption
// 0x0010 (0x0010 - 0x0000)
struct QualityComboBox_C_SetSelectedOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor)
};
static_assert(alignof(QualityComboBox_C_SetSelectedOption) == 0x000008, "Wrong alignment on QualityComboBox_C_SetSelectedOption");
static_assert(sizeof(QualityComboBox_C_SetSelectedOption) == 0x000010, "Wrong size on QualityComboBox_C_SetSelectedOption");
static_assert(offsetof(QualityComboBox_C_SetSelectedOption, Option) == 0x000000, "Member 'QualityComboBox_C_SetSelectedOption::Option' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.RemoveOption
// 0x0060 (0x0060 - 0x0000)
struct QualityComboBox_C_RemoveOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(Parm, ZeroConstructor)
	bool                                          m__bool_True_if_break_was_hit_Variable;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveOption_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComboBoxOption                        CallFunc_Array_Get_Item;                           // 0x0030(0x0028)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_RemoveOption) == 0x000008, "Wrong alignment on QualityComboBox_C_RemoveOption");
static_assert(sizeof(QualityComboBox_C_RemoveOption) == 0x000060, "Wrong size on QualityComboBox_C_RemoveOption");
static_assert(offsetof(QualityComboBox_C_RemoveOption, Option) == 0x000000, "Member 'QualityComboBox_C_RemoveOption::Option' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, m__bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'QualityComboBox_C_RemoveOption::m__bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, m__int_Array_Index_Variable) == 0x000014, "Member 'QualityComboBox_C_RemoveOption::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'QualityComboBox_C_RemoveOption::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, m__int_Loop_Counter_Variable) == 0x00001C, "Member 'QualityComboBox_C_RemoveOption::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'QualityComboBox_C_RemoveOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'QualityComboBox_C_RemoveOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_RemoveOption_ReturnValue) == 0x000028, "Member 'QualityComboBox_C_RemoveOption::CallFunc_RemoveOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'QualityComboBox_C_RemoveOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_Array_Get_Item) == 0x000030, "Member 'QualityComboBox_C_RemoveOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_BooleanAND_ReturnValue) == 0x000058, "Member 'QualityComboBox_C_RemoveOption::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_RemoveOption, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000059, "Member 'QualityComboBox_C_RemoveOption::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.On_ComboBox_GenerateWidget_0
// 0x0060 (0x0060 - 0x0000)
struct QualityComboBox_C_On_ComboBox_GenerateWidget_0 final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(Parm, ZeroConstructor)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UComboBoxOptionTextWidget_C*            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FComboBoxOption                        CallFunc_Array_Get_Item;                           // 0x0030(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_On_ComboBox_GenerateWidget_0) == 0x000008, "Wrong alignment on QualityComboBox_C_On_ComboBox_GenerateWidget_0");
static_assert(sizeof(QualityComboBox_C_On_ComboBox_GenerateWidget_0) == 0x000060, "Wrong size on QualityComboBox_C_On_ComboBox_GenerateWidget_0");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, Item) == 0x000000, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::Item' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, ReturnValue) == 0x000010, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, m__int_Array_Index_Variable) == 0x000018, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, m__int_Loop_Counter_Variable) == 0x00001C, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_Create_ReturnValue) == 0x000028, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_Array_Get_Item) == 0x000030, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_On_ComboBox_GenerateWidget_0, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00005D, "Member 'QualityComboBox_C_On_ComboBox_GenerateWidget_0::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.Get_ComboBox_bIsEnabled_0
// 0x0001 (0x0001 - 0x0000)
struct QualityComboBox_C_Get_ComboBox_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_Get_ComboBox_bIsEnabled_0) == 0x000001, "Wrong alignment on QualityComboBox_C_Get_ComboBox_bIsEnabled_0");
static_assert(sizeof(QualityComboBox_C_Get_ComboBox_bIsEnabled_0) == 0x000001, "Wrong size on QualityComboBox_C_Get_ComboBox_bIsEnabled_0");
static_assert(offsetof(QualityComboBox_C_Get_ComboBox_bIsEnabled_0, ReturnValue) == 0x000000, "Member 'QualityComboBox_C_Get_ComboBox_bIsEnabled_0::ReturnValue' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.GetDisplayTextByOption
// 0x0070 (0x0070 - 0x0000)
struct QualityComboBox_C_GetDisplayTextByOption final
{
public:
	class FText                                   DisplayText;                                       // 0x0000(0x0018)(Parm, OutParm)
	int32                                         m__int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0028(0x0010)(ZeroConstructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FComboBoxOption                        CallFunc_Array_Get_Item;                           // 0x0040(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QualityComboBox_C_GetDisplayTextByOption) == 0x000008, "Wrong alignment on QualityComboBox_C_GetDisplayTextByOption");
static_assert(sizeof(QualityComboBox_C_GetDisplayTextByOption) == 0x000070, "Wrong size on QualityComboBox_C_GetDisplayTextByOption");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, DisplayText) == 0x000000, "Member 'QualityComboBox_C_GetDisplayTextByOption::DisplayText' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, m__int_Array_Index_Variable) == 0x000018, "Member 'QualityComboBox_C_GetDisplayTextByOption::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, m__int_Loop_Counter_Variable) == 0x00001C, "Member 'QualityComboBox_C_GetDisplayTextByOption::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_GetSelectedOption_SelectedOption) == 0x000028, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_Array_Get_Item) == 0x000040, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetDisplayTextByOption, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000069, "Member 'QualityComboBox_C_GetDisplayTextByOption::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function QualityComboBox.QualityComboBox_C.GetSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct QualityComboBox_C_GetSelectedOption final
{
public:
	class FString                                 SelectedOption;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor)
};
static_assert(alignof(QualityComboBox_C_GetSelectedOption) == 0x000008, "Wrong alignment on QualityComboBox_C_GetSelectedOption");
static_assert(sizeof(QualityComboBox_C_GetSelectedOption) == 0x000020, "Wrong size on QualityComboBox_C_GetSelectedOption");
static_assert(offsetof(QualityComboBox_C_GetSelectedOption, SelectedOption) == 0x000000, "Member 'QualityComboBox_C_GetSelectedOption::SelectedOption' has a wrong offset!");
static_assert(offsetof(QualityComboBox_C_GetSelectedOption, CallFunc_GetSelectedOption_ReturnValue) == 0x000010, "Member 'QualityComboBox_C_GetSelectedOption::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");

}

