#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QualitySettingsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseOptionWidget_classes.hpp"
#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QualitySettingsWidget.QualitySettingsWidget_C
// 0x0068 (0x02E0 - 0x0278)
class UQualitySettingsWidget_C final : public UBaseOptionWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQualityComboBox_C*                     AnitiAliasingComboBox;                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UChildOptionTitleWidget_C*              ChildOptionTitleWidget;                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     EffectComboBox;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     FoliageComboBox;                                   // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     MainQualityComboBox;                               // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTslCheckBox_C*                         MotionBlurCheckBox;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     PostProcessComboBox;                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualitySliderWidget_C*                 ScreenScaleSlider;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     ShadowsComboBox;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     TextureComboBox;                                   // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     ViewDistanceComboBox;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTslCheckBox_C*                         VSyncCheckBox;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_QualitySettingsWidget(int32 EntryPoint);
	void Construct();
	void OnReset();
	void BndEvt__FoliageComboBox_K2Node_ComponentBoundEvent_2285_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__EffectComboBox_K2Node_ComponentBoundEvent_2277_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__TextureComboBox_K2Node_ComponentBoundEvent_2270_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__ShadowsComboBox_K2Node_ComponentBoundEvent_2264_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__PostProcessComboBox_K2Node_ComponentBoundEvent_2259_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__AnitiAliasingComboBox_K2Node_ComponentBoundEvent_2255_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__ViewDistanceComboBox_K2Node_ComponentBoundEvent_2029_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void BndEvt__MainQualityComboBox_K2Node_ComponentBoundEvent_663_OnSelectionChanged__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void OnApply();
	void OnDefault();
	void InitQualitySettingsWidget();
	void SetQualityLevelByComboBox(EQualityType QualityType);
	void UpdateMainOptionStringByComboBox();
	void UpdateOtionStringByUserStting(EQualityType Selection);
	void SettingDefautl();
	bool GetbIsEnabled_0();

	void GetScreenScaleValue_Slider(float* ScreenScale) const;
	bool IsChanged() const;
	void GetQualityLevelByComboBox(EQualityType QualityType, int32* QualityLevel) const;
	void GetComboBox(EQualityType Selection, class UQualityComboBox_C** ComboBox) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QualitySettingsWidget_C">();
	}
	static class UQualitySettingsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQualitySettingsWidget_C>();
	}
};
static_assert(alignof(UQualitySettingsWidget_C) == 0x000008, "Wrong alignment on UQualitySettingsWidget_C");
static_assert(sizeof(UQualitySettingsWidget_C) == 0x0002E0, "Wrong size on UQualitySettingsWidget_C");
static_assert(offsetof(UQualitySettingsWidget_C, UberGraphFrame) == 0x000278, "Member 'UQualitySettingsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, AnitiAliasingComboBox) == 0x000280, "Member 'UQualitySettingsWidget_C::AnitiAliasingComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, ChildOptionTitleWidget) == 0x000288, "Member 'UQualitySettingsWidget_C::ChildOptionTitleWidget' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, EffectComboBox) == 0x000290, "Member 'UQualitySettingsWidget_C::EffectComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, FoliageComboBox) == 0x000298, "Member 'UQualitySettingsWidget_C::FoliageComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, MainQualityComboBox) == 0x0002A0, "Member 'UQualitySettingsWidget_C::MainQualityComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, MotionBlurCheckBox) == 0x0002A8, "Member 'UQualitySettingsWidget_C::MotionBlurCheckBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, PostProcessComboBox) == 0x0002B0, "Member 'UQualitySettingsWidget_C::PostProcessComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, ScreenScaleSlider) == 0x0002B8, "Member 'UQualitySettingsWidget_C::ScreenScaleSlider' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, ShadowsComboBox) == 0x0002C0, "Member 'UQualitySettingsWidget_C::ShadowsComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, TextureComboBox) == 0x0002C8, "Member 'UQualitySettingsWidget_C::TextureComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, ViewDistanceComboBox) == 0x0002D0, "Member 'UQualitySettingsWidget_C::ViewDistanceComboBox' has a wrong offset!");
static_assert(offsetof(UQualitySettingsWidget_C, VSyncCheckBox) == 0x0002D8, "Member 'UQualitySettingsWidget_C::VSyncCheckBox' has a wrong offset!");

}

