#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReportPlayerWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function ReportPlayerWidget.ReportPlayerWidget_C.ExecuteUbergraph_ReportPlayerWidget
// 0x00D8 (0x00D8 - 0x0000)
struct ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_True_if_break_was_hit_Variable;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0018(0x0010)(ZeroConstructor)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FReportCauseData>               CallFunc_GetReportCauses_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReportCauseData                       CallFunc_Array_Get_Item;                           // 0x0048(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue2;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslHUD*                                K2Node_DynamicCast_AsTsl_HUD2;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget) == 0x000008, "Wrong alignment on ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget");
static_assert(sizeof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget) == 0x0000D8, "Wrong size on ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, EntryPoint) == 0x000000, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, m__bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::m__bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, m__int_Array_Index_Variable) == 0x000008, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, m__int_Loop_Counter_Variable) == 0x000010, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_ComponentBoundEvent_SelectedItem) == 0x000018, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_ComponentBoundEvent_SelectionType) == 0x000028, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_GetReportCauses_ReturnValue) == 0x000030, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_GetReportCauses_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Array_Get_Item) == 0x000048, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000080, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_GetHUD_ReturnValue) == 0x000090, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000098, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_AsTsl_HUD) == 0x0000A0, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_AsTsl_HUD' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, CallFunc_GetHUD_ReturnValue2) == 0x0000B0, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::CallFunc_GetHUD_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_AsTsl_HUD2) == 0x0000B8, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_AsTsl_HUD2' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x0000C8, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget, K2Node_DynamicCast_bSuccess3) == 0x0000D0, "Member 'ReportPlayerWidget_C_ExecuteUbergraph_ReportPlayerWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function ReportPlayerWidget.ReportPlayerWidget_C.BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(Parm, ZeroConstructor)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'ReportPlayerWidget_C_BndEvt__ReportCausesComboBox_K2Node_ComponentBoundEvent_59_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function ReportPlayerWidget.ReportPlayerWidget_C.GetbIsEnabled_0
// 0x0003 (0x0003 - 0x0000)
struct ReportPlayerWidget_C_GetbIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReportPlayerWidget_C_GetbIsEnabled_0) == 0x000001, "Wrong alignment on ReportPlayerWidget_C_GetbIsEnabled_0");
static_assert(sizeof(ReportPlayerWidget_C_GetbIsEnabled_0) == 0x000003, "Wrong size on ReportPlayerWidget_C_GetbIsEnabled_0");
static_assert(offsetof(ReportPlayerWidget_C_GetbIsEnabled_0, ReturnValue) == 0x000000, "Member 'ReportPlayerWidget_C_GetbIsEnabled_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_GetbIsEnabled_0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'ReportPlayerWidget_C_GetbIsEnabled_0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_GetbIsEnabled_0, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'ReportPlayerWidget_C_GetbIsEnabled_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function ReportPlayerWidget.ReportPlayerWidget_C.InitSubjectToReport
// 0x0058 (0x0058 - 0x0000)
struct ReportPlayerWidget_C_InitSubjectToReport final
{
public:
	bool                                          m__bool_True_if_break_was_hit_Variable;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Loop_Counter_Variable;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSubjectToReport>               CallFunc_GetSubjectToReport_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	ESubjectToReport                              CallFunc_GetSubjectToReportType_ReturnValue;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSubjectToReport                       CallFunc_Array_Get_Item;                           // 0x0030(0x0020)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ReportPlayerWidget_C_InitSubjectToReport) == 0x000008, "Wrong alignment on ReportPlayerWidget_C_InitSubjectToReport");
static_assert(sizeof(ReportPlayerWidget_C_InitSubjectToReport) == 0x000058, "Wrong size on ReportPlayerWidget_C_InitSubjectToReport");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, m__bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'ReportPlayerWidget_C_InitSubjectToReport::m__bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, m__int_Array_Index_Variable) == 0x000004, "Member 'ReportPlayerWidget_C_InitSubjectToReport::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, m__int_Loop_Counter_Variable) == 0x00000C, "Member 'ReportPlayerWidget_C_InitSubjectToReport::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_GetSubjectToReport_ReturnValue) == 0x000018, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_GetSubjectToReport_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_GetSubjectToReportType_ReturnValue) == 0x000028, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_GetSubjectToReportType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_Array_Get_Item) == 0x000030, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitSubjectToReport, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'ReportPlayerWidget_C_InitSubjectToReport::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function ReportPlayerWidget.ReportPlayerWidget_C.InitComboboxSetting
// 0x0058 (0x0058 - 0x0000)
struct ReportPlayerWidget_C_InitComboboxSetting final
{
public:
	int32                                         m__int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FReportCauseData>               CallFunc_GetReportCauses_ReturnValue;              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	struct FReportCauseData                       CallFunc_Array_Get_Item;                           // 0x0020(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor)
};
static_assert(alignof(ReportPlayerWidget_C_InitComboboxSetting) == 0x000008, "Wrong alignment on ReportPlayerWidget_C_InitComboboxSetting");
static_assert(sizeof(ReportPlayerWidget_C_InitComboboxSetting) == 0x000058, "Wrong size on ReportPlayerWidget_C_InitComboboxSetting");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, m__int_Array_Index_Variable) == 0x000000, "Member 'ReportPlayerWidget_C_InitComboboxSetting::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, m__int_Loop_Counter_Variable) == 0x000004, "Member 'ReportPlayerWidget_C_InitComboboxSetting::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_GetReportCauses_ReturnValue) == 0x000010, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_GetReportCauses_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_Array_Get_Item) == 0x000020, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000045, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitComboboxSetting, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'ReportPlayerWidget_C_InitComboboxSetting::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function ReportPlayerWidget.ReportPlayerWidget_C.InitPlayerNameSetting
// 0x0070 (0x0070 - 0x0000)
struct ReportPlayerWidget_C_InitPlayerNameSetting final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslPlayerController*                   K2Node_DynamicCast_AsTsl_Player_Controller;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESubjectToReport                              CallFunc_GetSubjectToReportType_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSpectatingPlayerName_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	class FString                                 CallFunc_GetKillerName_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0058(0x0018)()
};
static_assert(alignof(ReportPlayerWidget_C_InitPlayerNameSetting) == 0x000008, "Wrong alignment on ReportPlayerWidget_C_InitPlayerNameSetting");
static_assert(sizeof(ReportPlayerWidget_C_InitPlayerNameSetting) == 0x000070, "Wrong size on ReportPlayerWidget_C_InitPlayerNameSetting");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, K2Node_DynamicCast_AsTsl_Player_Controller) == 0x000008, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::K2Node_DynamicCast_AsTsl_Player_Controller' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_GetSubjectToReportType_ReturnValue) == 0x000011, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_GetSubjectToReportType_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_GetSpectatingPlayerName_ReturnValue) == 0x000018, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_GetSpectatingPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_GetKillerName_ReturnValue) == 0x000048, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_GetKillerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ReportPlayerWidget_C_InitPlayerNameSetting, CallFunc_Conv_StringToText_ReturnValue2) == 0x000058, "Member 'ReportPlayerWidget_C_InitPlayerNameSetting::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

}

