#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlotWidgetBaseInterface

#include "Basic.hpp"


namespace SDK::Params
{

// Function SlotWidgetBaseInterface.SlotWidgetBaseInterface_C.GetSlotItem
// 0x0010 (0x0010 - 0x0000)
struct SlotWidgetBaseInterface_C_GetSlotItem final
{
public:
	TScriptInterface<class ISlotInterface>        SlotItem;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlotWidgetBaseInterface_C_GetSlotItem) == 0x000008, "Wrong alignment on SlotWidgetBaseInterface_C_GetSlotItem");
static_assert(sizeof(SlotWidgetBaseInterface_C_GetSlotItem) == 0x000010, "Wrong size on SlotWidgetBaseInterface_C_GetSlotItem");
static_assert(offsetof(SlotWidgetBaseInterface_C_GetSlotItem, SlotItem) == 0x000000, "Member 'SlotWidgetBaseInterface_C_GetSlotItem::SlotItem' has a wrong offset!");

// Function SlotWidgetBaseInterface.SlotWidgetBaseInterface_C.GetSlotContainer
// 0x0010 (0x0010 - 0x0000)
struct SlotWidgetBaseInterface_C_GetSlotContainer final
{
public:
	TScriptInterface<class ISlotContainerInterface> SlotContainer;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SlotWidgetBaseInterface_C_GetSlotContainer) == 0x000008, "Wrong alignment on SlotWidgetBaseInterface_C_GetSlotContainer");
static_assert(sizeof(SlotWidgetBaseInterface_C_GetSlotContainer) == 0x000010, "Wrong size on SlotWidgetBaseInterface_C_GetSlotContainer");
static_assert(offsetof(SlotWidgetBaseInterface_C_GetSlotContainer, SlotContainer) == 0x000000, "Member 'SlotWidgetBaseInterface_C_GetSlotContainer::SlotContainer' has a wrong offset!");

}

