#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmallEquipmentSlotWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.ExecuteUbergraph_SmallEquipmentSlotWidget
// 0x0030 (0x0030 - 0x0000)
struct SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_Event_Item;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         K2Node_MakeStruct_EquipPosition;                   // 0x0010(0x0008)()
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget");
static_assert(sizeof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget) == 0x000030, "Wrong size on SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, EntryPoint) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, K2Node_Event_Item) == 0x000008, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, K2Node_MakeStruct_EquipPosition) == 0x000010, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::K2Node_MakeStruct_EquipPosition' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, CallFunc_GetItem_ReturnValue) == 0x000018, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::CallFunc_GetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'SmallEquipmentSlotWidget_C_ExecuteUbergraph_SmallEquipmentSlotWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.OnUpdateItem
// 0x0008 (0x0008 - 0x0000)
struct SmallEquipmentSlotWidget_C_OnUpdateItem final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_OnUpdateItem) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_OnUpdateItem");
static_assert(sizeof(SmallEquipmentSlotWidget_C_OnUpdateItem) == 0x000008, "Wrong size on SmallEquipmentSlotWidget_C_OnUpdateItem");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnUpdateItem, Item_0) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_OnUpdateItem::Item_0' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.GetSlotName
// 0x0048 (0x0048 - 0x0000)
struct SmallEquipmentSlotWidget_C_GetSlotName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotName_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetSlotName_ReturnValue;                  // 0x0030(0x0018)()
};
static_assert(alignof(SmallEquipmentSlotWidget_C_GetSlotName) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_GetSlotName");
static_assert(sizeof(SmallEquipmentSlotWidget_C_GetSlotName) == 0x000048, "Wrong size on SmallEquipmentSlotWidget_C_GetSlotName");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotName, ReturnValue) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_GetSlotName::ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotName, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SmallEquipmentSlotWidget_C_GetSlotName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotName, CallFunc_GetSlotName_self_CastInput) == 0x000020, "Member 'SmallEquipmentSlotWidget_C_GetSlotName::CallFunc_GetSlotName_self_CastInput' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotName, CallFunc_GetSlotName_ReturnValue) == 0x000030, "Member 'SmallEquipmentSlotWidget_C_GetSlotName::CallFunc_GetSlotName_ReturnValue' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.OnDragDetected
// 0x00C0 (0x00C0 - 0x0000)
struct SmallEquipmentSlotWidget_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            CallFunc_CreateTslDragDropOperation_Bp_OutOperation; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_OnDragDetected) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_OnDragDetected");
static_assert(sizeof(SmallEquipmentSlotWidget_C_OnDragDetected) == 0x0000C0, "Wrong size on SmallEquipmentSlotWidget_C_OnDragDetected");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'SmallEquipmentSlotWidget_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnDragDetected, Operation) == 0x0000B0, "Member 'SmallEquipmentSlotWidget_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnDragDetected, CallFunc_CreateTslDragDropOperation_Bp_OutOperation) == 0x0000B8, "Member 'SmallEquipmentSlotWidget_C_OnDragDetected::CallFunc_CreateTslDragDropOperation_Bp_OutOperation' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.GetIcon
// 0x0210 (0x0210 - 0x0000)
struct SmallEquipmentSlotWidget_C_GetIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0090(0x0090)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               CallFunc_GetIconTexture_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetIconSizeRatio_self_CastInput;          // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetIconSizeRatio_ReturnValue;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0150(0x0028)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x0180(0x0090)()
};
static_assert(alignof(SmallEquipmentSlotWidget_C_GetIcon) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_GetIcon");
static_assert(sizeof(SmallEquipmentSlotWidget_C_GetIcon) == 0x000210, "Wrong size on SmallEquipmentSlotWidget_C_GetIcon");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, ReturnValue) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_GetIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, K2Node_MakeStruct_SlateBrush) == 0x000090, "Member 'SmallEquipmentSlotWidget_C_GetIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_GetIconTexture_ReturnValue) == 0x000128, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_GetIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_GetIconSizeRatio_self_CastInput) == 0x000130, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_GetIconSizeRatio_self_CastInput' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_GetIconSizeRatio_ReturnValue) == 0x000140, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_GetIconSizeRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_IsValid_ReturnValue2) == 0x000144, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000148, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00014C, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, K2Node_MakeStruct_SlateColor) == 0x000150, "Member 'SmallEquipmentSlotWidget_C_GetIcon::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000178, "Member 'SmallEquipmentSlotWidget_C_GetIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetIcon, K2Node_MakeStruct_SlateBrush2) == 0x000180, "Member 'SmallEquipmentSlotWidget_C_GetIcon::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.OnPreviewMouseButtonDown
// 0x0430 (0x0430 - 0x0000)
struct SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsCharacterCasting_IsCasting;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00A8)()
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0210(0x00A8)()
	TScriptInterface<class ISlotContainerInterface> CallFunc_DoSlotActionDefault_self_CastInput;       // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_DoSlotActionDefault_Slot_CastInput;       // 0x02C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x02D8(0x00A8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue2;                   // 0x0388(0x00A8)()
};
static_assert(alignof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown");
static_assert(sizeof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown) == 0x000430, "Wrong size on SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, MyGeometry) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, MouseEvent) == 0x000038, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_IsCharacterCasting_IsCasting) == 0x000158, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_IsCharacterCasting_IsCasting' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x000208, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000210, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DoSlotActionDefault_self_CastInput) == 0x0002B8, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DoSlotActionDefault_self_CastInput' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_DoSlotActionDefault_Slot_CastInput) == 0x0002C8, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_DoSlotActionDefault_Slot_CastInput' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x0002D8, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_IsValid_ReturnValue) == 0x000380, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown, CallFunc_Unhandled_ReturnValue2) == 0x000388, "Member 'SmallEquipmentSlotWidget_C_OnPreviewMouseButtonDown::CallFunc_Unhandled_ReturnValue2' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.GetItem_Bp
// 0x0018 (0x0018 - 0x0000)
struct SmallEquipmentSlotWidget_C_GetItem_Bp final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         K2Node_MakeStruct_EquipPosition;                   // 0x0008(0x0008)()
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_GetItem_Bp) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_GetItem_Bp");
static_assert(sizeof(SmallEquipmentSlotWidget_C_GetItem_Bp) == 0x000018, "Wrong size on SmallEquipmentSlotWidget_C_GetItem_Bp");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetItem_Bp, Item_0) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_GetItem_Bp::Item_0' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetItem_Bp, K2Node_MakeStruct_EquipPosition) == 0x000008, "Member 'SmallEquipmentSlotWidget_C_GetItem_Bp::K2Node_MakeStruct_EquipPosition' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetItem_Bp, CallFunc_GetItem_ReturnValue) == 0x000010, "Member 'SmallEquipmentSlotWidget_C_GetItem_Bp::CallFunc_GetItem_ReturnValue' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.On_FocusColorBG_Prepass_0
// 0x0008 (0x0008 - 0x0000)
struct SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0");
static_assert(sizeof(SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0) == 0x000008, "Wrong size on SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0");
static_assert(offsetof(SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0, BoundWidget) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_On_FocusColorBG_Prepass_0::BoundWidget' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.SetFocus
// 0x0002 (0x0002 - 0x0000)
struct SmallEquipmentSlotWidget_C_SetFocus final
{
public:
	bool                                          NewFocus;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_SetFocus) == 0x000001, "Wrong alignment on SmallEquipmentSlotWidget_C_SetFocus");
static_assert(sizeof(SmallEquipmentSlotWidget_C_SetFocus) == 0x000002, "Wrong size on SmallEquipmentSlotWidget_C_SetFocus");
static_assert(offsetof(SmallEquipmentSlotWidget_C_SetFocus, NewFocus) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_SetFocus::NewFocus' has a wrong offset!");
static_assert(offsetof(SmallEquipmentSlotWidget_C_SetFocus, ReturnValue) == 0x000001, "Member 'SmallEquipmentSlotWidget_C_SetFocus::ReturnValue' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.GetSlotContainer
// 0x0010 (0x0010 - 0x0000)
struct SmallEquipmentSlotWidget_C_GetSlotContainer final
{
public:
	TScriptInterface<class ISlotContainerInterface> SlotContainer;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_GetSlotContainer) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_GetSlotContainer");
static_assert(sizeof(SmallEquipmentSlotWidget_C_GetSlotContainer) == 0x000010, "Wrong size on SmallEquipmentSlotWidget_C_GetSlotContainer");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotContainer, SlotContainer) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_GetSlotContainer::SlotContainer' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.GetSlotItem
// 0x0010 (0x0010 - 0x0000)
struct SmallEquipmentSlotWidget_C_GetSlotItem final
{
public:
	TScriptInterface<class ISlotInterface>        SlotItem;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_GetSlotItem) == 0x000008, "Wrong alignment on SmallEquipmentSlotWidget_C_GetSlotItem");
static_assert(sizeof(SmallEquipmentSlotWidget_C_GetSlotItem) == 0x000010, "Wrong size on SmallEquipmentSlotWidget_C_GetSlotItem");
static_assert(offsetof(SmallEquipmentSlotWidget_C_GetSlotItem, SlotItem) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_GetSlotItem::SlotItem' has a wrong offset!");

// Function SmallEquipmentSlotWidget.SmallEquipmentSlotWidget_C.IsFocus
// 0x0001 (0x0001 - 0x0000)
struct SmallEquipmentSlotWidget_C_IsFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SmallEquipmentSlotWidget_C_IsFocus) == 0x000001, "Wrong alignment on SmallEquipmentSlotWidget_C_IsFocus");
static_assert(sizeof(SmallEquipmentSlotWidget_C_IsFocus) == 0x000001, "Wrong size on SmallEquipmentSlotWidget_C_IsFocus");
static_assert(offsetof(SmallEquipmentSlotWidget_C_IsFocus, ReturnValue) == 0x000000, "Member 'SmallEquipmentSlotWidget_C_IsFocus::ReturnValue' has a wrong offset!");

}

