#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundOptionWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function SoundOptionWidget.SoundOptionWidget_C.ExecuteUbergraph_SoundOptionWidget
// 0x0008 (0x0008 - 0x0000)
struct SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForChineseLicensing_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_VoiceSetting_ReturnValue;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget) == 0x000004, "Wrong alignment on SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget");
static_assert(sizeof(SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget) == 0x000008, "Wrong size on SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget");
static_assert(offsetof(SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget, EntryPoint) == 0x000000, "Member 'SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget, CallFunc_IsForChineseLicensing_ReturnValue) == 0x000004, "Member 'SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget::CallFunc_IsForChineseLicensing_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget, CallFunc_IsEnable_VoiceSetting_ReturnValue) == 0x000005, "Member 'SoundOptionWidget_C_ExecuteUbergraph_SoundOptionWidget::CallFunc_IsEnable_VoiceSetting_ReturnValue' has a wrong offset!");

// Function SoundOptionWidget.SoundOptionWidget_C.IsChanged
// 0x0004 (0x0004 - 0x0000)
struct SoundOptionWidget_C_IsChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChanged_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChanged_ReturnValue2;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundOptionWidget_C_IsChanged) == 0x000001, "Wrong alignment on SoundOptionWidget_C_IsChanged");
static_assert(sizeof(SoundOptionWidget_C_IsChanged) == 0x000004, "Wrong size on SoundOptionWidget_C_IsChanged");
static_assert(offsetof(SoundOptionWidget_C_IsChanged, ReturnValue) == 0x000000, "Member 'SoundOptionWidget_C_IsChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsChanged, CallFunc_IsChanged_ReturnValue) == 0x000001, "Member 'SoundOptionWidget_C_IsChanged::CallFunc_IsChanged_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsChanged, CallFunc_IsChanged_ReturnValue2) == 0x000002, "Member 'SoundOptionWidget_C_IsChanged::CallFunc_IsChanged_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsChanged, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'SoundOptionWidget_C_IsChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function SoundOptionWidget.SoundOptionWidget_C.IsEnable_VoiceSetting
// 0x0005 (0x0005 - 0x0000)
struct SoundOptionWidget_C_IsEnable_VoiceSetting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForChineseLicensing_ReturnValue;        // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsESports_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundOptionWidget_C_IsEnable_VoiceSetting) == 0x000001, "Wrong alignment on SoundOptionWidget_C_IsEnable_VoiceSetting");
static_assert(sizeof(SoundOptionWidget_C_IsEnable_VoiceSetting) == 0x000005, "Wrong size on SoundOptionWidget_C_IsEnable_VoiceSetting");
static_assert(offsetof(SoundOptionWidget_C_IsEnable_VoiceSetting, ReturnValue) == 0x000000, "Member 'SoundOptionWidget_C_IsEnable_VoiceSetting::ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsEnable_VoiceSetting, CallFunc_IsForChineseLicensing_ReturnValue) == 0x000001, "Member 'SoundOptionWidget_C_IsEnable_VoiceSetting::CallFunc_IsForChineseLicensing_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsEnable_VoiceSetting, CallFunc_IsESports_ReturnValue) == 0x000002, "Member 'SoundOptionWidget_C_IsEnable_VoiceSetting::CallFunc_IsESports_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsEnable_VoiceSetting, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'SoundOptionWidget_C_IsEnable_VoiceSetting::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoundOptionWidget_C_IsEnable_VoiceSetting, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'SoundOptionWidget_C_IsEnable_VoiceSetting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function SoundOptionWidget.SoundOptionWidget_C.IsKeyUp
// 0x0001 (0x0001 - 0x0000)
struct SoundOptionWidget_C_IsKeyUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoundOptionWidget_C_IsKeyUp) == 0x000001, "Wrong alignment on SoundOptionWidget_C_IsKeyUp");
static_assert(sizeof(SoundOptionWidget_C_IsKeyUp) == 0x000001, "Wrong size on SoundOptionWidget_C_IsKeyUp");
static_assert(offsetof(SoundOptionWidget_C_IsKeyUp, ReturnValue) == 0x000000, "Member 'SoundOptionWidget_C_IsKeyUp::ReturnValue' has a wrong offset!");

}

