#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundOptionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseOptionWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SoundOptionWidget.SoundOptionWidget_C
// 0x0018 (0x0290 - 0x0278)
class USoundOptionWidget_C final : public UBaseOptionWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USoundSettingWidget_C*                  SoundSettingWidget;                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVoiceSettingWidget_C*                  VoiceSettingWidget;                                // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_SoundOptionWidget(int32 EntryPoint);
	void Construct();
	void OnReset();
	void OnDefault();
	void OnApply();
	bool IsChanged();
	bool IsEnable_VoiceSetting();

	bool IsKeyUp() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SoundOptionWidget_C">();
	}
	static class USoundOptionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundOptionWidget_C>();
	}
};
static_assert(alignof(USoundOptionWidget_C) == 0x000008, "Wrong alignment on USoundOptionWidget_C");
static_assert(sizeof(USoundOptionWidget_C) == 0x000290, "Wrong size on USoundOptionWidget_C");
static_assert(offsetof(USoundOptionWidget_C, UberGraphFrame) == 0x000278, "Member 'USoundOptionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USoundOptionWidget_C, SoundSettingWidget) == 0x000280, "Member 'USoundOptionWidget_C::SoundSettingWidget' has a wrong offset!");
static_assert(offsetof(USoundOptionWidget_C, VoiceSettingWidget) == 0x000288, "Member 'USoundOptionWidget_C::VoiceSettingWidget' has a wrong offset!");

}

