#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SystemMessageWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SystemMessageWidget.SystemMessageWidget_C.DisplaySystemMessage
// 0x0100 (0x0100 - 0x0000)
struct SystemMessageWidget_C_DisplaySystemMessage final
{
public:
	ESystemMessageType                            MessageType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Message;                                           // 0x0008(0x0018)(Parm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMessageWidget_C*                       CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x0088(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor4;                     // 0x00B0(0x0028)()
	struct FSlateColor                            TextColor;                                         // 0x00D8(0x0028)(Edit)
};
static_assert(alignof(SystemMessageWidget_C_DisplaySystemMessage) == 0x000008, "Wrong alignment on SystemMessageWidget_C_DisplaySystemMessage");
static_assert(sizeof(SystemMessageWidget_C_DisplaySystemMessage) == 0x000100, "Wrong size on SystemMessageWidget_C_DisplaySystemMessage");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, MessageType) == 0x000000, "Member 'SystemMessageWidget_C_DisplaySystemMessage::MessageType' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, Message) == 0x000008, "Member 'SystemMessageWidget_C_DisplaySystemMessage::Message' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'SystemMessageWidget_C_DisplaySystemMessage::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'SystemMessageWidget_C_DisplaySystemMessage::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, CallFunc_Create_ReturnValue) == 0x000030, "Member 'SystemMessageWidget_C_DisplaySystemMessage::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'SystemMessageWidget_C_DisplaySystemMessage::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, K2Node_MakeStruct_SlateColor2) == 0x000060, "Member 'SystemMessageWidget_C_DisplaySystemMessage::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, K2Node_MakeStruct_SlateColor3) == 0x000088, "Member 'SystemMessageWidget_C_DisplaySystemMessage::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, K2Node_MakeStruct_SlateColor4) == 0x0000B0, "Member 'SystemMessageWidget_C_DisplaySystemMessage::K2Node_MakeStruct_SlateColor4' has a wrong offset!");
static_assert(offsetof(SystemMessageWidget_C_DisplaySystemMessage, TextColor) == 0x0000D8, "Member 'SystemMessageWidget_C_DisplaySystemMessage::TextColor' has a wrong offset!");

// Function SystemMessageWidget.SystemMessageWidget_C.AddMessage
// 0x0008 (0x0008 - 0x0000)
struct SystemMessageWidget_C_AddMessage final
{
public:
	class UMessageWidget_C*                       Message;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SystemMessageWidget_C_AddMessage) == 0x000008, "Wrong alignment on SystemMessageWidget_C_AddMessage");
static_assert(sizeof(SystemMessageWidget_C_AddMessage) == 0x000008, "Wrong size on SystemMessageWidget_C_AddMessage");
static_assert(offsetof(SystemMessageWidget_C_AddMessage, Message) == 0x000000, "Member 'SystemMessageWidget_C_AddMessage::Message' has a wrong offset!");

}

