#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolTipGauageWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ToolTipGauageWidget.ToolTipGauageWidget_C.ExecuteUbergraph_ToolTipGauageWidget
// 0x0010 (0x0010 - 0x0000)
struct ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget) == 0x000008, "Wrong alignment on ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget");
static_assert(sizeof(ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget) == 0x000010, "Wrong size on ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget");
static_assert(offsetof(ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget, EntryPoint) == 0x000000, "Member 'ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'ToolTipGauageWidget_C_ExecuteUbergraph_ToolTipGauageWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function ToolTipGauageWidget.ToolTipGauageWidget_C.Update
// 0x00D8 (0x00D8 - 0x0000)
struct ToolTipGauageWidget_C_Update final
{
public:
	float                                         BeginGap;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         EndGap;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCompareMode;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m__float_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m__float_Variable2;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m__float_Variable3;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable2;                                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           m__struct_Variable;                                // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           m__struct_Variable2;                               // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable3;                                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           m__struct_Variable3;                               // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           m__struct_Variable4;                               // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable4;                                 // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select2_Default;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable5;                                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable6;                                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select4_Default;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select5_Default;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable7;                                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select6_Default;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select7_Default;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GapEnd;                                            // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         GapBegin;                                          // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ToolTipGauageWidget_C_Update) == 0x000008, "Wrong alignment on ToolTipGauageWidget_C_Update");
static_assert(sizeof(ToolTipGauageWidget_C_Update) == 0x0000D8, "Wrong size on ToolTipGauageWidget_C_Update");
static_assert(offsetof(ToolTipGauageWidget_C_Update, BeginGap) == 0x000000, "Member 'ToolTipGauageWidget_C_Update::BeginGap' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, EndGap) == 0x000004, "Member 'ToolTipGauageWidget_C_Update::EndGap' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, bCompareMode) == 0x000008, "Member 'ToolTipGauageWidget_C_Update::bCompareMode' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__float_Variable) == 0x00000C, "Member 'ToolTipGauageWidget_C_Update::m__float_Variable' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'ToolTipGauageWidget_C_Update::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000011, "Member 'ToolTipGauageWidget_C_Update::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000012, "Member 'ToolTipGauageWidget_C_Update::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_Less_FloatFloat_ReturnValue) == 0x000013, "Member 'ToolTipGauageWidget_C_Update::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x000014, "Member 'ToolTipGauageWidget_C_Update::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__float_Variable2) == 0x000018, "Member 'ToolTipGauageWidget_C_Update::m__float_Variable2' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'ToolTipGauageWidget_C_Update::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable) == 0x00001D, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__float_Variable3) == 0x000020, "Member 'ToolTipGauageWidget_C_Update::m__float_Variable3' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable2) == 0x000024, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable2' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__struct_Variable) == 0x000028, "Member 'ToolTipGauageWidget_C_Update::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__struct_Variable2) == 0x000038, "Member 'ToolTipGauageWidget_C_Update::m__struct_Variable2' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable3) == 0x000048, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable3' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select_Default) == 0x00004C, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__struct_Variable3) == 0x00005C, "Member 'ToolTipGauageWidget_C_Update::m__struct_Variable3' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__struct_Variable4) == 0x00006C, "Member 'ToolTipGauageWidget_C_Update::m__struct_Variable4' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable4) == 0x00007C, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable4' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select2_Default) == 0x000080, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable5) == 0x000090, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable5' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select3_Default) == 0x000094, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable6) == 0x0000A4, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable6' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select4_Default) == 0x0000A8, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select5_Default) == 0x0000AC, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, m__bool_Variable7) == 0x0000B0, "Member 'ToolTipGauageWidget_C_Update::m__bool_Variable7' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'ToolTipGauageWidget_C_Update::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select6_Default) == 0x0000C0, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, K2Node_Select7_Default) == 0x0000C4, "Member 'ToolTipGauageWidget_C_Update::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, CallFunc_IsValid_ReturnValue) == 0x0000C8, "Member 'ToolTipGauageWidget_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, GapEnd) == 0x0000CC, "Member 'ToolTipGauageWidget_C_Update::GapEnd' has a wrong offset!");
static_assert(offsetof(ToolTipGauageWidget_C_Update, GapBegin) == 0x0000D0, "Member 'ToolTipGauageWidget_C_Update::GapBegin' has a wrong offset!");

}

