#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToolTipGauageWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ToolTipGauageWidget.ToolTipGauageWidget_C
// 0x0040 (0x0280 - 0x0240)
class UToolTipGauageWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Gauge;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Gauge_bg;                                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTextBlock*                             GaugeText;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMaterialInstanceDynamic*               GaugeMaterial;                                     // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FText                                   GaugeName;                                         // 0x0268(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_ToolTipGauageWidget(int32 EntryPoint);
	void Construct();
	void Update(float BeginGap, float EndGap, bool bCompareMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ToolTipGauageWidget_C">();
	}
	static class UToolTipGauageWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UToolTipGauageWidget_C>();
	}
};
static_assert(alignof(UToolTipGauageWidget_C) == 0x000008, "Wrong alignment on UToolTipGauageWidget_C");
static_assert(sizeof(UToolTipGauageWidget_C) == 0x000280, "Wrong size on UToolTipGauageWidget_C");
static_assert(offsetof(UToolTipGauageWidget_C, UberGraphFrame) == 0x000240, "Member 'UToolTipGauageWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UToolTipGauageWidget_C, Gauge) == 0x000248, "Member 'UToolTipGauageWidget_C::Gauge' has a wrong offset!");
static_assert(offsetof(UToolTipGauageWidget_C, Gauge_bg) == 0x000250, "Member 'UToolTipGauageWidget_C::Gauge_bg' has a wrong offset!");
static_assert(offsetof(UToolTipGauageWidget_C, GaugeText) == 0x000258, "Member 'UToolTipGauageWidget_C::GaugeText' has a wrong offset!");
static_assert(offsetof(UToolTipGauageWidget_C, GaugeMaterial) == 0x000260, "Member 'UToolTipGauageWidget_C::GaugeMaterial' has a wrong offset!");
static_assert(offsetof(UToolTipGauageWidget_C, GaugeName) == 0x000268, "Member 'UToolTipGauageWidget_C::GaugeName' has a wrong offset!");

}

