#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TslCheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TslCheckBox.TslCheckBox_C
// 0x0038 (0x0278 - 0x0240)
class UTslCheckBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_2;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Image_0;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FText                                   DisplayName;                                       // 0x0258(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bChecked;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TslCheckBox(int32 EntryPoint);
	void BndEvt__Button_2_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	class FText GetDisplayName();
	void SetCheck(bool bChecked_0);
	struct FSlateBrush GetBrush_0();
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

	void IsChekced(bool* bChecked_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TslCheckBox_C">();
	}
	static class UTslCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTslCheckBox_C>();
	}
};
static_assert(alignof(UTslCheckBox_C) == 0x000008, "Wrong alignment on UTslCheckBox_C");
static_assert(sizeof(UTslCheckBox_C) == 0x000278, "Wrong size on UTslCheckBox_C");
static_assert(offsetof(UTslCheckBox_C, UberGraphFrame) == 0x000240, "Member 'UTslCheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTslCheckBox_C, Button_2) == 0x000248, "Member 'UTslCheckBox_C::Button_2' has a wrong offset!");
static_assert(offsetof(UTslCheckBox_C, Image_0) == 0x000250, "Member 'UTslCheckBox_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTslCheckBox_C, DisplayName) == 0x000258, "Member 'UTslCheckBox_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UTslCheckBox_C, bChecked) == 0x000270, "Member 'UTslCheckBox_C::bChecked' has a wrong offset!");

}

