#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TslCheckBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TslCheckBox.TslCheckBox_C.ExecuteUbergraph_TslCheckBox
// 0x0008 (0x0008 - 0x0000)
struct TslCheckBox_C_ExecuteUbergraph_TslCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslCheckBox_C_ExecuteUbergraph_TslCheckBox) == 0x000004, "Wrong alignment on TslCheckBox_C_ExecuteUbergraph_TslCheckBox");
static_assert(sizeof(TslCheckBox_C_ExecuteUbergraph_TslCheckBox) == 0x000008, "Wrong size on TslCheckBox_C_ExecuteUbergraph_TslCheckBox");
static_assert(offsetof(TslCheckBox_C_ExecuteUbergraph_TslCheckBox, EntryPoint) == 0x000000, "Member 'TslCheckBox_C_ExecuteUbergraph_TslCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_ExecuteUbergraph_TslCheckBox, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'TslCheckBox_C_ExecuteUbergraph_TslCheckBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TslCheckBox.TslCheckBox_C.GetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct TslCheckBox_C_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(TslCheckBox_C_GetDisplayName) == 0x000008, "Wrong alignment on TslCheckBox_C_GetDisplayName");
static_assert(sizeof(TslCheckBox_C_GetDisplayName) == 0x000018, "Wrong size on TslCheckBox_C_GetDisplayName");
static_assert(offsetof(TslCheckBox_C_GetDisplayName, ReturnValue) == 0x000000, "Member 'TslCheckBox_C_GetDisplayName::ReturnValue' has a wrong offset!");

// Function TslCheckBox.TslCheckBox_C.SetCheck
// 0x0001 (0x0001 - 0x0000)
struct TslCheckBox_C_SetCheck final
{
public:
	bool                                          bChecked_0;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslCheckBox_C_SetCheck) == 0x000001, "Wrong alignment on TslCheckBox_C_SetCheck");
static_assert(sizeof(TslCheckBox_C_SetCheck) == 0x000001, "Wrong size on TslCheckBox_C_SetCheck");
static_assert(offsetof(TslCheckBox_C_SetCheck, bChecked_0) == 0x000000, "Member 'TslCheckBox_C_SetCheck::bChecked_0' has a wrong offset!");

// Function TslCheckBox.TslCheckBox_C.GetBrush_0
// 0x01B0 (0x01B0 - 0x0000)
struct TslCheckBox_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0090(0x0090)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue2;        // 0x0120(0x0090)()
};
static_assert(alignof(TslCheckBox_C_GetBrush_0) == 0x000008, "Wrong alignment on TslCheckBox_C_GetBrush_0");
static_assert(sizeof(TslCheckBox_C_GetBrush_0) == 0x0001B0, "Wrong size on TslCheckBox_C_GetBrush_0");
static_assert(offsetof(TslCheckBox_C_GetBrush_0, ReturnValue) == 0x000000, "Member 'TslCheckBox_C_GetBrush_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_GetBrush_0, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000090, "Member 'TslCheckBox_C_GetBrush_0::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_GetBrush_0, CallFunc_MakeBrushFromTexture_ReturnValue2) == 0x000120, "Member 'TslCheckBox_C_GetBrush_0::CallFunc_MakeBrushFromTexture_ReturnValue2' has a wrong offset!");

// Function TslCheckBox.TslCheckBox_C.OnMouseButtonDown_0
// 0x0208 (0x0208 - 0x0000)
struct TslCheckBox_C_OnMouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00A8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslCheckBox_C_OnMouseButtonDown_0) == 0x000008, "Wrong alignment on TslCheckBox_C_OnMouseButtonDown_0");
static_assert(sizeof(TslCheckBox_C_OnMouseButtonDown_0) == 0x000208, "Wrong size on TslCheckBox_C_OnMouseButtonDown_0");
static_assert(offsetof(TslCheckBox_C_OnMouseButtonDown_0, MyGeometry) == 0x000000, "Member 'TslCheckBox_C_OnMouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_OnMouseButtonDown_0, MouseEvent) == 0x000038, "Member 'TslCheckBox_C_OnMouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_OnMouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'TslCheckBox_C_OnMouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_OnMouseButtonDown_0, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'TslCheckBox_C_OnMouseButtonDown_0::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslCheckBox_C_OnMouseButtonDown_0, CallFunc_Not_PreBool_ReturnValue) == 0x000200, "Member 'TslCheckBox_C_OnMouseButtonDown_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TslCheckBox.TslCheckBox_C.IsChekced
// 0x0001 (0x0001 - 0x0000)
struct TslCheckBox_C_IsChekced final
{
public:
	bool                                          bChecked_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslCheckBox_C_IsChekced) == 0x000001, "Wrong alignment on TslCheckBox_C_IsChekced");
static_assert(sizeof(TslCheckBox_C_IsChekced) == 0x000001, "Wrong size on TslCheckBox_C_IsChekced");
static_assert(offsetof(TslCheckBox_C_IsChekced, bChecked_0) == 0x000000, "Member 'TslCheckBox_C_IsChekced::bChecked_0' has a wrong offset!");

}

