#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TSLGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TSLGameState.TSLGameState_C
// 0x0018 (0x04C8 - 0x04B0)
class ATSLGameState_C final : public ATslGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	int32                                         SplineCount;                                       // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         SplineComponentCount;                              // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TSLGameState(int32 EntryPoint);
	void UpdateWorldTimeSecondsDelta(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TSLGameState_C">();
	}
	static class ATSLGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATSLGameState_C>();
	}
};
static_assert(alignof(ATSLGameState_C) == 0x000008, "Wrong alignment on ATSLGameState_C");
static_assert(sizeof(ATSLGameState_C) == 0x0004C8, "Wrong size on ATSLGameState_C");
static_assert(offsetof(ATSLGameState_C, UberGraphFrame) == 0x0004B0, "Member 'ATSLGameState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATSLGameState_C, DefaultSceneRoot) == 0x0004B8, "Member 'ATSLGameState_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ATSLGameState_C, SplineCount) == 0x0004C0, "Member 'ATSLGameState_C::SplineCount' has a wrong offset!");
static_assert(offsetof(ATSLGameState_C, SplineComponentCount) == 0x0004C4, "Member 'ATSLGameState_C::SplineComponentCount' has a wrong offset!");

}

