#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TslHealthGaugeBpWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C
// 0x0070 (0x02B0 - 0x0240)
class UTslHealthGaugeBpWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Warning2;                                          // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UWidgetAnimation*                       Warning;                                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 Background;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UImage*                                 GaugeImage;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                GuageBody;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UMaterialInstanceDynamic*               GaugeMaterial;                                     // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LastHealthPercent;                                 // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            HealthMoveCurve;                                   // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         DestinationHealthPercent;                          // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         WaningStartPercent;                                // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TestValue;                                         // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bMoveGauge;                                        // 0x0294(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSmoothMode;                                       // 0x0295(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslHealthGaugeData*                    HealthGaugeColor;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslHealthGaugeData*                    HealthGagugeColor;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bGroggy;                                           // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TslHealthGaugeBpWidget(int32 EntryPoint);
	void StartMove();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void GetHealthGaugeColorOpacity(struct FLinearColor* Color);
	void MoveTick();
	void SetHealth(float NewDestination, bool bGroggy_0);
	void GetMoveCurve(class UCurveFloat** NewParam);
	void UpdateColorGauge();
	void UpdateWaning();
	ESlateVisibility Get_Background_Visibility_0();
	struct FLinearColor Get_Background_ColorAndOpacity_0();
	void On_Background_Prepass_0(class UWidget* BoundWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TslHealthGaugeBpWidget_C">();
	}
	static class UTslHealthGaugeBpWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTslHealthGaugeBpWidget_C>();
	}
};
static_assert(alignof(UTslHealthGaugeBpWidget_C) == 0x000008, "Wrong alignment on UTslHealthGaugeBpWidget_C");
static_assert(sizeof(UTslHealthGaugeBpWidget_C) == 0x0002B0, "Wrong size on UTslHealthGaugeBpWidget_C");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, UberGraphFrame) == 0x000240, "Member 'UTslHealthGaugeBpWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, Warning2) == 0x000248, "Member 'UTslHealthGaugeBpWidget_C::Warning2' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, Warning) == 0x000250, "Member 'UTslHealthGaugeBpWidget_C::Warning' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, Background) == 0x000258, "Member 'UTslHealthGaugeBpWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, GaugeImage) == 0x000260, "Member 'UTslHealthGaugeBpWidget_C::GaugeImage' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, GuageBody) == 0x000268, "Member 'UTslHealthGaugeBpWidget_C::GuageBody' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, GaugeMaterial) == 0x000270, "Member 'UTslHealthGaugeBpWidget_C::GaugeMaterial' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, LastHealthPercent) == 0x000278, "Member 'UTslHealthGaugeBpWidget_C::LastHealthPercent' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, HealthMoveCurve) == 0x000280, "Member 'UTslHealthGaugeBpWidget_C::HealthMoveCurve' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, DestinationHealthPercent) == 0x000288, "Member 'UTslHealthGaugeBpWidget_C::DestinationHealthPercent' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, WaningStartPercent) == 0x00028C, "Member 'UTslHealthGaugeBpWidget_C::WaningStartPercent' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, TestValue) == 0x000290, "Member 'UTslHealthGaugeBpWidget_C::TestValue' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, bMoveGauge) == 0x000294, "Member 'UTslHealthGaugeBpWidget_C::bMoveGauge' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, bSmoothMode) == 0x000295, "Member 'UTslHealthGaugeBpWidget_C::bSmoothMode' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, HealthGaugeColor) == 0x000298, "Member 'UTslHealthGaugeBpWidget_C::HealthGaugeColor' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, HealthGagugeColor) == 0x0002A0, "Member 'UTslHealthGaugeBpWidget_C::HealthGagugeColor' has a wrong offset!");
static_assert(offsetof(UTslHealthGaugeBpWidget_C, bGroggy) == 0x0002A8, "Member 'UTslHealthGaugeBpWidget_C::bGroggy' has a wrong offset!");

}

