#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TslHealthGaugeBpWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.ExecuteUbergraph_TslHealthGaugeBpWidget
// 0x0090 (0x0090 - 0x0000)
struct TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            CallFunc_GetMoveCurve_NewParam;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCurveFloat*                            CallFunc_GetMoveCurve_NewParam2;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeRange_MinTime;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeRange_MaxTime;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget) == 0x000008, "Wrong alignment on TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget");
static_assert(sizeof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget) == 0x000090, "Wrong size on TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, EntryPoint) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, K2Node_Event_MyGeometry) == 0x000004, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, K2Node_Event_InDeltaTime) == 0x000038, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000048, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetMoveCurve_NewParam) == 0x000058, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetMoveCurve_NewParam' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetMoveCurve_NewParam2) == 0x000060, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetMoveCurve_NewParam2' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetTimeRange_MinTime) == 0x000068, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetTimeRange_MinTime' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetTimeRange_MaxTime) == 0x00006C, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetTimeRange_MaxTime' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_GetFloatValue_ReturnValue) == 0x000070, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000074, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000078, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000080, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000084, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000088, "Member 'TslHealthGaugeBpWidget_C_ExecuteUbergraph_TslHealthGaugeBpWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct TslHealthGaugeBpWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_Tick) == 0x000004, "Wrong alignment on TslHealthGaugeBpWidget_C_Tick");
static_assert(sizeof(TslHealthGaugeBpWidget_C_Tick) == 0x000038, "Wrong size on TslHealthGaugeBpWidget_C_Tick");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Tick, MyGeometry) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'TslHealthGaugeBpWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.GetHealthGaugeColorOpacity
// 0x0030 (0x0030 - 0x0000)
struct TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetGaugeColor_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           ReturnColor;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity) == 0x000004, "Wrong alignment on TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity");
static_assert(sizeof(TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity) == 0x000030, "Wrong size on TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity");
static_assert(offsetof(TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity, Color) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity::Color' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity, CallFunc_GetGaugeColor_ReturnValue) == 0x000010, "Member 'TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity::CallFunc_GetGaugeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity, ReturnColor) == 0x000020, "Member 'TslHealthGaugeBpWidget_C_GetHealthGaugeColorOpacity::ReturnColor' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.SetHealth
// 0x0024 (0x0024 - 0x0000)
struct TslHealthGaugeBpWidget_C_SetHealth final
{
public:
	float                                         NewDestination;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGroggy_0;                                         // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetGaugeColor_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SafeDivide_FloatFloat_ReturnValue;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_SetHealth) == 0x000004, "Wrong alignment on TslHealthGaugeBpWidget_C_SetHealth");
static_assert(sizeof(TslHealthGaugeBpWidget_C_SetHealth) == 0x000024, "Wrong size on TslHealthGaugeBpWidget_C_SetHealth");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, NewDestination) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_SetHealth::NewDestination' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, bGroggy_0) == 0x000004, "Member 'TslHealthGaugeBpWidget_C_SetHealth::bGroggy_0' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, CallFunc_GetGaugeColor_ReturnValue) == 0x000008, "Member 'TslHealthGaugeBpWidget_C_SetHealth::CallFunc_GetGaugeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, CallFunc_SafeDivide_FloatFloat_ReturnValue) == 0x000018, "Member 'TslHealthGaugeBpWidget_C_SetHealth::CallFunc_SafeDivide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'TslHealthGaugeBpWidget_C_SetHealth::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_SetHealth, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'TslHealthGaugeBpWidget_C_SetHealth::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.GetMoveCurve
// 0x0008 (0x0008 - 0x0000)
struct TslHealthGaugeBpWidget_C_GetMoveCurve final
{
public:
	class UCurveFloat*                            NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_GetMoveCurve) == 0x000008, "Wrong alignment on TslHealthGaugeBpWidget_C_GetMoveCurve");
static_assert(sizeof(TslHealthGaugeBpWidget_C_GetMoveCurve) == 0x000008, "Wrong size on TslHealthGaugeBpWidget_C_GetMoveCurve");
static_assert(offsetof(TslHealthGaugeBpWidget_C_GetMoveCurve, NewParam) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_GetMoveCurve::NewParam' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.UpdateColorGauge
// 0x0038 (0x0038 - 0x0000)
struct TslHealthGaugeBpWidget_C_UpdateColorGauge final
{
public:
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetHealthGaugeColorOpacity_Color;         // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_UpdateColorGauge) == 0x000004, "Wrong alignment on TslHealthGaugeBpWidget_C_UpdateColorGauge");
static_assert(sizeof(TslHealthGaugeBpWidget_C_UpdateColorGauge) == 0x000038, "Wrong size on TslHealthGaugeBpWidget_C_UpdateColorGauge");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, CallFunc_MapRangeClamped_ReturnValue) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, CallFunc_GetHealthGaugeColorOpacity_Color) == 0x000004, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::CallFunc_GetHealthGaugeColorOpacity_Color' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, K2Node_MakeStruct_LinearColor) == 0x000014, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, m__bool_Variable) == 0x000024, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, CallFunc_IsValid_ReturnValue) == 0x000025, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateColorGauge, K2Node_Select_Default) == 0x000028, "Member 'TslHealthGaugeBpWidget_C_UpdateColorGauge::K2Node_Select_Default' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.UpdateWaning
// 0x0006 (0x0006 - 0x0000)
struct TslHealthGaugeBpWidget_C_UpdateWaning final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_UpdateWaning) == 0x000001, "Wrong alignment on TslHealthGaugeBpWidget_C_UpdateWaning");
static_assert(sizeof(TslHealthGaugeBpWidget_C_UpdateWaning) == 0x000006, "Wrong size on TslHealthGaugeBpWidget_C_UpdateWaning");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000003, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_UpdateWaning, CallFunc_BooleanAND_ReturnValue2) == 0x000005, "Member 'TslHealthGaugeBpWidget_C_UpdateWaning::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.Get_Background_Visibility_0
// 0x0006 (0x0006 - 0x0000)
struct TslHealthGaugeBpWidget_C_Get_Background_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0) == 0x000001, "Wrong alignment on TslHealthGaugeBpWidget_C_Get_Background_Visibility_0");
static_assert(sizeof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0) == 0x000006, "Wrong size on TslHealthGaugeBpWidget_C_Get_Background_Visibility_0");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, ReturnValue) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, m__bool_Variable) == 0x000001, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, m__byte_Variable) == 0x000002, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, m__byte_Variable2) == 0x000003, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_Visibility_0, K2Node_Select_Default) == 0x000005, "Member 'TslHealthGaugeBpWidget_C_Get_Background_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.Get_Background_ColorAndOpacity_0
// 0x0048 (0x0048 - 0x0000)
struct TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           m__struct_Variable;                                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           m__struct_Variable2;                               // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0) == 0x000004, "Wrong alignment on TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0");
static_assert(sizeof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0) == 0x000048, "Wrong size on TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, m__bool_Variable) == 0x000010, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, m__struct_Variable) == 0x000014, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, m__struct_Variable2) == 0x000024, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::m__struct_Variable2' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0, K2Node_Select_Default) == 0x000038, "Member 'TslHealthGaugeBpWidget_C_Get_Background_ColorAndOpacity_0::K2Node_Select_Default' has a wrong offset!");

// Function TslHealthGaugeBpWidget.TslHealthGaugeBpWidget_C.On_Background_Prepass_0
// 0x0018 (0x0018 - 0x0000)
struct TslHealthGaugeBpWidget_C_On_Background_Prepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_Get_Background_ColorAndOpacity_0_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslHealthGaugeBpWidget_C_On_Background_Prepass_0) == 0x000008, "Wrong alignment on TslHealthGaugeBpWidget_C_On_Background_Prepass_0");
static_assert(sizeof(TslHealthGaugeBpWidget_C_On_Background_Prepass_0) == 0x000018, "Wrong size on TslHealthGaugeBpWidget_C_On_Background_Prepass_0");
static_assert(offsetof(TslHealthGaugeBpWidget_C_On_Background_Prepass_0, BoundWidget) == 0x000000, "Member 'TslHealthGaugeBpWidget_C_On_Background_Prepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(TslHealthGaugeBpWidget_C_On_Background_Prepass_0, CallFunc_Get_Background_ColorAndOpacity_0_ReturnValue) == 0x000008, "Member 'TslHealthGaugeBpWidget_C_On_Background_Prepass_0::CallFunc_Get_Background_ColorAndOpacity_0_ReturnValue' has a wrong offset!");

}

