#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TslItemDragDropOperation

#include "Basic.hpp"


namespace SDK::Params
{

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.GetOptions
// 0x0060 (0x0060 - 0x0000)
struct TslItemDragDropOperation_C_GetOptions final
{
public:
	class FString                                 Options;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          m__bool_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m__string_Variable;                                // 0x0018(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor)
	class FString                                 K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor)
};
static_assert(alignof(TslItemDragDropOperation_C_GetOptions) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_GetOptions");
static_assert(sizeof(TslItemDragDropOperation_C_GetOptions) == 0x000060, "Wrong size on TslItemDragDropOperation_C_GetOptions");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, Options) == 0x000000, "Member 'TslItemDragDropOperation_C_GetOptions::Options' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, m__bool_Variable) == 0x000010, "Member 'TslItemDragDropOperation_C_GetOptions::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, m__string_Variable) == 0x000018, "Member 'TslItemDragDropOperation_C_GetOptions::m__string_Variable' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'TslItemDragDropOperation_C_GetOptions::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000038, "Member 'TslItemDragDropOperation_C_GetOptions::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'TslItemDragDropOperation_C_GetOptions::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetOptions, K2Node_Select_Default) == 0x000050, "Member 'TslItemDragDropOperation_C_GetOptions::K2Node_Select_Default' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.GetActionName
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) TslItemDragDropOperation_C_GetActionName final
{
public:
	class FName                                   ActionName_0;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_GetActionName) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_GetActionName");
static_assert(sizeof(TslItemDragDropOperation_C_GetActionName) == 0x000008, "Wrong size on TslItemDragDropOperation_C_GetActionName");
static_assert(offsetof(TslItemDragDropOperation_C_GetActionName, ActionName_0) == 0x000000, "Member 'TslItemDragDropOperation_C_GetActionName::ActionName_0' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.IsEnableAction
// 0x0030 (0x0030 - 0x0000)
struct TslItemDragDropOperation_C_IsEnableAction final
{
public:
	bool                                          IsEnableAction_0;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetCurrentOtherContainer_OtherContainer;  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetOptions_Options;                       // 0x0018(0x0010)(ZeroConstructor)
	bool                                          CallFunc_IsEnableAction_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_IsEnableAction) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_IsEnableAction");
static_assert(sizeof(TslItemDragDropOperation_C_IsEnableAction) == 0x000030, "Wrong size on TslItemDragDropOperation_C_IsEnableAction");
static_assert(offsetof(TslItemDragDropOperation_C_IsEnableAction, IsEnableAction_0) == 0x000000, "Member 'TslItemDragDropOperation_C_IsEnableAction::IsEnableAction_0' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsEnableAction, CallFunc_GetCurrentOtherContainer_OtherContainer) == 0x000008, "Member 'TslItemDragDropOperation_C_IsEnableAction::CallFunc_GetCurrentOtherContainer_OtherContainer' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsEnableAction, CallFunc_GetOptions_Options) == 0x000018, "Member 'TslItemDragDropOperation_C_IsEnableAction::CallFunc_GetOptions_Options' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsEnableAction, CallFunc_IsEnableAction_ReturnValue) == 0x000028, "Member 'TslItemDragDropOperation_C_IsEnableAction::CallFunc_IsEnableAction_ReturnValue' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.EnterOtherContainer
// 0x0078 (0x0078 - 0x0000)
struct TslItemDragDropOperation_C_EnterOtherContainer final
{
public:
	TScriptInterface<class ISlotContainerInterface> NewOtherContainer;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOptions_Options;                       // 0x0018(0x0010)(ZeroConstructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetCurrentOtherContainer_OtherContainer;  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetCurrentOtherContainer_OtherContainer2; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableAction_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragWidget_C*                   K2Node_DynamicCast_AsTsl_Item_Drag_Widget;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOptions_Options2;                      // 0x0060(0x0010)(ZeroConstructor)
	class FName                                   CallFunc_GetActionName_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_EnterOtherContainer) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_EnterOtherContainer");
static_assert(sizeof(TslItemDragDropOperation_C_EnterOtherContainer) == 0x000078, "Wrong size on TslItemDragDropOperation_C_EnterOtherContainer");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, NewOtherContainer) == 0x000000, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::NewOtherContainer' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_GetOptions_Options) == 0x000018, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_GetOptions_Options' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_GetCurrentOtherContainer_OtherContainer) == 0x000028, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_GetCurrentOtherContainer_OtherContainer' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_GetCurrentOtherContainer_OtherContainer2) == 0x000038, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_GetCurrentOtherContainer_OtherContainer2' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_IsEnableAction_ReturnValue) == 0x000048, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_IsEnableAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, K2Node_DynamicCast_AsTsl_Item_Drag_Widget) == 0x000050, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::K2Node_DynamicCast_AsTsl_Item_Drag_Widget' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_GetOptions_Options2) == 0x000060, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_GetOptions_Options2' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_EnterOtherContainer, CallFunc_GetActionName_ReturnValue) == 0x000070, "Member 'TslItemDragDropOperation_C_EnterOtherContainer::CallFunc_GetActionName_ReturnValue' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.LeaveOtherContainer
// 0x000C (0x000C - 0x0000)
struct TslItemDragDropOperation_C_LeaveOtherContainer final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_LeaveOtherContainer) == 0x000004, "Wrong alignment on TslItemDragDropOperation_C_LeaveOtherContainer");
static_assert(sizeof(TslItemDragDropOperation_C_LeaveOtherContainer) == 0x00000C, "Wrong size on TslItemDragDropOperation_C_LeaveOtherContainer");
static_assert(offsetof(TslItemDragDropOperation_C_LeaveOtherContainer, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'TslItemDragDropOperation_C_LeaveOtherContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_LeaveOtherContainer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'TslItemDragDropOperation_C_LeaveOtherContainer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_LeaveOtherContainer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000008, "Member 'TslItemDragDropOperation_C_LeaveOtherContainer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.GetCurrentOtherContainer
// 0x0030 (0x0030 - 0x0000)
struct TslItemDragDropOperation_C_GetCurrentOtherContainer final
{
public:
	TScriptInterface<class ISlotContainerInterface> OtherContainer;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_GetCurrentOtherContainer) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_GetCurrentOtherContainer");
static_assert(sizeof(TslItemDragDropOperation_C_GetCurrentOtherContainer) == 0x000030, "Wrong size on TslItemDragDropOperation_C_GetCurrentOtherContainer");
static_assert(offsetof(TslItemDragDropOperation_C_GetCurrentOtherContainer, OtherContainer) == 0x000000, "Member 'TslItemDragDropOperation_C_GetCurrentOtherContainer::OtherContainer' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetCurrentOtherContainer, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'TslItemDragDropOperation_C_GetCurrentOtherContainer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetCurrentOtherContainer, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'TslItemDragDropOperation_C_GetCurrentOtherContainer::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetCurrentOtherContainer, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'TslItemDragDropOperation_C_GetCurrentOtherContainer::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_GetCurrentOtherContainer, CallFunc_Array_Get_Item) == 0x000020, "Member 'TslItemDragDropOperation_C_GetCurrentOtherContainer::CallFunc_Array_Get_Item' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.IsInEquipment
// 0x0038 (0x0038 - 0x0000)
struct TslItemDragDropOperation_C_IsInEquipment final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_Array_Get_Item;                           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSlotContainerName_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_IsInEquipment) == 0x000008, "Wrong alignment on TslItemDragDropOperation_C_IsInEquipment");
static_assert(sizeof(TslItemDragDropOperation_C_IsInEquipment) == 0x000038, "Wrong size on TslItemDragDropOperation_C_IsInEquipment");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, NewParam) == 0x000000, "Member 'TslItemDragDropOperation_C_IsInEquipment::NewParam' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, m__int_Array_Index_Variable) == 0x000004, "Member 'TslItemDragDropOperation_C_IsInEquipment::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, m__int_Loop_Counter_Variable) == 0x000008, "Member 'TslItemDragDropOperation_C_IsInEquipment::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_Array_Get_Item) == 0x000010, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_GetSlotContainerName_ReturnValue) == 0x000028, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_GetSlotContainerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsInEquipment, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000031, "Member 'TslItemDragDropOperation_C_IsInEquipment::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.IsDragDroppingItemWeapon
// 0x0004 (0x0004 - 0x0000)
struct TslItemDragDropOperation_C_IsDragDroppingItemWeapon final
{
public:
	bool                                          IsWeapon;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon) == 0x000001, "Wrong alignment on TslItemDragDropOperation_C_IsDragDroppingItemWeapon");
static_assert(sizeof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon) == 0x000004, "Wrong size on TslItemDragDropOperation_C_IsDragDroppingItemWeapon");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon, IsWeapon) == 0x000000, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemWeapon::IsWeapon' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon, CallFunc_IsValid_ReturnValue2) == 0x000002, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemWeapon::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemWeapon, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemWeapon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function TslItemDragDropOperation.TslItemDragDropOperation_C.IsDragDroppingItemAttachment
// 0x0003 (0x0003 - 0x0000)
struct TslItemDragDropOperation_C_IsDragDroppingItemAttachment final
{
public:
	bool                                          IsAttachment;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachment_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TslItemDragDropOperation_C_IsDragDroppingItemAttachment) == 0x000001, "Wrong alignment on TslItemDragDropOperation_C_IsDragDroppingItemAttachment");
static_assert(sizeof(TslItemDragDropOperation_C_IsDragDroppingItemAttachment) == 0x000003, "Wrong size on TslItemDragDropOperation_C_IsDragDroppingItemAttachment");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemAttachment, IsAttachment) == 0x000000, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemAttachment::IsAttachment' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemAttachment, CallFunc_IsAttachment_ReturnValue) == 0x000001, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemAttachment::CallFunc_IsAttachment_ReturnValue' has a wrong offset!");
static_assert(offsetof(TslItemDragDropOperation_C_IsDragDroppingItemAttachment, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'TslItemDragDropOperation_C_IsDragDroppingItemAttachment::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

