#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uaz_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Uaz_Animation.Uaz_Animation_C
// 0x1600 (0x1E80 - 0x0880)
class UUaz_Animation_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_F0D8C80D499C3C446BC5DDBBE8F2D24F; // 0x0888(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_9C24B60A458DB325D201F78C8F4E9C96; // 0x0920(0x0098)()
	uint8                                         Pad_9B8[0x8];                                      // 0x09B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_75C94E354CE068DCECAA44A4D125A181; // 0x09C0(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2A000F00443F102269634D863DAB5E06; // 0x0B10(0x0150)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_C57FD0514765F2676DC18F91F14FB8E7; // 0x0C60(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_B4551679490AD5289EA7FFAA5A59117E; // 0x0CF8(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_957AA8434442AE766C901580EC1D5710; // 0x0D90(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2E34B1BD4ADADCD4BF3218B9BB4CF6A5; // 0x0E28(0x0098)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_64E9C1FA4FE37801F6F797B4C01ED3F5; // 0x0EC0(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_E17EE4A84BB55EEB76BB4CA6455AB8AF; // 0x1010(0x0150)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9CD776AB4A479F09FBB16C923963C85F; // 0x1160(0x0048)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_D2192E41428C7552482D97A285E11319; // 0x11A8(0x0088)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_E8FAC06B4DF89CEE5400BE810C438130; // 0x1230(0x0030)()
	struct FAnimNode_Root                         AnimGraphNode_Root_B4F664F64FC75A1910BBDD8B96AAA321; // 0x1260(0x0048)()
	uint8                                         Pad_12A8[0x8];                                     // 0x12A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_962DFD0F4AAC68F03548CDA57764C3FF; // 0x12B0(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_8B35A8E4465C40875C475E9E4BF8217E; // 0x1400(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7073ADDA4345EC10597A61A67196E302; // 0x1550(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1DD008EE4C511FD4FA2E4C9FB25C5097; // 0x16A0(0x0150)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6208E72B42E821C51E42659D38338867; // 0x17F0(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_AE9F5DC640C244848D14D5977003B137; // 0x1888(0x0098)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_918437FC4ED0E72B021D9695D1BB5153; // 0x1920(0x0150)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_43B74917442C7B26B8A8969C0B6BF62C; // 0x1A70(0x0150)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_B0FCAFAD4B0AED9973A4678E8CE904F6; // 0x1BC0(0x0098)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_5C0A932E47B41D23833F97A83082F4F0; // 0x1C58(0x0098)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_92CE5E20435206E5C4125B81AE2D5E5E; // 0x1CF0(0x00B0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_F45EEFEE4F1F650FBF78D1ACCB01BDDE; // 0x1DA0(0x00B0)()
	float                                         SteeringWheelAngle;                                // 0x1E50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E54[0x4];                                     // 0x1E54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslWheeledVehicle*                     VehicleReference;                                  // 0x1E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UTslWheeledVehicleMovement*             VehicleMovementReference;                          // 0x1E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               SteeringWheelRotation;                             // 0x1E68(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               VelocityNeedleRot;                                 // 0x1E74(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Uaz_Animation(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Uaz_Animation_AnimGraphNode_ModifyBone_92CE5E20435206E5C4125B81AE2D5E5E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Uaz_Animation_AnimGraphNode_ModifyBone_F45EEFEE4F1F650FBF78D1ACCB01BDDE();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Uaz_Animation_C">();
	}
	static class UUaz_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUaz_Animation_C>();
	}
};
static_assert(alignof(UUaz_Animation_C) == 0x000010, "Wrong alignment on UUaz_Animation_C");
static_assert(sizeof(UUaz_Animation_C) == 0x001E80, "Wrong size on UUaz_Animation_C");
static_assert(offsetof(UUaz_Animation_C, UberGraphFrame) == 0x000880, "Member 'UUaz_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_F0D8C80D499C3C446BC5DDBBE8F2D24F) == 0x000888, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_F0D8C80D499C3C446BC5DDBBE8F2D24F' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_9C24B60A458DB325D201F78C8F4E9C96) == 0x000920, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_9C24B60A458DB325D201F78C8F4E9C96' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_75C94E354CE068DCECAA44A4D125A181) == 0x0009C0, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_75C94E354CE068DCECAA44A4D125A181' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_2A000F00443F102269634D863DAB5E06) == 0x000B10, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_2A000F00443F102269634D863DAB5E06' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_C57FD0514765F2676DC18F91F14FB8E7) == 0x000C60, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_C57FD0514765F2676DC18F91F14FB8E7' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_B4551679490AD5289EA7FFAA5A59117E) == 0x000CF8, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_B4551679490AD5289EA7FFAA5A59117E' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_957AA8434442AE766C901580EC1D5710) == 0x000D90, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_957AA8434442AE766C901580EC1D5710' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_2E34B1BD4ADADCD4BF3218B9BB4CF6A5) == 0x000E28, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_2E34B1BD4ADADCD4BF3218B9BB4CF6A5' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_64E9C1FA4FE37801F6F797B4C01ED3F5) == 0x000EC0, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_64E9C1FA4FE37801F6F797B4C01ED3F5' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_E17EE4A84BB55EEB76BB4CA6455AB8AF) == 0x001010, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_E17EE4A84BB55EEB76BB4CA6455AB8AF' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_ComponentToLocalSpace_9CD776AB4A479F09FBB16C923963C85F) == 0x001160, "Member 'UUaz_Animation_C::AnimGraphNode_ComponentToLocalSpace_9CD776AB4A479F09FBB16C923963C85F' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_WheelHandler_D2192E41428C7552482D97A285E11319) == 0x0011A8, "Member 'UUaz_Animation_C::AnimGraphNode_WheelHandler_D2192E41428C7552482D97A285E11319' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_MeshRefPose_E8FAC06B4DF89CEE5400BE810C438130) == 0x001230, "Member 'UUaz_Animation_C::AnimGraphNode_MeshRefPose_E8FAC06B4DF89CEE5400BE810C438130' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_Root_B4F664F64FC75A1910BBDD8B96AAA321) == 0x001260, "Member 'UUaz_Animation_C::AnimGraphNode_Root_B4F664F64FC75A1910BBDD8B96AAA321' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_962DFD0F4AAC68F03548CDA57764C3FF) == 0x0012B0, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_962DFD0F4AAC68F03548CDA57764C3FF' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_8B35A8E4465C40875C475E9E4BF8217E) == 0x001400, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_8B35A8E4465C40875C475E9E4BF8217E' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_7073ADDA4345EC10597A61A67196E302) == 0x001550, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_7073ADDA4345EC10597A61A67196E302' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_1DD008EE4C511FD4FA2E4C9FB25C5097) == 0x0016A0, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_1DD008EE4C511FD4FA2E4C9FB25C5097' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_6208E72B42E821C51E42659D38338867) == 0x0017F0, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_6208E72B42E821C51E42659D38338867' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_AE9F5DC640C244848D14D5977003B137) == 0x001888, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_AE9F5DC640C244848D14D5977003B137' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_918437FC4ED0E72B021D9695D1BB5153) == 0x001920, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_918437FC4ED0E72B021D9695D1BB5153' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_LookAt_43B74917442C7B26B8A8969C0B6BF62C) == 0x001A70, "Member 'UUaz_Animation_C::AnimGraphNode_LookAt_43B74917442C7B26B8A8969C0B6BF62C' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_B0FCAFAD4B0AED9973A4678E8CE904F6) == 0x001BC0, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_B0FCAFAD4B0AED9973A4678E8CE904F6' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_CopyBone_5C0A932E47B41D23833F97A83082F4F0) == 0x001C58, "Member 'UUaz_Animation_C::AnimGraphNode_CopyBone_5C0A932E47B41D23833F97A83082F4F0' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_ModifyBone_92CE5E20435206E5C4125B81AE2D5E5E) == 0x001CF0, "Member 'UUaz_Animation_C::AnimGraphNode_ModifyBone_92CE5E20435206E5C4125B81AE2D5E5E' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, AnimGraphNode_ModifyBone_F45EEFEE4F1F650FBF78D1ACCB01BDDE) == 0x001DA0, "Member 'UUaz_Animation_C::AnimGraphNode_ModifyBone_F45EEFEE4F1F650FBF78D1ACCB01BDDE' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, SteeringWheelAngle) == 0x001E50, "Member 'UUaz_Animation_C::SteeringWheelAngle' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, VehicleReference) == 0x001E58, "Member 'UUaz_Animation_C::VehicleReference' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, VehicleMovementReference) == 0x001E60, "Member 'UUaz_Animation_C::VehicleMovementReference' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, SteeringWheelRotation) == 0x001E68, "Member 'UUaz_Animation_C::SteeringWheelRotation' has a wrong offset!");
static_assert(offsetof(UUaz_Animation_C, VelocityNeedleRot) == 0x001E74, "Member 'UUaz_Animation_C::VelocityNeedleRot' has a wrong offset!");

}

