#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UazStanceWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UazStanceWidget.UazStanceWidget_C
// 0x0020 (0x0260 - 0x0240)
class UUazStanceWidget_C final : public UUserWidget
{
public:
	class UVehicleWheelInfoWidget_C*              VehicleTireSeatInfoWidget_3;                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeatInfoWidget_C_6;                     // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeatInfoWidget_C_7;                     // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UVehicleWheelInfoWidget_C*              VehicleTireSeatInfoWidget_C_8;                     // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UazStanceWidget_C">();
	}
	static class UUazStanceWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUazStanceWidget_C>();
	}
};
static_assert(alignof(UUazStanceWidget_C) == 0x000008, "Wrong alignment on UUazStanceWidget_C");
static_assert(sizeof(UUazStanceWidget_C) == 0x000260, "Wrong size on UUazStanceWidget_C");
static_assert(offsetof(UUazStanceWidget_C, VehicleTireSeatInfoWidget_3) == 0x000240, "Member 'UUazStanceWidget_C::VehicleTireSeatInfoWidget_3' has a wrong offset!");
static_assert(offsetof(UUazStanceWidget_C, VehicleTireSeatInfoWidget_C_6) == 0x000248, "Member 'UUazStanceWidget_C::VehicleTireSeatInfoWidget_C_6' has a wrong offset!");
static_assert(offsetof(UUazStanceWidget_C, VehicleTireSeatInfoWidget_C_7) == 0x000250, "Member 'UUazStanceWidget_C::VehicleTireSeatInfoWidget_C_7' has a wrong offset!");
static_assert(offsetof(UUazStanceWidget_C, VehicleTireSeatInfoWidget_C_8) == 0x000258, "Member 'UUazStanceWidget_C::VehicleTireSeatInfoWidget_C_8' has a wrong offset!");

}

