#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UiSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UiSettings.UiSettings_C
// 0x0038 (0x02B0 - 0x0278)
class UUiSettings_C final : public UTslBaseOptionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQualityComboBox_C*                     ColorblindComboBox;                                // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UPresetColorComboBoxWidget_C*           CrosshairColorComboBox;                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     EquipmentsComboBox;                                // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     InventoryScreenCharacterComboBox;                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     WeaponSlotComboBox;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualitySliderWidget_C*                 WorldMapZoomSpeed;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)

public:
	void ExecuteUbergraph_UiSettings(int32 EntryPoint);
	void OnApply();
	void Construct();
	void OnDefault();
	void InitUiSetting();
	void SetToDefault();
	void ApplyByCurrentSelectedSettings();

	bool IsEnableApply() const;
	bool IsChanged() const;
	void GetSelectUseCharacterCapture(bool* UseCharacterCapture) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UiSettings_C">();
	}
	static class UUiSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUiSettings_C>();
	}
};
static_assert(alignof(UUiSettings_C) == 0x000008, "Wrong alignment on UUiSettings_C");
static_assert(sizeof(UUiSettings_C) == 0x0002B0, "Wrong size on UUiSettings_C");
static_assert(offsetof(UUiSettings_C, UberGraphFrame) == 0x000278, "Member 'UUiSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, ColorblindComboBox) == 0x000280, "Member 'UUiSettings_C::ColorblindComboBox' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, CrosshairColorComboBox) == 0x000288, "Member 'UUiSettings_C::CrosshairColorComboBox' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, EquipmentsComboBox) == 0x000290, "Member 'UUiSettings_C::EquipmentsComboBox' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, InventoryScreenCharacterComboBox) == 0x000298, "Member 'UUiSettings_C::InventoryScreenCharacterComboBox' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, WeaponSlotComboBox) == 0x0002A0, "Member 'UUiSettings_C::WeaponSlotComboBox' has a wrong offset!");
static_assert(offsetof(UUiSettings_C, WorldMapZoomSpeed) == 0x0002A8, "Member 'UUiSettings_C::WorldMapZoomSpeed' has a wrong offset!");

}

