#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleSeatBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VehicleSeatBase.VehicleSeatBase_C
// 0x0028 (0x0458 - 0x0430)
class AVehicleSeatBase_C : public ATslVehicleSeatActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       VehicleSeatInteractionCollision;                   // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UInteractionComponent*                  Interaction;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         LastInteractionTime;                               // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_VehicleSeatBase(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BndEvt__Interaction_K2Node_ComponentBoundEvent_63_ComponentInteractBySignature__DelegateSignature(class ATslCharacter* OtherCharacter);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VehicleSeatBase_C">();
	}
	static class AVehicleSeatBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVehicleSeatBase_C>();
	}
};
static_assert(alignof(AVehicleSeatBase_C) == 0x000008, "Wrong alignment on AVehicleSeatBase_C");
static_assert(sizeof(AVehicleSeatBase_C) == 0x000458, "Wrong size on AVehicleSeatBase_C");
static_assert(offsetof(AVehicleSeatBase_C, UberGraphFrame) == 0x000430, "Member 'AVehicleSeatBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVehicleSeatBase_C, VehicleSeatInteractionCollision) == 0x000438, "Member 'AVehicleSeatBase_C::VehicleSeatInteractionCollision' has a wrong offset!");
static_assert(offsetof(AVehicleSeatBase_C, Interaction) == 0x000440, "Member 'AVehicleSeatBase_C::Interaction' has a wrong offset!");
static_assert(offsetof(AVehicleSeatBase_C, DefaultSceneRoot) == 0x000448, "Member 'AVehicleSeatBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AVehicleSeatBase_C, LastInteractionTime) == 0x000450, "Member 'AVehicleSeatBase_C::LastInteractionTime' has a wrong offset!");

}

