#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceSettingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BaseOptionWidget_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceSettingWidget.VoiceSettingWidget_C
// 0x0090 (0x0308 - 0x0278)
class UVoiceSettingWidget_C final : public UBaseOptionWidget_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildOptionTitleWidget_C*              ChildOptionTitleWidget;                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     MyVoiceComboBox;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualityComboBox_C*                     VoiceChannelComboBox;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualitySliderWidget_C*                 VoiceInputVolumeSlider;                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UQualitySliderWidget_C*                 VoiceOutputVolumeSlider;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FString                                 MyVoiceAlwaysOptionString;                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 MyVoicePushToTalkOptionString;                     // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 MyVoiceMuteOptionString;                           // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 VoiceChannelAllOptionString;                       // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 VoiceChannelOnlyTeamOptionString;                  // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 VoiceChannelNoneOptionString;                      // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_VoiceSettingWidget(int32 EntryPoint);
	void OnReset();
	void OnDefault();
	void OnApply();
	void Construct();
	void UpdateVoiceSettingWidget();
	bool IsChanged();

	void GetMyVoiceOptionString(class FString* OptionString) const;
	void GetVoiceChannelOptionString(class FString* OptionString) const;
	void GetMyVoiceByOption(bool* bIsMuted, bool* bUsePushToTalk) const;
	void GetVoiceChannelByOption(bool* GlobalChannel, bool* TeamChannel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceSettingWidget_C">();
	}
	static class UVoiceSettingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceSettingWidget_C>();
	}
};
static_assert(alignof(UVoiceSettingWidget_C) == 0x000008, "Wrong alignment on UVoiceSettingWidget_C");
static_assert(sizeof(UVoiceSettingWidget_C) == 0x000308, "Wrong size on UVoiceSettingWidget_C");
static_assert(offsetof(UVoiceSettingWidget_C, UberGraphFrame) == 0x000278, "Member 'UVoiceSettingWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, ChildOptionTitleWidget) == 0x000280, "Member 'UVoiceSettingWidget_C::ChildOptionTitleWidget' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, MyVoiceComboBox) == 0x000288, "Member 'UVoiceSettingWidget_C::MyVoiceComboBox' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceChannelComboBox) == 0x000290, "Member 'UVoiceSettingWidget_C::VoiceChannelComboBox' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceInputVolumeSlider) == 0x000298, "Member 'UVoiceSettingWidget_C::VoiceInputVolumeSlider' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceOutputVolumeSlider) == 0x0002A0, "Member 'UVoiceSettingWidget_C::VoiceOutputVolumeSlider' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, MyVoiceAlwaysOptionString) == 0x0002A8, "Member 'UVoiceSettingWidget_C::MyVoiceAlwaysOptionString' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, MyVoicePushToTalkOptionString) == 0x0002B8, "Member 'UVoiceSettingWidget_C::MyVoicePushToTalkOptionString' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, MyVoiceMuteOptionString) == 0x0002C8, "Member 'UVoiceSettingWidget_C::MyVoiceMuteOptionString' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceChannelAllOptionString) == 0x0002D8, "Member 'UVoiceSettingWidget_C::VoiceChannelAllOptionString' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceChannelOnlyTeamOptionString) == 0x0002E8, "Member 'UVoiceSettingWidget_C::VoiceChannelOnlyTeamOptionString' has a wrong offset!");
static_assert(offsetof(UVoiceSettingWidget_C, VoiceChannelNoneOptionString) == 0x0002F8, "Member 'UVoiceSettingWidget_C::VoiceChannelNoneOptionString' has a wrong offset!");

}

