#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceSettingWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function VoiceSettingWidget.VoiceSettingWidget_C.ExecuteUbergraph_VoiceSettingWidget
// 0x0018 (0x0018 - 0x0000)
struct VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMyVoiceByOption_bIsMuted;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetMyVoiceByOption_bUsePushToTalk;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVoiceChannelByOption_GlobalChannel;    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVoiceChannelByOption_TeamChannel;      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueByRange_Value;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueByRange_Value2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue2;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget) == 0x000004, "Wrong alignment on VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget");
static_assert(sizeof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget) == 0x000018, "Wrong size on VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, EntryPoint) == 0x000000, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetMyVoiceByOption_bIsMuted) == 0x000004, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetMyVoiceByOption_bIsMuted' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetMyVoiceByOption_bUsePushToTalk) == 0x000005, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetMyVoiceByOption_bUsePushToTalk' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetVoiceChannelByOption_GlobalChannel) == 0x000006, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetVoiceChannelByOption_GlobalChannel' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetVoiceChannelByOption_TeamChannel) == 0x000007, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetVoiceChannelByOption_TeamChannel' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetValueByRange_Value) == 0x000008, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetValueByRange_Value' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_GetValueByRange_Value2) == 0x00000C, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_GetValueByRange_Value2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget, CallFunc_FTrunc_ReturnValue2) == 0x000014, "Member 'VoiceSettingWidget_C_ExecuteUbergraph_VoiceSettingWidget::CallFunc_FTrunc_ReturnValue2' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.UpdateVoiceSettingWidget
// 0x0030 (0x0030 - 0x0000)
struct VoiceSettingWidget_C_UpdateVoiceSettingWidget final
{
public:
	class FString                                 CallFunc_GetVoiceChannelOptionString_OptionString; // 0x0000(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_GetMyVoiceOptionString_OptionString;      // 0x0010(0x0010)(ZeroConstructor)
	int32                                         CallFunc_GetVoiceOutputVolume_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetVoiceInputVolume_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_UpdateVoiceSettingWidget) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_UpdateVoiceSettingWidget");
static_assert(sizeof(VoiceSettingWidget_C_UpdateVoiceSettingWidget) == 0x000030, "Wrong size on VoiceSettingWidget_C_UpdateVoiceSettingWidget");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_GetVoiceChannelOptionString_OptionString) == 0x000000, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_GetVoiceChannelOptionString_OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_GetMyVoiceOptionString_OptionString) == 0x000010, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_GetMyVoiceOptionString_OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_GetVoiceOutputVolume_ReturnValue) == 0x000020, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_GetVoiceOutputVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000024, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_GetVoiceInputVolume_ReturnValue) == 0x000028, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_GetVoiceInputVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_UpdateVoiceSettingWidget, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x00002C, "Member 'VoiceSettingWidget_C_UpdateVoiceSettingWidget::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.IsChanged
// 0x0070 (0x0070 - 0x0000)
struct VoiceSettingWidget_C_IsChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetVoiceInputVolume_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetVoiceOutputVolume_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueByRange_Value;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueByRange_Value2;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FTrunc_ReturnValue2;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetVoiceChannelOptionString_OptionString; // 0x0020(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_GetMyVoiceOptionString_OptionString;      // 0x0030(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0040(0x0010)(ZeroConstructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption2;        // 0x0058(0x0010)(ZeroConstructor)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue2;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_IsChanged) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_IsChanged");
static_assert(sizeof(VoiceSettingWidget_C_IsChanged) == 0x000070, "Wrong size on VoiceSettingWidget_C_IsChanged");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, ReturnValue) == 0x000000, "Member 'VoiceSettingWidget_C_IsChanged::ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetVoiceInputVolume_ReturnValue) == 0x000004, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetVoiceInputVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetVoiceOutputVolume_ReturnValue) == 0x000008, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetVoiceOutputVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetValueByRange_Value) == 0x00000C, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetValueByRange_Value' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetValueByRange_Value2) == 0x000010, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetValueByRange_Value2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_FTrunc_ReturnValue2) == 0x000018, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_FTrunc_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001C, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x00001D, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetVoiceChannelOptionString_OptionString) == 0x000020, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetVoiceChannelOptionString_OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetMyVoiceOptionString_OptionString) == 0x000030, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetMyVoiceOptionString_OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetSelectedOption_SelectedOption) == 0x000040, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_NotEqual_StrStr_ReturnValue) == 0x000050, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_GetSelectedOption_SelectedOption2) == 0x000058, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_GetSelectedOption_SelectedOption2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_NotEqual_StrStr_ReturnValue2) == 0x000068, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_NotEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_BooleanOR_ReturnValue) == 0x000069, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_BooleanOR_ReturnValue2) == 0x00006A, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_IsChanged, CallFunc_BooleanOR_ReturnValue3) == 0x00006B, "Member 'VoiceSettingWidget_C_IsChanged::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.GetMyVoiceOptionString
// 0x0018 (0x0018 - 0x0000)
struct VoiceSettingWidget_C_GetMyVoiceOptionString final
{
public:
	class FString                                 OptionString;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          CallFunc_GetUsePushToTalk_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVoiceOutputMute_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_GetMyVoiceOptionString) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_GetMyVoiceOptionString");
static_assert(sizeof(VoiceSettingWidget_C_GetMyVoiceOptionString) == 0x000018, "Wrong size on VoiceSettingWidget_C_GetMyVoiceOptionString");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceOptionString, OptionString) == 0x000000, "Member 'VoiceSettingWidget_C_GetMyVoiceOptionString::OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceOptionString, CallFunc_GetUsePushToTalk_ReturnValue) == 0x000010, "Member 'VoiceSettingWidget_C_GetMyVoiceOptionString::CallFunc_GetUsePushToTalk_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceOptionString, CallFunc_IsVoiceOutputMute_ReturnValue) == 0x000011, "Member 'VoiceSettingWidget_C_GetMyVoiceOptionString::CallFunc_IsVoiceOutputMute_ReturnValue' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.GetVoiceChannelOptionString
// 0x0018 (0x0018 - 0x0000)
struct VoiceSettingWidget_C_GetVoiceChannelOptionString final
{
public:
	class FString                                 OptionString;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          CallFunc_GetUseTeamVoice_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetUseGlobalVoice_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_GetVoiceChannelOptionString) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_GetVoiceChannelOptionString");
static_assert(sizeof(VoiceSettingWidget_C_GetVoiceChannelOptionString) == 0x000018, "Wrong size on VoiceSettingWidget_C_GetVoiceChannelOptionString");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelOptionString, OptionString) == 0x000000, "Member 'VoiceSettingWidget_C_GetVoiceChannelOptionString::OptionString' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelOptionString, CallFunc_GetUseTeamVoice_ReturnValue) == 0x000010, "Member 'VoiceSettingWidget_C_GetVoiceChannelOptionString::CallFunc_GetUseTeamVoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelOptionString, CallFunc_GetUseGlobalVoice_ReturnValue) == 0x000011, "Member 'VoiceSettingWidget_C_GetVoiceChannelOptionString::CallFunc_GetUseGlobalVoice_ReturnValue' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.GetMyVoiceByOption
// 0x0020 (0x0020 - 0x0000)
struct VoiceSettingWidget_C_GetMyVoiceByOption final
{
public:
	bool                                          bIsMuted;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUsePushToTalk;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0008(0x0010)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_GetMyVoiceByOption) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_GetMyVoiceByOption");
static_assert(sizeof(VoiceSettingWidget_C_GetMyVoiceByOption) == 0x000020, "Wrong size on VoiceSettingWidget_C_GetMyVoiceByOption");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceByOption, bIsMuted) == 0x000000, "Member 'VoiceSettingWidget_C_GetMyVoiceByOption::bIsMuted' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceByOption, bUsePushToTalk) == 0x000001, "Member 'VoiceSettingWidget_C_GetMyVoiceByOption::bUsePushToTalk' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceByOption, CallFunc_GetSelectedOption_SelectedOption) == 0x000008, "Member 'VoiceSettingWidget_C_GetMyVoiceByOption::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceByOption, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'VoiceSettingWidget_C_GetMyVoiceByOption::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetMyVoiceByOption, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000019, "Member 'VoiceSettingWidget_C_GetMyVoiceByOption::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");

// Function VoiceSettingWidget.VoiceSettingWidget_C.GetVoiceChannelByOption
// 0x0020 (0x0020 - 0x0000)
struct VoiceSettingWidget_C_GetVoiceChannelByOption final
{
public:
	bool                                          GlobalChannel;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          TeamChannel;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSelectedOption_SelectedOption;         // 0x0008(0x0010)(ZeroConstructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VoiceSettingWidget_C_GetVoiceChannelByOption) == 0x000008, "Wrong alignment on VoiceSettingWidget_C_GetVoiceChannelByOption");
static_assert(sizeof(VoiceSettingWidget_C_GetVoiceChannelByOption) == 0x000020, "Wrong size on VoiceSettingWidget_C_GetVoiceChannelByOption");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, GlobalChannel) == 0x000000, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::GlobalChannel' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, TeamChannel) == 0x000001, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::TeamChannel' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, CallFunc_GetSelectedOption_SelectedOption) == 0x000008, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::CallFunc_GetSelectedOption_SelectedOption' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000019, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(VoiceSettingWidget_C_GetVoiceChannelByOption, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'VoiceSettingWidget_C_GetVoiceChannelByOption::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

