#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponEquipmentWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.ExecuteUbergraph_WeaponEquipmentWidget
// 0x0260 (0x0260 - 0x0000)
struct WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Variable;                                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x0040(0x0034)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x0078(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x00F8(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipment*                             CallFunc_GetEquipment_Equipment;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01A0(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_EnterOtherContainer_NewOtherContainer_CastInput; // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UDragDropOperation*                     CallFunc_GetDragDroppingContent_ReturnValue;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     K2Node_Event_Inventory;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_Equipment2;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        CallFunc_GetSelfPutAttachment_GamepadadSelectedAttachableItem; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FindAttachableWeaponIndex_ReturnValue;    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23D[0x3];                                      // 0x023D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponEquipmentSlotWidget_C*           CallFunc_Array_Get_Item;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponEquipmentSlotWidget_C*           CallFunc_Array_Get_Item2;                          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget");
static_assert(sizeof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget) == 0x000260, "Wrong size on WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, EntryPoint) == 0x000000, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, m__int_Variable) == 0x000004, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::m__int_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, m__bool_Variable) == 0x00003D, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00003E, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_MyGeometry2) == 0x000040, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_PointerEvent2) == 0x000078, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_Operation2) == 0x0000F0, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_PointerEvent) == 0x0000F8, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_Operation) == 0x000170, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x000178, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2) == 0x000188, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_bSuccess2) == 0x000190, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_GetEquipment_Equipment) == 0x000198, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_GetEquipment_Equipment' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_MyGeometry) == 0x0001A0, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_InDeltaTime) == 0x0001D4, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_EnterOtherContainer_NewOtherContainer_CastInput) == 0x0001D8, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_EnterOtherContainer_NewOtherContainer_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_GetDragDroppingContent_ReturnValue) == 0x0001E8, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_GetDragDroppingContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3) == 0x0001F0, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_DynamicCast_bSuccess3) == 0x0001F8, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000200, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000210, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, K2Node_Event_Inventory) == 0x000218, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::K2Node_Event_Inventory' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_GetEquipment_Equipment2) == 0x000220, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_GetEquipment_Equipment2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Add_IntInt_ReturnValue2) == 0x000228, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_IsValid_ReturnValue) == 0x00022C, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_GetSelfPutAttachment_GamepadadSelectedAttachableItem) == 0x000230, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_GetSelfPutAttachment_GamepadadSelectedAttachableItem' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_FindAttachableWeaponIndex_ReturnValue) == 0x000238, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_FindAttachableWeaponIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00023C, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Array_Get_Item) == 0x000240, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000248, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_BooleanAND_ReturnValue2) == 0x000249, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Array_Get_Item2) == 0x000250, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000258, "Member 'WeaponEquipmentWidget_C_ExecuteUbergraph_WeaponEquipmentWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.SetInventoryWidget
// 0x0008 (0x0008 - 0x0000)
struct WeaponEquipmentWidget_C_SetInventoryWidget final
{
public:
	class UInventoryWidget_C*                     Inventory;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_SetInventoryWidget) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_SetInventoryWidget");
static_assert(sizeof(WeaponEquipmentWidget_C_SetInventoryWidget) == 0x000008, "Wrong size on WeaponEquipmentWidget_C_SetInventoryWidget");
static_assert(offsetof(WeaponEquipmentWidget_C_SetInventoryWidget, Inventory) == 0x000000, "Member 'WeaponEquipmentWidget_C_SetInventoryWidget::Inventory' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct WeaponEquipmentWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_Tick) == 0x000004, "Wrong alignment on WeaponEquipmentWidget_C_Tick");
static_assert(sizeof(WeaponEquipmentWidget_C_Tick) == 0x000038, "Wrong size on WeaponEquipmentWidget_C_Tick");
static_assert(offsetof(WeaponEquipmentWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WeaponEquipmentWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'WeaponEquipmentWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct WeaponEquipmentWidget_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_OnDragLeave) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_OnDragLeave");
static_assert(sizeof(WeaponEquipmentWidget_C_OnDragLeave) == 0x000080, "Wrong size on WeaponEquipmentWidget_C_OnDragLeave");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WeaponEquipmentWidget_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDragLeave, Operation) == 0x000078, "Member 'WeaponEquipmentWidget_C_OnDragLeave::Operation' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WeaponEquipmentWidget_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_OnDragEnter) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_OnDragEnter");
static_assert(sizeof(WeaponEquipmentWidget_C_OnDragEnter) == 0x0000B8, "Wrong size on WeaponEquipmentWidget_C_OnDragEnter");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WeaponEquipmentWidget_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'WeaponEquipmentWidget_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDragEnter, Operation) == 0x0000B0, "Member 'WeaponEquipmentWidget_C_OnDragEnter::Operation' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.GetWeaponItemByTabIndex
// 0x0058 (0x0058 - 0x0000)
struct WeaponEquipmentWidget_C_GetWeaponItemByTabIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponItem*                            WeaponItem;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponEquipmentSlotWidget_C*           CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotWidgetBaseInterface_C> CallFunc_GetSlotItem_self_CastInput;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponItem*                            K2Node_DynamicCast_AsWeapon_Item;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_GetWeaponItemByTabIndex");
static_assert(sizeof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex) == 0x000058, "Wrong size on WeaponEquipmentWidget_C_GetWeaponItemByTabIndex");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, Index_0) == 0x000000, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, WeaponItem) == 0x000008, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::WeaponItem' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, CallFunc_Array_Get_Item) == 0x000010, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, CallFunc_GetSlotItem_self_CastInput) == 0x000020, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::CallFunc_GetSlotItem_self_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, CallFunc_GetSlotItem_SlotItem) == 0x000030, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::CallFunc_GetSlotItem_SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000040, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, K2Node_DynamicCast_AsWeapon_Item) == 0x000048, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::K2Node_DynamicCast_AsWeapon_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetWeaponItemByTabIndex, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WeaponEquipmentWidget_C_GetWeaponItemByTabIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.OnDrop
// 0x0138 (0x0138 - 0x0000)
struct WeaponEquipmentWidget_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotWidgetBaseInterface_C> K2Node_DynamicCast_AsSlot_Widget_Base_Interface;   // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotItem_SlotItem;                     // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachment_ReturnValue;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponIndex_ReturnValue;               // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer;           // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponItem*                            CallFunc_GetWeaponItemByTabIndex_WeaponItem;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_Equipment;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotContainerInterface> CallFunc_DropSlotOnOtherContainer_OtherContainer_CastInput; // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_DropSlotOnOtherContainer_OtherContainer2_CastInput; // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_OnDrop) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_OnDrop");
static_assert(sizeof(WeaponEquipmentWidget_C_OnDrop) == 0x000138, "Wrong size on WeaponEquipmentWidget_C_OnDrop");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, MyGeometry) == 0x000000, "Member 'WeaponEquipmentWidget_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, PointerEvent) == 0x000038, "Member 'WeaponEquipmentWidget_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, Operation) == 0x0000B0, "Member 'WeaponEquipmentWidget_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, ReturnValue) == 0x0000B8, "Member 'WeaponEquipmentWidget_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, K2Node_DynamicCast_AsSlot_Widget_Base_Interface) == 0x0000C0, "Member 'WeaponEquipmentWidget_C_OnDrop::K2Node_DynamicCast_AsSlot_Widget_Base_Interface' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'WeaponEquipmentWidget_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_GetSlotItem_SlotItem) == 0x0000D8, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_GetSlotItem_SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_IsAttachment_ReturnValue) == 0x0000E9, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_IsAttachment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_GetWeaponIndex_ReturnValue) == 0x0000EC, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_GetWeaponIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_GetSlotContainer_SlotContainer) == 0x0000F0, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_GetSlotContainer_SlotContainer' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_GetWeaponItemByTabIndex_WeaponItem) == 0x000100, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_GetWeaponItemByTabIndex_WeaponItem' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_GetEquipment_Equipment) == 0x000108, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_GetEquipment_Equipment' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_IsValid_ReturnValue2) == 0x000110, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_DropSlotOnOtherContainer_OtherContainer_CastInput) == 0x000118, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_DropSlotOnOtherContainer_OtherContainer_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnDrop, CallFunc_DropSlotOnOtherContainer_OtherContainer2_CastInput) == 0x000128, "Member 'WeaponEquipmentWidget_C_OnDrop::CallFunc_DropSlotOnOtherContainer_OtherContainer2_CastInput' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.InitializeWeaponEquipment
// 0x0030 (0x0030 - 0x0000)
struct WeaponEquipmentWidget_C_InitializeWeaponEquipment final
{
public:
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponProcessor*                       CallFunc_GetWeaponProcessor_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_InitializeWeaponEquipment) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_InitializeWeaponEquipment");
static_assert(sizeof(WeaponEquipmentWidget_C_InitializeWeaponEquipment) == 0x000030, "Wrong size on WeaponEquipmentWidget_C_InitializeWeaponEquipment");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000000, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_GetWeaponProcessor_ReturnValue) == 0x000010, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_GetWeaponProcessor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_Array_Add_ReturnValue2) == 0x00001C, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_Array_Add_ReturnValue3) == 0x000020, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_Array_Add_ReturnValue4) == 0x000024, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_InitializeWeaponEquipment, CallFunc_Array_Add_ReturnValue5) == 0x000028, "Member 'WeaponEquipmentWidget_C_InitializeWeaponEquipment::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.MainPrepass
// 0x0050 (0x0050 - 0x0000)
struct WeaponEquipmentWidget_C_MainPrepass final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           m__struct_Variable;                                // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsXBoxOnePlatform_NewParam;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_InventoryFocusingColor_NewParam;          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetWeaponIndex_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_MainPrepass) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_MainPrepass");
static_assert(sizeof(WeaponEquipmentWidget_C_MainPrepass) == 0x000050, "Wrong size on WeaponEquipmentWidget_C_MainPrepass");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, BoundWidget) == 0x000000, "Member 'WeaponEquipmentWidget_C_MainPrepass::BoundWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, m__bool_Variable) == 0x000008, "Member 'WeaponEquipmentWidget_C_MainPrepass::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, m__struct_Variable) == 0x00000C, "Member 'WeaponEquipmentWidget_C_MainPrepass::m__struct_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_IsFocus_ReturnValue) == 0x00001C, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_IsXBoxOnePlatform_NewParam) == 0x00001D, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_IsXBoxOnePlatform_NewParam' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_InventoryFocusingColor_NewParam) == 0x000020, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_InventoryFocusingColor_NewParam' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_GetFocusingChildWidget_ReturnValue) == 0x000030, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_GetFocusingChildWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_IsValid_ReturnValue2) == 0x000039, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, K2Node_Select_Default) == 0x00003C, "Member 'WeaponEquipmentWidget_C_MainPrepass::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_MainPrepass, CallFunc_GetWeaponIndex_ReturnValue) == 0x00004C, "Member 'WeaponEquipmentWidget_C_MainPrepass::CallFunc_GetWeaponIndex_ReturnValue' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.GetEquipment
// 0x0028 (0x0028 - 0x0000)
struct WeaponEquipmentWidget_C_GetEquipment final
{
public:
	class AEquipment*                             Equipment_0;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipment*                             CallFunc_GetEquipment_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_GetEquipment) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_GetEquipment");
static_assert(sizeof(WeaponEquipmentWidget_C_GetEquipment) == 0x000028, "Wrong size on WeaponEquipmentWidget_C_GetEquipment");
static_assert(offsetof(WeaponEquipmentWidget_C_GetEquipment, Equipment_0) == 0x000000, "Member 'WeaponEquipmentWidget_C_GetEquipment::Equipment_0' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetEquipment, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x000008, "Member 'WeaponEquipmentWidget_C_GetEquipment::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetEquipment, CallFunc_GetInventoryFacade_ReturnValue) == 0x000010, "Member 'WeaponEquipmentWidget_C_GetEquipment::CallFunc_GetInventoryFacade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetEquipment, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_GetEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_GetEquipment, CallFunc_GetEquipment_ReturnValue) == 0x000020, "Member 'WeaponEquipmentWidget_C_GetEquipment::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.OnChildSlotRefreshFocus
// 0x0078 (0x0078 - 0x0000)
struct WeaponEquipmentWidget_C_OnChildSlotRefreshFocus final
{
public:
	bool                                          m__bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindFirtFocusableWidgetIndex_Index;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_FindFirtFocusableWidgetIndex_Index2;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue2;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocusable_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetFocusingChildWidget_ReturnValue3;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3; // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_OnChildSlotRefreshFocus");
static_assert(sizeof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus) == 0x000078, "Wrong size on WeaponEquipmentWidget_C_OnChildSlotRefreshFocus");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, m__bool_Variable) == 0x000000, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_FindFirtFocusableWidgetIndex_Index) == 0x000004, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_FindFirtFocusableWidgetIndex_Index' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_FindFirtFocusableWidgetIndex_Index2) == 0x000008, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_FindFirtFocusableWidgetIndex_Index2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_GetFocusingChildWidget_ReturnValue) == 0x000010, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_GetFocusingChildWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface) == 0x000020, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_SetFocus_ReturnValue) == 0x000031, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_SetFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_GetFocusingChildWidget_ReturnValue2) == 0x000038, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_GetFocusingChildWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2) == 0x000040, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_bSuccess2) == 0x000050, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_IsFocusable_ReturnValue) == 0x000052, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_IsFocusable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_GetFocusingChildWidget_ReturnValue3) == 0x000058, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_GetFocusingChildWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3) == 0x000060, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_OnChildSlotRefreshFocus, CallFunc_SetFocus_ReturnValue2) == 0x000071, "Member 'WeaponEquipmentWidget_C_OnChildSlotRefreshFocus::CallFunc_SetFocus_ReturnValue2' has a wrong offset!");

// Function WeaponEquipmentWidget.WeaponEquipmentWidget_C.StartSelfAttachmentPut
// 0x0050 (0x0050 - 0x0000)
struct WeaponEquipmentWidget_C_StartSelfAttachmentPut final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEquipment*                             CallFunc_GetEquipment_Equipment;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponEquipmentSlotWidget_C*           CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindAttachableWeaponIndex_ReturnValue;    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponEquipmentSlotWidget_C*           CallFunc_Array_Get_Item2;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentWidget_C_StartSelfAttachmentPut) == 0x000008, "Wrong alignment on WeaponEquipmentWidget_C_StartSelfAttachmentPut");
static_assert(sizeof(WeaponEquipmentWidget_C_StartSelfAttachmentPut) == 0x000050, "Wrong size on WeaponEquipmentWidget_C_StartSelfAttachmentPut");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, bResult) == 0x000000, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::bResult' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, m__int_Array_Index_Variable) == 0x000004, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, m__int_Loop_Counter_Variable) == 0x000008, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_GetInventoryWidget_InventoryWidget) == 0x000010, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_GetInventoryWidget_InventoryWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_GetEquipment_Equipment) == 0x000020, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_GetEquipment_Equipment' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_Array_Get_Item) == 0x000028, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_FindAttachableWeaponIndex_ReturnValue) == 0x000034, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_FindAttachableWeaponIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentWidget_C_StartSelfAttachmentPut, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WeaponEquipmentWidget_C_StartSelfAttachmentPut::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
