#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TslGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponStudio.WeaponStudio_C
// 0x0060 (0x0460 - 0x0400)
class AWeaponStudio_C final : public AItemStudio
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAsyncStaticMeshComponent*              Attachment_5;                                      // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAsyncStaticMeshComponent*              Attachment_4;                                      // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAsyncStaticMeshComponent*              Attachment_3;                                      // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAsyncStaticMeshComponent*              Attachment_2;                                      // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UAsyncStaticMeshComponent*              Attachment_1;                                      // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor)
	class UItem*                                  Item;                                              // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ATslWeapon_Gun*                         Weapon_Gun;                                        // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class UAsyncStaticMeshComponent*>      Attachments;                                       // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WeaponStudio(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetItem(class UItem* Item_0);
	void UserConstructionScript();
	void UpdateAttachment();
	void OnAttachmentLoad();
	void OnLoad_Test();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponStudio_C">();
	}
	static class AWeaponStudio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponStudio_C>();
	}
};
static_assert(alignof(AWeaponStudio_C) == 0x000010, "Wrong alignment on AWeaponStudio_C");
static_assert(sizeof(AWeaponStudio_C) == 0x000460, "Wrong size on AWeaponStudio_C");
static_assert(offsetof(AWeaponStudio_C, UberGraphFrame) == 0x000400, "Member 'AWeaponStudio_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachment_5) == 0x000408, "Member 'AWeaponStudio_C::Attachment_5' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachment_4) == 0x000410, "Member 'AWeaponStudio_C::Attachment_4' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachment_3) == 0x000418, "Member 'AWeaponStudio_C::Attachment_3' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachment_2) == 0x000420, "Member 'AWeaponStudio_C::Attachment_2' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachment_1) == 0x000428, "Member 'AWeaponStudio_C::Attachment_1' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, SkeletalMesh) == 0x000430, "Member 'AWeaponStudio_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Item) == 0x000438, "Member 'AWeaponStudio_C::Item' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Weapon_Gun) == 0x000440, "Member 'AWeaponStudio_C::Weapon_Gun' has a wrong offset!");
static_assert(offsetof(AWeaponStudio_C, Attachments) == 0x000448, "Member 'AWeaponStudio_C::Attachments' has a wrong offset!");

}

