#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponAttachmentSlotWidget

#include "Basic.hpp"

#include "TslGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.ExecuteUbergraph_WeaponAttachmentSlotWidget
// 0x02B8 (0x02B8 - 0x0000)
struct WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x0004(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x0038(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x00B8(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0138(0x0034)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0170(0x0078)(ConstParm)
	class UTslItemDragDropOperation_C*            CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation2; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation3; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0218(0x0078)(ConstParm)
	class UTslItemDragDropOperation_C*            CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation4; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetSlotContainer_SlotContainer;           // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget) == 0x0002B8, "Wrong size on WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, EntryPoint) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_MyGeometry2) == 0x000004, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_PointerEvent2) == 0x000038, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_Operation2) == 0x0000B0, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_PointerEvent) == 0x0000B8, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_Operation) == 0x000130, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_MyGeometry) == 0x000138, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_MouseEvent2) == 0x000170, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation) == 0x0001E8, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_IsValid_ReturnValue) == 0x0001F0, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation2) == 0x0001F8, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_IsValid_ReturnValue2) == 0x000200, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation3) == 0x000208, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation3' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_IsValid_ReturnValue3) == 0x000210, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, K2Node_Event_MouseEvent) == 0x000218, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation4) == 0x000290, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation4' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetSlotContainer_SlotContainer) == 0x000298, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetSlotContainer_SlotContainer' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_IsValid_ReturnValue4) == 0x0002A8, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_IsValid_ReturnValue5) == 0x0002A9, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0002B0, "Member 'WeaponAttachmentSlotWidget_C_ExecuteUbergraph_WeaponAttachmentSlotWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnMouseLeave");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnMouseLeave) == 0x000078, "Wrong size on WeaponAttachmentSlotWidget_C_OnMouseLeave");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnMouseEnter");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnMouseEnter) == 0x0000B0, "Wrong size on WeaponAttachmentSlotWidget_C_OnMouseEnter");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WeaponAttachmentSlotWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnDragLeave
// 0x0080 (0x0080 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnDragLeave) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnDragLeave");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnDragLeave) == 0x000080, "Wrong size on WeaponAttachmentSlotWidget_C_OnDragLeave");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragLeave, Operation) == 0x000078, "Member 'WeaponAttachmentSlotWidget_C_OnDragLeave::Operation' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnDragEnter
// 0x00B8 (0x00B8 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnDragEnter) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnDragEnter");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnDragEnter) == 0x0000B8, "Wrong size on WeaponAttachmentSlotWidget_C_OnDragEnter");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'WeaponAttachmentSlotWidget_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragEnter, Operation) == 0x0000B0, "Member 'WeaponAttachmentSlotWidget_C_OnDragEnter::Operation' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.GetAttachmentNameText
// 0x0058 (0x0058 - 0x0000)
struct WeaponAttachmentSlotWidget_C_GetAttachmentNameText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        CallFunc_GetAttachedItem_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetSlotName_self_CastInput;               // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetSlotName_ReturnValue;                  // 0x0040(0x0018)()
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_GetAttachmentNameText");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText) == 0x000058, "Wrong size on WeaponAttachmentSlotWidget_C_GetAttachmentNameText");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, ReturnValue) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, CallFunc_GetAttachedItem_ReturnValue) == 0x000020, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::CallFunc_GetAttachedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, CallFunc_IsValid_ReturnValue2) == 0x000028, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, CallFunc_GetSlotName_self_CastInput) == 0x000030, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::CallFunc_GetSlotName_self_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentNameText, CallFunc_GetSlotName_ReturnValue) == 0x000040, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentNameText::CallFunc_GetSlotName_ReturnValue' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.GetSlotIcon
// 0x0218 (0x0218 - 0x0000)
struct WeaponAttachmentSlotWidget_C_GetSlotIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
	class UAttachableItem*                        CallFunc_GetAttachmentItem_AttachmentItem;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0098(0x0090)()
	class UTexture*                               CallFunc_GetIconTexture_ReturnValue;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetIconSizeRatio_self_CastInput;          // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetIconSizeRatio_ReturnValue;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0158(0x0028)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x0188(0x0090)()
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_GetSlotIcon) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_GetSlotIcon");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_GetSlotIcon) == 0x000218, "Wrong size on WeaponAttachmentSlotWidget_C_GetSlotIcon");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, ReturnValue) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_GetAttachmentItem_AttachmentItem) == 0x000090, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_GetAttachmentItem_AttachmentItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, K2Node_MakeStruct_SlateBrush) == 0x000098, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_GetIconTexture_ReturnValue) == 0x000128, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_GetIconTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_GetIconSizeRatio_self_CastInput) == 0x000138, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_GetIconSizeRatio_self_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_GetIconSizeRatio_ReturnValue) == 0x000148, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_GetIconSizeRatio_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_IsValid_ReturnValue2) == 0x00014C, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, K2Node_MakeStruct_SlateColor) == 0x000158, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, CallFunc_MakeVector2D_ReturnValue) == 0x000180, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotIcon, K2Node_MakeStruct_SlateBrush2) == 0x000188, "Member 'WeaponAttachmentSlotWidget_C_GetSlotIcon::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.GetSlotVisibility
// 0x0018 (0x0018 - 0x0000)
struct WeaponAttachmentSlotWidget_C_GetSlotVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        CallFunc_GetAttachedItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_GetSlotVisibility) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_GetSlotVisibility");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_GetSlotVisibility) == 0x000018, "Wrong size on WeaponAttachmentSlotWidget_C_GetSlotVisibility");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotVisibility, ReturnValue) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_GetSlotVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotVisibility, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WeaponAttachmentSlotWidget_C_GetSlotVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotVisibility, CallFunc_GetAttachedItem_ReturnValue) == 0x000008, "Member 'WeaponAttachmentSlotWidget_C_GetSlotVisibility::CallFunc_GetAttachedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetSlotVisibility, CallFunc_IsValid_ReturnValue2) == 0x000010, "Member 'WeaponAttachmentSlotWidget_C_GetSlotVisibility::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnMouseButtonDown
// 0x0438 (0x0438 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00A8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00A8)()
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0200(0x00A8)()
	bool                                          CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterCasting_IsCasting;             // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue2;                     // 0x02B0(0x00A8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        CallFunc_GetAttachedItem_ReturnValue;              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0368(0x00A8)()
	TScriptInterface<class ISlotContainerInterface> CallFunc_DoSlotActionDefault_self_CastInput;       // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_DoSlotActionDefault_Slot_CastInput;       // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnMouseButtonDown");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown) == 0x000438, "Wrong size on WeaponAttachmentSlotWidget_C_OnMouseButtonDown");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000200, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue) == 0x0002A8, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_PointerEvent_IsMouseButtonDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_IsCharacterCasting_IsCasting) == 0x0002A9, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_IsCharacterCasting_IsCasting' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue2) == 0x0002B0, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_IsValid_ReturnValue) == 0x000358, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_IsValid_ReturnValue2) == 0x000359, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_GetAttachedItem_ReturnValue) == 0x000360, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_GetAttachedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000368, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_DoSlotActionDefault_self_CastInput) == 0x000410, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_DoSlotActionDefault_self_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_DoSlotActionDefault_Slot_CastInput) == 0x000420, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_DoSlotActionDefault_Slot_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnMouseButtonDown, CallFunc_IsValid_ReturnValue3) == 0x000430, "Member 'WeaponAttachmentSlotWidget_C_OnMouseButtonDown::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.OnDragDetected
// 0x0118 (0x0118 - 0x0000)
struct WeaponAttachmentSlotWidget_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0078)(ConstParm, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00B0(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UItem*                                  CallFunc_GetOperationSpawnValue_Bp_Item;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UEquipableItem*                         CallFunc_GetOperationSpawnValue_Bp_EquipableItem;  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponItem*                            CallFunc_GetOperationSpawnValue_Bp_WeaponItem;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UThrowableItem*                         CallFunc_GetOperationSpawnValue_Bp_ThrowableItem;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAttachableItem*                        CallFunc_GetOperationSpawnValue_Bp_AttachmentItem; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_GetOperationSpawnValue_Bp_SlotItem;       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetOperationSpawnValue_Bp_Container;      // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            Operaton;                                          // 0x0110(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_OnDragDetected) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_OnDragDetected");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_OnDragDetected) == 0x000118, "Wrong size on WeaponAttachmentSlotWidget_C_OnDragDetected");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, Operation) == 0x0000B0, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000C0, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_Item) == 0x0000C8, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_Item' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_EquipableItem) == 0x0000D0, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_EquipableItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_WeaponItem) == 0x0000D8, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_WeaponItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_ThrowableItem) == 0x0000E0, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_ThrowableItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_AttachmentItem) == 0x0000E8, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_AttachmentItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_SlotItem) == 0x0000F0, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_SlotItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, CallFunc_GetOperationSpawnValue_Bp_Container) == 0x000100, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::CallFunc_GetOperationSpawnValue_Bp_Container' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_OnDragDetected, Operaton) == 0x000110, "Member 'WeaponAttachmentSlotWidget_C_OnDragDetected::Operaton' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.MainPrepass_0
// 0x0010 (0x0010 - 0x0000)
struct WeaponAttachmentSlotWidget_C_MainPrepass_0 final
{
public:
	class UWidget*                                BoundWidget;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          m__bool_Variable;                                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable;                                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              m__byte_Variable2;                                 // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAttachmentSlot_HasAttachmentSlot;      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_MainPrepass_0) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_MainPrepass_0");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_MainPrepass_0) == 0x000010, "Wrong size on WeaponAttachmentSlotWidget_C_MainPrepass_0");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, BoundWidget) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::BoundWidget' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, m__bool_Variable) == 0x000008, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::m__bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, m__byte_Variable) == 0x000009, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::m__byte_Variable' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, m__byte_Variable2) == 0x00000A, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::m__byte_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, CallFunc_HasAttachmentSlot_HasAttachmentSlot) == 0x00000B, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::CallFunc_HasAttachmentSlot_HasAttachmentSlot' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_MainPrepass_0, K2Node_Select_Default) == 0x00000C, "Member 'WeaponAttachmentSlotWidget_C_MainPrepass_0::K2Node_Select_Default' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.HasAttachmentSlot
// 0x0004 (0x0004 - 0x0000)
struct WeaponAttachmentSlotWidget_C_HasAttachmentSlot final
{
public:
	bool                                          HasAttachmentSlot_0;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAttachmentSlot_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot) == 0x000001, "Wrong alignment on WeaponAttachmentSlotWidget_C_HasAttachmentSlot");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot) == 0x000004, "Wrong size on WeaponAttachmentSlotWidget_C_HasAttachmentSlot");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot, HasAttachmentSlot_0) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_HasAttachmentSlot::HasAttachmentSlot_0' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WeaponAttachmentSlotWidget_C_HasAttachmentSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot, CallFunc_HasAttachmentSlot_ReturnValue) == 0x000002, "Member 'WeaponAttachmentSlotWidget_C_HasAttachmentSlot::CallFunc_HasAttachmentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_HasAttachmentSlot, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WeaponAttachmentSlotWidget_C_HasAttachmentSlot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.GetAttachmentItem
// 0x0018 (0x0018 - 0x0000)
struct WeaponAttachmentSlotWidget_C_GetAttachmentItem final
{
public:
	class UAttachableItem*                        AttachmentItem;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAttachableItem*                        CallFunc_GetAttachedItem_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_GetAttachmentItem) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_GetAttachmentItem");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_GetAttachmentItem) == 0x000018, "Wrong size on WeaponAttachmentSlotWidget_C_GetAttachmentItem");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentItem, AttachmentItem) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentItem::AttachmentItem' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentItem, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_GetAttachmentItem, CallFunc_GetAttachedItem_ReturnValue) == 0x000010, "Member 'WeaponAttachmentSlotWidget_C_GetAttachmentItem::CallFunc_GetAttachedItem_ReturnValue' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.IsAttachable
// 0x0004 (0x0004 - 0x0000)
struct WeaponAttachmentSlotWidget_C_IsAttachable final
{
public:
	bool                                          IsAttachable_0;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachable_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_IsAttachable) == 0x000001, "Wrong alignment on WeaponAttachmentSlotWidget_C_IsAttachable");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_IsAttachable) == 0x000004, "Wrong size on WeaponAttachmentSlotWidget_C_IsAttachable");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsAttachable, IsAttachable_0) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_IsAttachable::IsAttachable_0' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsAttachable, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WeaponAttachmentSlotWidget_C_IsAttachable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsAttachable, CallFunc_IsAttachable_ReturnValue) == 0x000002, "Member 'WeaponAttachmentSlotWidget_C_IsAttachable::CallFunc_IsAttachable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsAttachable, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WeaponAttachmentSlotWidget_C_IsAttachable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.IsOhterSlotMouseOver
// 0x0020 (0x0020 - 0x0000)
struct WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver final
{
public:
	bool                                          IsOver;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDragDropOperation*                     CallFunc_GetDragDroppingContent_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver) == 0x000008, "Wrong alignment on WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver");
static_assert(sizeof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver) == 0x000020, "Wrong size on WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, IsOver) == 0x000000, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::IsOver' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_GetDragDroppingContent_ReturnValue) == 0x000008, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_GetDragDroppingContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x000010, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x00001B, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver, CallFunc_BooleanAND_ReturnValue2) == 0x00001D, "Member 'WeaponAttachmentSlotWidget_C_IsOhterSlotMouseOver::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function WeaponAttachmentSlotWidget.WeaponAttachmentSlotWidget_C.IsSlotOn_Bp
// 0x0128 (0x0128 - 0x0000)
struct WeaponAttachmentSlotWidget_C_IsSlotOn_Bp final
{
public:
	bool                                          IsOn;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlotInterface>        CallFunc_GetMouseOverItem_Slot;                    // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_GetMouseOverItem_Container;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UItem*                                  CallFunc_GetMouseOverItem_Item;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UEquipableItem*                         CallFunc_GetMouseOverItem_EquipableItem;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAttachableItem*                        CallFunc_GetMouseOverItem_AttachableItem;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachable_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponAttachmentSlotID                       CallFunc_GetAttachmentSlotID_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindAttachableWeaponIndex_ReturnValue;    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetDefaultActionName_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSpace_ReturnValue;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetCurrentSpace_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AInventory*                             CallFunc_GetInventory_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAttachable_ReturnValue2;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponAttachmentSlotID                       CallFunc_GetAttachmentSlotID_ReturnValue2;         // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOptions_Options;                       // 0x00C0(0x0010)(ZeroConstructor)
	EWeaponAttachmentSlotID                       CallFunc_GetAttachmentSlotID_ReturnValue3;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindAttachableWeaponIndex_ReturnValue2;   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
