#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponStudio

#include "Basic.hpp"

#include "TslGame_structs.hpp"


namespace SDK::Params
{

// Function WeaponStudio.WeaponStudio_C.ExecuteUbergraph_WeaponStudio
// 0x0090 (0x0090 - 0x0000)
struct WeaponStudio_C_ExecuteUbergraph_WeaponStudio final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItem*                                  K2Node_Event_Item;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWeaponItem*                            K2Node_DynamicCast_AsWeapon_Item;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslWeapon*                             CallFunc_GetEquippedWeapon_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslWeapon_Gun*                         K2Node_DynamicCast_AsTsl_Weapon_Gun;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetWeaponMesh_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio) == 0x000008, "Wrong alignment on WeaponStudio_C_ExecuteUbergraph_WeaponStudio");
static_assert(sizeof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio) == 0x000090, "Wrong size on WeaponStudio_C_ExecuteUbergraph_WeaponStudio");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, EntryPoint) == 0x000000, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_Array_Add_ReturnValue2) == 0x00001C, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_Array_Add_ReturnValue3) == 0x000020, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_Array_Add_ReturnValue4) == 0x000024, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_Array_Add_ReturnValue5) == 0x000028, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_Event_Item) == 0x000048, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_DynamicCast_AsWeapon_Item) == 0x000058, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_DynamicCast_AsWeapon_Item' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_GetEquippedWeapon_ReturnValue) == 0x000068, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_GetEquippedWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_DynamicCast_AsTsl_Weapon_Gun) == 0x000070, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_DynamicCast_AsTsl_Weapon_Gun' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_GetWeaponMesh_ReturnValue) == 0x000080, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_GetWeaponMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_ExecuteUbergraph_WeaponStudio, CallFunc_IsValid_ReturnValue2) == 0x000088, "Member 'WeaponStudio_C_ExecuteUbergraph_WeaponStudio::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function WeaponStudio.WeaponStudio_C.SetItem
// 0x0008 (0x0008 - 0x0000)
struct WeaponStudio_C_SetItem final
{
public:
	class UItem*                                  Item_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponStudio_C_SetItem) == 0x000008, "Wrong alignment on WeaponStudio_C_SetItem");
static_assert(sizeof(WeaponStudio_C_SetItem) == 0x000008, "Wrong size on WeaponStudio_C_SetItem");
static_assert(offsetof(WeaponStudio_C_SetItem, Item_0) == 0x000000, "Member 'WeaponStudio_C_SetItem::Item_0' has a wrong offset!");

// Function WeaponStudio.WeaponStudio_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) WeaponStudio_C_UserConstructionScript final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WeaponStudio_C_UserConstructionScript) == 0x000008, "Wrong alignment on WeaponStudio_C_UserConstructionScript");
static_assert(sizeof(WeaponStudio_C_UserConstructionScript) == 0x000010, "Wrong size on WeaponStudio_C_UserConstructionScript");
static_assert(offsetof(WeaponStudio_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WeaponStudio_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WeaponStudio.WeaponStudio_C.UpdateAttachment
// 0x0090 (0x0090 - 0x0000)
struct WeaponStudio_C_UpdateAttachment final
{
public:
	int32                                         m__int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Array_Index_Variable2;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAsyncStaticMeshComponent*              CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponAttachmentAssetData>     CallFunc_GetWeaponAttachmentAssetDatas_ReturnValue; // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	struct FWeaponAttachmentAssetData             CallFunc_Array_Get_Item2;                          // 0x0028(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FName                                   CallFunc_GetWeaponAttachmentPoint_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncStaticMeshComponent*              CallFunc_Array_Get_Item3;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Count;                                             // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponStudio_C_UpdateAttachment) == 0x000008, "Wrong alignment on WeaponStudio_C_UpdateAttachment");
static_assert(sizeof(WeaponStudio_C_UpdateAttachment) == 0x000090, "Wrong size on WeaponStudio_C_UpdateAttachment");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, m__int_Array_Index_Variable) == 0x000000, "Member 'WeaponStudio_C_UpdateAttachment::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, m__int_Array_Index_Variable2) == 0x000004, "Member 'WeaponStudio_C_UpdateAttachment::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Array_Get_Item) == 0x000008, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, m__int_Loop_Counter_Variable) == 0x000010, "Member 'WeaponStudio_C_UpdateAttachment::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_GetWeaponAttachmentAssetDatas_ReturnValue) == 0x000018, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_GetWeaponAttachmentAssetDatas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Array_Get_Item2) == 0x000028, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_GetWeaponAttachmentPoint_ReturnValue) == 0x000060, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_GetWeaponAttachmentPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00006C, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Array_Get_Item3) == 0x000070, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Array_Length_ReturnValue2) == 0x000078, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, m__int_Loop_Counter_Variable2) == 0x00007C, "Member 'WeaponStudio_C_UpdateAttachment::m__int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Less_IntInt_ReturnValue2) == 0x000081, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, CallFunc_Add_IntInt_ReturnValue2) == 0x000084, "Member 'WeaponStudio_C_UpdateAttachment::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponStudio_C_UpdateAttachment, Count) == 0x000088, "Member 'WeaponStudio_C_UpdateAttachment::Count' has a wrong offset!");

}

