#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponEquipmentSlotWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TslGame_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponEquipmentSlotWidget.WeaponEquipmentSlotWidget_C.ExecuteUbergraph_WeaponEquipmentSlotWidget
// 0x05D8 (0x05D8 - 0x0000)
struct WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslHUD*                                CallFunc_GetTslHUD_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FEquipPosition                         CallFunc_WeaponIndexToEquipPosition_ReturnValue;   // 0x0054(0x0008)()
	int32                                         m__int_Array_Index_Variable;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UEquipableItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         m__int_Loop_Counter_Variable2;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry3;                          // 0x0084(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent2;                        // 0x00B8(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation2;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0148(0x0078)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_SlotIndex;                      // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslItemDragDropOperation_C*            K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry2;                          // 0x01DC(0x0034)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0210(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0288(0x0078)(ConstParm)
	class UItem*                                  K2Node_Event_Item;                                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	class UTslItemDragDropOperation_C*            K2Node_Event_DragDropObject;                       // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_EnterOtherContainer_NewOtherContainer_CastInput; // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UTslItemDragDropOperation_C*            CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     K2Node_Event_InventoryWidget;                      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInventoryWidget_C*                     CallFunc_GetInventoryWidget_InventoryWidget;       // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponAttachmentSlotWidget_C*          CallFunc_Array_Get_Item;                           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue;                      // 0x0365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue2;                     // 0x0366(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_367[0x1];                                      // 0x0367(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue2;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0378(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeSeconds_ReturnValue3;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue;           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_ReturnValue;                 // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_DoSlotActionDefault_self_CastInput;       // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_DoSlotActionDefault_Slot_CastInput;       // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0400(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue3;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface; // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue;                     // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2; // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue2;                    // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x6];                                      // 0x0442(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildUpFocusableWidget_UpWidget;       // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildUpFocusableWidget_UpWidget2;      // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue4;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3; // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue3;                    // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4; // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue4;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildDownFocusableWidget_DownWidget;   // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildDownFocusableWidget_DownWidget2;  // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue5;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5; // 0x04B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue5;                    // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA[0x6];                                      // 0x04CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6; // 0x04D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue6;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E2[0x6];                                      // 0x04E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x04E8(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            CallFunc_GetChildLeftFocusableWidget_LeftWidget;   // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildLeftFocusableWidget_LeftWidget2;  // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue6;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m__int_Array_Index_Variable2;                      // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWeaponAttachmentSlotWidget_C*          CallFunc_Array_Get_Item2;                          // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7; // 0x0520(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ITslFocusableWidgetInterface> K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8; // 0x0538(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue7;                    // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetFocus_ReturnValue8;                    // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54B[0x5];                                      // 0x054B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildRightFocusableWidget_RightWidget; // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0558(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetChildRightFocusableWidget_RightWidget2; // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InputA_ReturnValue;                       // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue7;                     // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue8;                     // 0x057A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57B[0x5];                                      // 0x057B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetOwningShooterCharacter_ShooterCharacter2; // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AInventoryFacade*                       CallFunc_GetInventoryFacade_ReturnValue2;          // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AEquipment*                             CallFunc_GetEquipment_ReturnValue2;                // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotContainerInterface> CallFunc_DoSlotActionDefault_self2_CastInput;      // 0x05A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISlotInterface>        CallFunc_DoSlotActionDefault_Slot2_CastInput;      // 0x05B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x05C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsFocus_ReturnValue9;                     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelfAttachmentPutMode_bResult;          // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget) == 0x000008, "Wrong alignment on WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget");
static_assert(sizeof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget) == 0x0005D8, "Wrong size on WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, EntryPoint) == 0x000000, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetTslHUD_ReturnValue) == 0x000008, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetTslHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, m__int_Loop_Counter_Variable) == 0x000048, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::m__int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue2) == 0x00004C, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_WeaponIndexToEquipPosition_ReturnValue) == 0x000054, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_WeaponIndexToEquipPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, m__int_Array_Index_Variable) == 0x00005C, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::m__int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetItem_ReturnValue) == 0x000060, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue3) == 0x000068, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000070, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, m__int_Loop_Counter_Variable2) == 0x000080, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::m__int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_MyGeometry3) == 0x000084, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_MyGeometry3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_PointerEvent2) == 0x0000B8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_PointerEvent2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_Operation2) == 0x000130, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_Operation2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation) == 0x000138, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Add_IntInt_ReturnValue2) == 0x000144, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_PointerEvent) == 0x000148, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_Operation) == 0x0001C0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CustomEvent_SlotIndex) == 0x0001C8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CustomEvent_SlotIndex' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2) == 0x0001D0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Item_Drag_Drop_Operation2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess2) == 0x0001D8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_MyGeometry2) == 0x0001DC, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_MyGeometry2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_MouseEvent2) == 0x000210, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_MouseEvent) == 0x000288, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_Item) == 0x000300, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x000308, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_DragDropObject) == 0x000318, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_DragDropObject' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_EnterOtherContainer_NewOtherContainer_CastInput) == 0x000320, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_EnterOtherContainer_NewOtherContainer_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation) == 0x000330, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetTslItemDragDropOperation_Bp_TslItemDragDropOperation' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Array_Length_ReturnValue) == 0x000338, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_InventoryWidget) == 0x000340, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_InventoryWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000348, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetInventoryWidget_InventoryWidget) == 0x000350, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetInventoryWidget_InventoryWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Array_Get_Item) == 0x000358, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Array_Length_ReturnValue2) == 0x000360, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Less_IntInt_ReturnValue2) == 0x000364, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue) == 0x000365, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue2) == 0x000366, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetTimeSeconds_ReturnValue) == 0x000368, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetTimeSeconds_ReturnValue2) == 0x00036C, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetTimeSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000370, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000374, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_MyGeometry) == 0x000378, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_Event_InDeltaTime) == 0x0003AC, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetTimeSeconds_ReturnValue3) == 0x0003B0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetTimeSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0003B4, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003B8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter) == 0x0003C0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue4) == 0x0003C8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetInventoryFacade_ReturnValue) == 0x0003D0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetInventoryFacade_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetEquipment_ReturnValue) == 0x0003D8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_DoSlotActionDefault_self_CastInput) == 0x0003E0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_DoSlotActionDefault_self_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_DoSlotActionDefault_Slot_CastInput) == 0x0003F0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_DoSlotActionDefault_Slot_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate6) == 0x000400, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue3) == 0x000410, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface) == 0x000418, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess3) == 0x000428, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue) == 0x000429, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2) == 0x000430, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess4) == 0x000440, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue2) == 0x000441, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildUpFocusableWidget_UpWidget) == 0x000448, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildUpFocusableWidget_UpWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue5) == 0x000450, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildUpFocusableWidget_UpWidget2) == 0x000458, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildUpFocusableWidget_UpWidget2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue4) == 0x000460, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3) == 0x000468, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess5) == 0x000478, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue3) == 0x000479, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4) == 0x000480, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess6) == 0x000490, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue4) == 0x000491, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildDownFocusableWidget_DownWidget) == 0x000498, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildDownFocusableWidget_DownWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue6) == 0x0004A0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildDownFocusableWidget_DownWidget2) == 0x0004A8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildDownFocusableWidget_DownWidget2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue5) == 0x0004B0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5) == 0x0004B8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess7) == 0x0004C8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue5) == 0x0004C9, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6) == 0x0004D0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess8) == 0x0004E0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue6) == 0x0004E1, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate7) == 0x0004E8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildLeftFocusableWidget_LeftWidget) == 0x0004F8, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildLeftFocusableWidget_LeftWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue7) == 0x000500, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildLeftFocusableWidget_LeftWidget2) == 0x000508, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildLeftFocusableWidget_LeftWidget2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue6) == 0x000510, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, m__int_Array_Index_Variable2) == 0x000514, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::m__int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_Array_Get_Item2) == 0x000518, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7) == 0x000520, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess9) == 0x000530, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8) == 0x000538, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_AsTsl_Focusable_Widget_Interface8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_DynamicCast_bSuccess10) == 0x000548, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue7) == 0x000549, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_SetFocus_ReturnValue8) == 0x00054A, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_SetFocus_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildRightFocusableWidget_RightWidget) == 0x000550, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildRightFocusableWidget_RightWidget' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate8) == 0x000558, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue8) == 0x000568, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetChildRightFocusableWidget_RightWidget2) == 0x000570, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetChildRightFocusableWidget_RightWidget2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_InputA_ReturnValue) == 0x000578, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_InputA_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue7) == 0x000579, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue8) == 0x00057A, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetOwningShooterCharacter_ShooterCharacter2) == 0x000580, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetOwningShooterCharacter_ShooterCharacter2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsValid_ReturnValue9) == 0x000588, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetInventoryFacade_ReturnValue2) == 0x000590, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetInventoryFacade_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_GetEquipment_ReturnValue2) == 0x000598, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_GetEquipment_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_DoSlotActionDefault_self2_CastInput) == 0x0005A0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_DoSlotActionDefault_self2_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_DoSlotActionDefault_Slot2_CastInput) == 0x0005B0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_DoSlotActionDefault_Slot2_CastInput' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, K2Node_CreateDelegate_OutputDelegate9) == 0x0005C0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsFocus_ReturnValue9) == 0x0005D0, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsFocus_ReturnValue9' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget, CallFunc_IsSelfAttachmentPutMode_bResult) == 0x0005D1, "Member 'WeaponEquipmentSlotWidget_C_ExecuteUbergraph_WeaponEquipmentSlotWidget::CallFunc_IsSelfAttachmentPutMode_bResult' has a wrong offset!");

// Function WeaponEquipmentSlotWidget.WeaponEquipmentSlotWidget_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct WeaponEquipmentSlotWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentSlotWidget_C_Tick) == 0x000004, "Wrong alignment on WeaponEquipmentSlotWidget_C_Tick");
static_assert(sizeof(WeaponEquipmentSlotWidget_C_Tick) == 0x000038, "Wrong size on WeaponEquipmentSlotWidget_C_Tick");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WeaponEquipmentSlotWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_Tick, InDeltaTime) == 0x000034, "Member 'WeaponEquipmentSlotWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WeaponEquipmentSlotWidget.WeaponEquipmentSlotWidget_C.SetInventory
// 0x0008 (0x0008 - 0x0000)
struct WeaponEquipmentSlotWidget_C_SetInventory final
{
public:
	class UInventoryWidget_C*                     InventoryWidget_0;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentSlotWidget_C_SetInventory) == 0x000008, "Wrong alignment on WeaponEquipmentSlotWidget_C_SetInventory");
static_assert(sizeof(WeaponEquipmentSlotWidget_C_SetInventory) == 0x000008, "Wrong size on WeaponEquipmentSlotWidget_C_SetInventory");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_SetInventory, InventoryWidget_0) == 0x000000, "Member 'WeaponEquipmentSlotWidget_C_SetInventory::InventoryWidget_0' has a wrong offset!");

// Function WeaponEquipmentSlotWidget.WeaponEquipmentSlotWidget_C.UpdateDragDropObject
// 0x0008 (0x0008 - 0x0000)
struct WeaponEquipmentSlotWidget_C_UpdateDragDropObject final
{
public:
	class UTslItemDragDropOperation_C*            DragDropObject;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponEquipmentSlotWidget_C_UpdateDragDropObject) == 0x000008, "Wrong alignment on WeaponEquipmentSlotWidget_C_UpdateDragDropObject");
static_assert(sizeof(WeaponEquipmentSlotWidget_C_UpdateDragDropObject) == 0x000008, "Wrong size on WeaponEquipmentSlotWidget_C_UpdateDragDropObject");
static_assert(offsetof(WeaponEquipmentSlotWidget_C_UpdateDragDropObject, DragDropObject) == 0x000000, "Member 'WeaponEquipmentSlotWidget_C_UpdateDragDropObject::DragDropObject' has a wrong offset!");

