#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WebPopup.WebPopup_C
// 0x0058 (0x0298 - 0x0240)
class UWebPopup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Back;                                       // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_Exit;                                       // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UButton*                                Button_Reload;                                     // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UTslCoherentWidget*                     WebView;                                           // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class UBorder*                                WebViewBorder;                                     // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor)
	class FString                                 PopupId;                                           // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	UMulticastDelegateProperty_                   OnClosePopup;                                      // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bInitVisibility;                                   // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WebPopup(int32 EntryPoint);
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_37_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Reload_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Destruct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetPopupData(const class FString& PopupId_0, const class FString& Uri, bool UseBackgroundColor, const struct FLinearColor& BackgroundColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WebPopup_C">();
	}
	static class UWebPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWebPopup_C>();
	}
};
static_assert(alignof(UWebPopup_C) == 0x000008, "Wrong alignment on UWebPopup_C");
static_assert(sizeof(UWebPopup_C) == 0x000298, "Wrong size on UWebPopup_C");
static_assert(offsetof(UWebPopup_C, UberGraphFrame) == 0x000240, "Member 'UWebPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, Button_Back) == 0x000248, "Member 'UWebPopup_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, Button_Exit) == 0x000250, "Member 'UWebPopup_C::Button_Exit' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, Button_Reload) == 0x000258, "Member 'UWebPopup_C::Button_Reload' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, WebView) == 0x000260, "Member 'UWebPopup_C::WebView' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, WebViewBorder) == 0x000268, "Member 'UWebPopup_C::WebViewBorder' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, PopupId) == 0x000270, "Member 'UWebPopup_C::PopupId' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, OnClosePopup) == 0x000280, "Member 'UWebPopup_C::OnClosePopup' has a wrong offset!");
static_assert(offsetof(UWebPopup_C, bInitVisibility) == 0x000290, "Member 'UWebPopup_C::bInitVisibility' has a wrong offset!");

}

