#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetFunctionLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function WidgetFunctionLibrary.WidgetFunctionLibrary_C.GetOwningShooterCharacter
// 0x0048 (0x0048 - 0x0000)
struct WidgetFunctionLibrary_C_GetOwningShooterCharacter final
{
public:
	class UUserWidget*                            UserWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UObject*                                m_WorldContext;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          ShooterCharacter;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATslCharacter*                          K2Node_DynamicCast_AsTsl_Character;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTslVehicleSeatComponent*               CallFunc_GetVehicleSeatComponent_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATslCharacter*                          CallFunc_GetDriver_ReturnValue;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WidgetFunctionLibrary_C_GetOwningShooterCharacter) == 0x000008, "Wrong alignment on WidgetFunctionLibrary_C_GetOwningShooterCharacter");
static_assert(sizeof(WidgetFunctionLibrary_C_GetOwningShooterCharacter) == 0x000048, "Wrong size on WidgetFunctionLibrary_C_GetOwningShooterCharacter");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, UserWidget) == 0x000000, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::UserWidget' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, m_WorldContext) == 0x000008, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::m_WorldContext' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, ShooterCharacter) == 0x000010, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::ShooterCharacter' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, K2Node_DynamicCast_AsTsl_Character) == 0x000020, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::K2Node_DynamicCast_AsTsl_Character' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, CallFunc_GetVehicleSeatComponent_ReturnValue) == 0x000030, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::CallFunc_GetVehicleSeatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetFunctionLibrary_C_GetOwningShooterCharacter, CallFunc_GetDriver_ReturnValue) == 0x000040, "Member 'WidgetFunctionLibrary_C_GetOwningShooterCharacter::CallFunc_GetDriver_ReturnValue' has a wrong offset!");

}

